Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/2fa.po
Languages: ru

source: Two-Factor Authentication
ru: Двух-уровневая аутентификация:

source: Each user can enable the `two-factor authentication <http://en.wikipedia.org/wiki/Two_factor_authentication>`__. After a successful login, a one-time code (6 characters) is asked to the user to allow access to Kanboard.
ru: Любой пользователь может включить `двух-уровневую аутентификацию <http://en.wikipedia.org/wiki/Two_factor_authentication>`__. После успешного входа, разовый код (6 знаков) запрашивается у пользователя для получения доступа в Канборд.

source: This code has to be provided by a compatible software generally installed on your smartphone.
ru: Этот код присылается в программу на вашем смартфоне.

source: Kanboard use the `Time-based One-time Password Algorithm <http://en.wikipedia.org/wiki/Time-based_One-time_Password_Algorithm>`__ defined in the `RFC 6238 <http://tools.ietf.org/html/rfc6238>`__.
ru: Канборд использует `Time-based One-time Password Algorithm <http://en.wikipedia.org/wiki/Time-based_One-time_Password_Algorithm>`__ основанный на `RFC 6238 <http://tools.ietf.org/html/rfc6238>`__.

source: There are many software compatible with the standard TOTP system. For example, you can use these free and open source applications:
ru: Имеется много программ совместимых со стандартной системой TOTP. Например, вы можете использовать эти приложения, бесплатные и с открытым исходным кодом:

source: This system can work offline and you don't necessarily need to have a mobile phone.
ru: Эти системы могут работать офлайн и вам не нужно иметь мобильную связь.

source: Setup
ru: Настройка

source: Go to your user profile
ru: Перейдите в пользовательский профиль

source: On the left, click on **Two factor authentication** and check the box
ru: Слева нажмите **Двухфакторная авторизация** и поставте галочку в чекбоке

source: A secret key is generated for you
ru: Секретный ключ сгенерируется для вас

source: 2FA
ru: Рисунок. Двухуровневая аутентификация.

source: You have to save the secret key in your TOTP software. If you use a smartphone, the easiest solution is to scan the QR code with FreeOTP or Google Authenticator.
ru: Вы должны сохранить секретный ключ в вашей TOTP программе. Если вы используете сматрфон, то просто сосканируйте QR код с помощью FreeOTP или Google Authenticator.

source: Each time you will open a new session, a new code will be asked
ru: Каждый раз, когда вы будете входить в Канборд, будет запрашиваться новый код

source: Don't forget to test your device before closing your session
ru: Не забудьте протестировать ваше устройство, перед тем как закрыть вашу сессию

source: A new secret key is generated each time you enable/disable this feature.
ru: Новый секретный ключ генерируется каждый раз при включении/выключении этой возможности.
