Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/analytics.po
Languages: ru

source: Analytics
ru: Аналитика

source: Each project have an analytics section. Depending on how you are using Kanboard, you can see those reports:
ru: Каждый проект имеет анлитический раздел. В зависимости от того как вы используете Канборд, вы можете видеть подобные отчеты:

source: User repartition
ru: Перераспределение(загрузка) пользователей

source: This pie chart show the number of open tasks assigned per user.
ru: Круговая диаграмма, представленная выше, показыает количество открытых задач назначенных определенным пользователям.

source: Task distribution
ru: Распределение задач

source: This pie chart gives an overview of the number of open tasks per column.
ru: На рисунке выше, представлена круговая диаграмма, которая показывает количество открытых задач в определенных колонках.

source: Cumulative flow diagram
ru: Накопительная диаграмма

source: This chart shows the number of tasks cumulatively for each column over the time.
ru: Эта диаграмма отображает количество задач выполненных в каждой колонке в определенный промежуток времени.

source: Every day, the total number of tasks is recorded for each column.
ru: Счетчик задач записывается для каждой колонки каждый день.

source: If you would like to exclude closed tasks, change the `global project settings <project-configuration.markdown>`__.
ru: Если вы хотите исключить закрытые задачи, измените `глобальные настройки проекта <project-configuration.html>`__.

source: Note: You need to have at least two days of data to see the graph.
ru: Заметка: Для того чтобы увидеть этот график, вам нужно иметь, как минимум, данные за два дня.

source: Burn down chart
ru: Диаграмма сгорания

source: Burndown chart
ru: Рисунок. Диаграмма сгорания

source: The `burn down chart <http://en.wikipedia.org/wiki/Burn_down_chart>`__ is available for each project.
ru: `Диаграмма сгорания <https://ru.wikipedia.org/wiki/%D0%94%D0%B8%D0%B0%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B0_%D1%81%D0%B3%D0%BE%D1%80%D0%B0%D0%BD%D0%B8%D1%8F_%D0%B7%D0%B0%D0%B4%D0%B0%D1%87>`__ доступна для каждого проекта.

source: This chart is a graphical representation of work left to do versus time.
ru: Эта диаграмма отображает время затраченное на выполнение работы.

source: Kanboard use the complexity or story point to generate this diagram.
ru: Канборд использует историю задач для генерации этой диаграммы.

source: Everyday, the sum of the story points for each column is calculated.
ru: Сумма историй задач для каждой колонки пересчитывается каждый день.

source: Average time spent into each column
ru: Среднее время затраченное в каждой колонке

source: This chart shows the average time spent into each column for the last 1000 tasks.
ru: Этот график показывает среднее время затраченное в каждой колонке для последних 1000 задач.

source: Kanboard uses the task transitions to calculate the data.
ru: Канборд использует для подсчета данных переходы задач между колонками.

source: The time spent is calculated until the task is closed.
ru: Затраченное время подсчитывается до закрытия задачи.

source: Average Lead and Cycle time
ru: Среднее время выполнения и время цикла

source: This chart show the average lead and cycle time for the last 1000 tasks over time.
ru: Эта диаграмма показывает Среднее время выполнения и цикла для последних 1000 задач.

source: The lead time is the time between the task creation and the date of completion.
ru: Время выполнения - время между созданием задачи и датой завершения.

source: The cycle time is time between the specified start date of the task to the completion date.
ru: Время цикла - время между указанной датой начала выполнения задачи и датой завершения.

source: If the task is not closed, the current time is used instead of the date of completion.
ru: Если задача не закрыта, текущая дата будет использована вместо даты завершения.

source: Those metrics are calculated and recorded every day for the whole project.
ru: Эти данные подсчитываются и записываются каждый день на протяжении жизни проекта.

source: Note: Don't forget to run the `daily cronjob <cronjob.markdown>`__ to have accurate statistics.
ru: Заметка: Не забудьте выполнить `ежедневные cronjob <cronjob.html>`__ для того чтобы иметь точную статистику.
