Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/analytics-tasks.po
Languages: ru

source: Analytics for tasks
ru: Аналитика для задач

source: Each task has an analytics section available from the left menu in the task view.
ru: На странице детального просмотра задачи, в левом боковом меню, для каждой задачи имеется раздел аналитики.

source: Lead and cycle time
ru: Затраченное время и время цикла

source: The lead time is the time between the task creation and the date of completion (task closed).
ru: Затраченное время - время между созданием задачи и датой завершения (закрытие задачи).

source: The cycle time is the time between the start date and the date of completion.
ru: Время цикла - время между началом испольнения задачи и датой завершения.

source: If the task is not closed the current time is used instead of the date of completion.
ru: Если задача не закрыта, то для расчета используется текущее время вместо даты завершения.

source: If the start date is not specified, the cycle time is not calculated.
ru: Если дата начала выполнения задачи не указана, то время цикла не может быть расчитано.

source: Note: You can configure an automatic action to define the start date automatically when you move a task to the column of your choice.
ru: **Заметка**: Вы можете настроить автоматическое создание даты начала выполения задачи, когда вы перемещаете задачу в определенную колонку.

source: Time spent into each column
ru: Время затраченное в каждой колонке

source: This chart shows the total time spent into each column for the task.
ru: Этот график показывает сколько времени задача находилась в каждой колонке.

source: The time spent is calculated until the task is closed.
ru: Затраченное время расчитывается до закрытия задачи.
