Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/application-configuration.po
Languages: ru

source: Application settings
ru: Настройки приложения

source: Some parameters for the application can be changed on the settings page. Only administrators can change those settings.
ru: Некоторые параметры для приложения могут быть изменены на странице настроек. Только администратор может сделать эти настройки.

source: Go to the menu **Settings**, then choose **Application settings** on the left.
ru: Выберите в правом выпадающем меню **Настройки**, затем в слева выберите **Настройки приложения**.

source: Application URL
ru: URL приложения

source: This parameter is used for email notifications. The email footer will contain a link to the Kanboard task.
ru: Этот параметр используется для email уведомлений. В тексте сообщения будет содержаться ссылка на задачу в Канборде.

source: Language
ru: Язык

source: The application language can be changed at anytime. The language will be set for all users.
ru: Язык приложения может быть изменен в любое время. Язык устанавливается для всех пользователей Канборд.

source: Time zone
ru: Часовой пояс

source: By default, Kanboard use UTC as time zone, but you can define your own time zone. The list contains all supported time zones by your web server.
ru: По умолчанию, Канборд использует часовой пояс UTC, но вы можете указать любой часовой пояс. Список содержит все поддерживаемые часовые пояса для вашего веб сервера.

source: Date format
ru: Формат даты

source: Input format used for date fields, for examples the due date for tasks.
ru: Формать даты, который используется для полей дата. Например, дата завершения задачи.

source: Kanboard offers 4 different formats:
ru: Канборд поддерживает 4 разных формата:

source: DD/MM/YYYY
ru: ДД/ММ/ГГГГ

source: MM/DD/YYYY (default)
ru: ММ/ДД/ГГГГ (по умолчанию)

source: YYYY/MM/DD
ru: ГГГГ/ММ/ДД

source: MM.DD.YYYY
ru: ММ.ДД.ГГГГ

source: The `ISO 8601 <http://en.wikipedia.org/wiki/ISO_8601>`__ format is always accepted (YYYY-MM-DD or YYYY\_MM\_DD).
ru: Формат `ISO 8601 <http://en.wikipedia.org/wiki/ISO_8601>`__ всегда принимается (YYYY-MM-DD or YYYY\_MM\_DD).

source: Custom Stylesheet
ru: Пользовательский стиль CSS

source: Write your own CSS to override or improve Kanboard default style.
ru: Вы можете сделать свой стиль CSS для Канборд или улучшить имеющийся стиль.
