Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/assets.po
Languages: ru

source: How to build assets (Javascript and CSS files)
ru: Как создать asset (Javascript и CSS файлы)

source: Stylesheet and Javascript files are merged together and minified.
ru: Файлы CSS стилей и Javascript объединены вместе и минимизированы.

source: Original CSS files are stored in the folder ``assets/css/src/*.css``
ru: Оригинальные файлы CSS хранятся в каталоге ``assets/css/src/*.css``

source: Original Javascript code is stored in the folder ``assets/js/src/*.js``
ru: Оригинальные файлы Javascript хранятся в каталоге ``assets/js/src/*.js``

source: ``assets/*/vendor.min.*`` are external dependencies merged and minified
ru: ``assets/*/vendor.min.*`` - внешние зависимости объединены и минимизированы

source: ``assets/*/app.min.*`` are application source code merged and minified
ru: ``assets/*/app.min.*`` - исходный код приложения объединены и минимизированы

source: Requirements
ru: Требования

source: `NodeJS <https://nodejs.org/>`__ with ``npm``
ru: `NodeJS <https://nodejs.org/>`__ с ``npm``

source: Building Javascript and CSS files
ru: Сборка файлов Javascript и CSS

source: Kanboard use `Gulp <http://gulpjs.com/>`__ to build the assets and `Bower <http://bower.io/>`__ to manage dependencies. These tools are installed as NodeJS dependencies into the project.
ru: Канборд использует `Gulp <http://gulpjs.com/>`__ для сборки asset и `Bower <http://bower.io/>`__ для управления зависимостями. Эти утилиты устанавлены в проекте как зависимости NodeJS.

source: Run everything
ru: Запустить все

source: Build ``vendor.min.js`` and ``vendor.min.css``
ru: Собрать ``vendor.min.js`` и ``vendor.min.css``

source: Build ``app.min.js``
ru: Собрать ``app.min.js``

source: Build ``app.min.css``
ru: Собрать ``app.min.css``

source: Notes
ru: Примечание

source: Building assets is not possible from the Kanboard's archive, you have to clone the repository.
ru: Сборка asset невозможна из архива Kanboard, вы должны клонировать репозиторий.
