Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/automatic-actions.po
Languages: ru

source: Automatic Actions
ru: Автоматизация процессов

source: To minimize the user interaction, Kanboard support automated actions.
ru: Для минимизации пользовательских действий, Kanboard поддерживает автоматизацию процессов.

source: Each automatic action is defined like that:
ru: Каждый автоматизированный процесс представляет следующее:

source: An event to listen
ru: Ожидание наступления события

source: Action linked to this event
ru: Выполняется действие при наступлении этого события

source: Eventually there is some parameters to define
ru: В результате устанавливается определенный параметр

source: Each project has a different set of automatic actions, the configuration panel is located on the project listing page, just click on the link **Automatic actions**.
ru: Каждый проект может иметь свой набор автоматических процессов. Автоматические процессы доступны в панеле настроек (**Меню** -> **Настройки**) **Автоматические действия**.

source: Add a new action
ru: Добавление нового действия

source: Click on the link **Add a new automatic action**.
ru: Нажмите на ссылку **Добавить новое действие**.

source: Automatique action
ru: Рисунок. Автоматическое действие.

source: Choose an action
ru: Выберете действие

source: Then, select an event
ru: Затем, выберете событие

source: And finally, define the parameters
ru: И в завершении, задайте параметр

source: List of available actions
ru: Список доступных действий

source: Create a comment from an external provider
ru: Создать комментарий из внешнего источника

source: Add a comment log when moving the task between columns
ru: Добавлять запись при перемещении задачи между колонками

source: Assign automatically a category based on a color
ru: Автоматически назначать категорию по цвету

source: Change the category based on an external label
ru: Изменить категорию основываясь на внешнем ярлыке

source: Assign automatically a category based on a link
ru: Автоматически назначать категории на основе ссылки

source: Assign automatically a color based on a category
ru: Автоматически назначать цвет по категории

source: Assign a color when the task is moved to a specific column
ru: Назначить цвет, когда задача перемещается в определенную колонку

source: Change task color when using a specific task link
ru: Изменение цвета задач при использовании ссылки на определенные задачи

source: Assign a color to a specific user
ru: Назначить определенный цвет пользователю

source: Assign the task to the person who does the action
ru: Назначить задачу тому кто выполнит действие

source: Assign the task to the person who does the action when the column is changed
ru: Назначить задачу пользователю, который произвел изменение в колонке

source: Assign the task to a specific user
ru: Назначить задачу определенному пользователю

source: Change the assignee based on an external username
ru: Изменить назначенного основываясь на внешнем имени пользователя

source: Close the task
ru: Закрыть задачу

source: Close a task in a specific column
ru: Закрыть задачу в выбранной колонке

source: Create a task from an external provider
ru: Создать задачу из внешнего источника

source: Duplicate the task to another project
ru: Создать дубликат задачи в другом проекте

source: Send a task by email to someone
ru: Отправить задачу по email

source: Move the task to another project
ru: Переместить задачу в другой проект

source: Move the task to another column when assigned to a user
ru: Переместить задачу в другую колонку, когда она назначена пользователю

source: Move the task to another column when the category is changed
ru: Переносить задачи в другую колонку при изменении категории

source: Move the task to another column when assignee is cleared
ru: Переместить задачу в другую колонку, когда назначение снято

source: Open a task
ru: Открыть задачу

source: Automatically update the start date
ru: Автоматическое обновление даты начала

source: Examples
ru: Примеры

source: Here are some examples used in real life:
ru: Здесь предствалены примеры использованные в реальной жизни:

source: When I move a task to the column "Done", automatically close this task
ru: Когда я перемещаю задачу в колонку "Выполнено", автоматически закрывать эту задачу

source: Choose action: **Close a task in a specific column**
ru: Выберите действия: **Закрыть задачу в выбранной колонке**

source: Choose the event: **Move a task to another column**
ru: Выберите событие: **Переместить задачу в другую колонку**

source: Define action parameter: **Column = Done** (this is the destination column)
ru: Установите параметр действия: **Колонка = Выполнено** (это колонка в которую будет перемещена задача)

source: When I move a task to the column "To be validated", assign this task to a specific user
ru: Когда я перемещаю задачу в колонку "На утверждение", назначить эту задачу определенному пользователю.

source: Choose the action: **Assign the task to a specific user**
ru: Выберите действие: **Назначить задачу определенному пользователю**

source: Define the action parameters: **Column = To be validated** and **User = Bob** (Bob is our tester)
ru: Установите параметр действия: **Колонка = На утверждение** и **Пользователь = Петр** (Петр - наш тестировщик)

source: When I move a task to the column "Work in progress", assign this task to the current user
ru: Когда я перемещаю задачу в колонку "В работе", назначить эту задачу определенному пользователю

source: Choose action: **Assign the task to the person who does the action when the column is changed**
ru: Выберите действие: **Назначить задачу пользователю, который произвел изменение в колонке**

source: Define action parameter: **Column = Work in progress**
ru: Установите параметр действия: **Колонка = В работе**

source: When a task is completed, duplicate this task to another project
ru: Когда задача выполнена, скопировать эту задачу в другой проект

source: Let's say we have two projects "Customer orders" and "Production", once the order is validated, swap it to the "Production" project.
ru: Предположим, мы имеем два проекта "Заказы покупателей" и "Производство". Когда заказ в проекте "Заказы покупателей" утвержден, копируем этот заказ в проект "Производство".

source: Choose action: **Duplicate the task to another project**
ru: Выбираем действие: **Создать дубликат задачи в другом проекте**

source: Choose the event: **Closing a task**
ru: Выбираем событие: **Завершение задачи**

source: Define action parameters: **Column = Validated** and **Project = Production**
ru: Установите параметр действия: **Колонка = Утвержден** и **Проект = Производство**

source: When a task is moved to the last column, move the exact same task to another project
ru: Когда задача перемещена в последнюю колонку, переместить эту задачу в другой проект

source: Let's say we have two projects "Ideas" and "Development", once the idea is validated, swap it to the "Development" project.
ru: Предположим, мы имеем два проекта "Идеи" и "Разработка", когда идея утверждена, перемещаем эту задачу в проект "Разработка".

source: Choose action: **Move the task to another project**
ru: Выберите действие: **Переместить задачу в другой проект**

source: Define action parameters: **Column = Validated** and **Project = Development**
ru: Установите параметр действия: **Колонка = Утверждена** и **Проект = Разработка**

source: I want to assign automatically a color to the user Bob
ru: Я хочу назначать автоматически цвет для пользователя Петр

source: Choose action: **Assign a color to a specific user**
ru: Выберите действие: **Назначить определенный цвет пользователю**

source: Choose the event: **Task assignee change**
ru: Выберите событие: **Изменен назначенный**

source: Define action parameters: **Color = Green** and **Assignee = Bob**
ru: Установите параметр действия: **Цвет = Зеленый** и **Назначена = Петр**

source: I want to assign a color automatically to the defined category "Feature Request"
ru: Я хочу назначить цвет автоматически для определенной категории "Важные запросы"

source: Choose action: **Assign automatically a color based on a category**
ru: Выберите действие: **Автоматически назначать цвет по категории**

source: Choose the event: **Task creation or modification**
ru: Выберите событие: **Создание или изменение задачи**

source: Define action parameters: **Color = Blue** and **Category = Feature Request**
ru: Установите параметр действия: **Цвет = Голубой** и **Категория = Важные запросы**

source: I want to set the start date automatically when the task is moved to the column "Work in progress"
ru: Я хочу устанавливать дату начала автоматически когда задача перемещена в колонку "В работе"

source: Choose action: **Automatically update the start date**
ru: Выберите действие: **Автоматическое обновление даты начала**

source: Define action parameters: **Column = Work in progress**
ru: Установите параметр действия: **Колонка = В работе**
