Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/board-configuration.po
Languages: ru

source: Board settings
ru: Настройка Доски

source: Go to the menu **Settings**, then choose **Board settings** on the left.
ru: В правом верхнем выпадающем меню выберите **Настройки**, затем, слева, выберите **Настройки Доски**.

source: Task highlighting
ru: Подстветка задач

source: This feature displays a shadow around the task when a task is moved recently.
ru: Эта опция позволяет подсвечивать задачу, которая была перенесена недавно.

source: Set the value 0 to disable this feature, 2 days by default (172800 seconds).
ru: Установите значение 0 для выключения подсветки. По умолчанию установлено значение 172800 секунд (2 дня)

source: Everything moved since 2 days will have shadow around the task.
ru: Перемещенные задачи будут подсвечиваться в течении двух дней.

source: Refresh interval for public board
ru: Период обновления для публичных досок

source: When you share a board, the page will refresh every 60 seconds automatically by default.
ru: Если вы создаете публичную доску, то страница, по умолчанию, будет обновляться каждые 60 секунд.

source: Refresh interval for private board
ru: Период обновления для частных досок

source: When your web browser is open on a board, Kanboard checks every 10 seconds if something has been changed by someone else.
ru: Когда в вашем браузере открыта Доска, Канборд проверяет обновления изменение каждые 10 секунд.

source: Technically this process is done by Ajax polling.
ru: Процесс обновления реализован по технологии Ajax.
