Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/calendar-configuration.po
Languages: ru

source: Calendar settings
ru: Настройки календаря

source: Go to the menu **Settings**, then choose **Calendar settings** on the left.
ru: В правом верхнем выпадающем меню выберите **Настройки**, затем, слева, выберите **Настройки календаря**.

source: There are two different calendars in Kanboard:
ru: В Канборде имеется два вида Календаря:

source: Project calendar
ru: Календарь проекта

source: User calendar (available from the dashboard)
ru: Пользовательский календарь (доступен в левом меню Инфопанели)

source: This calendar shows tasks with defined due date and tasks based on the creation date or the start date.
ru: Эти календари показывают задачи с указанной датой создания или датой начала и датой завершения.

source: Show tasks based on the creation date
ru: Показать задачи в зависимости от даты создания

source: The start date of the calendar event is the creation date of the task.
ru: Дата начала в календаре показывает дату создания задачи.

source: The end date of the event is the date of completion.
ru: Конечная дата показывает дату завершения.

source: Show tasks based on the start date
ru: Показать задачи в зависимости от даты начала

source: The start date of the calendar event is the start date of the task.
ru: Дата начала в календаре показывает дату начала задачи.

source: This date can be defined manually.
ru: Эта дата должна быть установлена вручную.

source: If there is no start date the task will not appear on the calendar.
ru: Если не указать дату начала, то задача не будет отображена в календаре.

source: User calendar
ru: Пользовательский календарь

source: This calendar shows only tasks assigned to the user and optionally sub-tasks information.
ru: Пользовательский календарь показывает только задачи назначенные пользователю и, опционально, информацию о подзадачах.

source: Show sub-tasks based on the time tracking
ru: Показать подзадачи, основанные на отслеживании времени

source: Display sub-tasks in the calendar from the information recorded in the time tracking table.
ru: Показывает подзадачи в календаре из записей таблицы отслеживания времени.

source: The intersection with the user timetable is also calculated.
ru: Пересечения в пользовательской таблице времени также подсчитываются.

source: Show sub-task estimates (forecast of future work)
ru: Показывать оценку подзадач (прогнозирование будущих работ)

source: Display the estimate of future work for sub-tasks in status "todo" and with a defined "estimate" value.
ru: Показывает оценку будущих работ для подзадач в статусе "для исполнения" и с указанным значением "оценка".
