Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/calendar.po
Languages: ru

source: Calendar
ru: Календарь

source: There are two different views for the calendar:
ru: Календарь может быть представлен в двух видах:

source: The project view with filters (available from the board)
ru: Представление в проекте с использование фильтров (доступно на Доске)

source: The user view (available from the dashboard and from the user section)
ru: Пользовательское представление (доступно в рабочей панели и в пользовательском разделе)

source: At this time the calendar is able to display this information:
ru: На сегодняшний день в Календаре можно увидеть следующую информацию:

source: Tasks with a due date, displayed at the top. **The due date can be changed by moving the task to another day**.
ru: Задачи с "датой испольнения", отображаются наверху. **Дата испольнения может быть изменена перемещением задачи на другой день**.

source: Tasks based on the creation date or the start date. **These events cannot be modified with the calendar**.
ru: Задачи с датой создания или датой начала. **Эти события не могут быть изменены в календаре**.

source: Sub-task time tracking, all recorded time slot will be shown in the calendar.
ru: Отслеживание времени подзадачи. Все записанные временные диапазоны будут отображены в Календаре.

source: Sub-task estimates, forecasts of work left
ru: Подсчеты, прогнозы затрачиваемого время на подзадачу.

source: The calendar configuration can be changed in the settings page.
ru: Настроки Календаря могут быть изменены на странице **Настройки**

source: Note: The due date doesn't contain time information.
ru: Заметка: Дата исполения не содержит информацию о времени.
