Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/centos-installation.po
Languages: ru

source: Centos Installation
ru: Инсталяция Канборд на Centos

source: Note: Some features of Kanboard require that you run `a daily background job <cronjob.markdown>`__.
ru: **Внимание**: Некоторые возможности Канборда требуют `запуск ежедневных фоновых задач <cronjob.html>`__.

source: Install PHP and Apache:
ru: Установите PHP и Apache:

source: By default Centos 7 use PHP 5.4.16 and Apache 2.4.6.
ru: По умолчанию, Centos 7 использует PHP 5.4.16 и Apache 2.4.6.

source: Restart Apache:
ru: Перезапустите Apache:

source: Install Kanboard:
ru: Установите Канборд:

source: If SELinux is enabled, be sure that the Apache user can write to the directory data:
ru: Если включен SELinux, убедитесь что пользователь веб сервера Apache имеет права на запись в директорию data:

source: Be sure to configure your server to allow Kanboard to send emails and make external network requests, by example with SELinux:
ru: Убедитесь, что Канборд может посылать email сообщения и делать внешние сетевые запросы, например с SELinux:

source: Allowing external connections is necessary if you use LDAP, SMTP, Web hooks or any third-party integration.
ru: Позволяет делать внешние подключения если используется LDAP, SMTP, Web hooks или другая интеграция.

source: By default Centos 6.5 use PHP 5.3.3 and Apache 2.2.15.
ru: По умолчанию, Centos 6.5 использует PHP 5.3.3 и Apache 2.2.15.

source: Enable short tags:
ru: Включите короткие теги:

source: Edit the file ``/etc/php.ini``
ru: Отредактируйте файл ``/etc/php.ini``

source: Change the line ``short_open_tag = On``
ru: Измените строку ``short_open_tag = On`` (вместо ``short_open_tag = Off``)

source: Go to ``http://your_server/kanboard/``.
ru: Готово. Можете работать с Канборд. Откройте в браузере ``http://ваш_сервер/kanboard/``.
