Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/cli.po
Languages: ru

source: Command Line Interface
ru: Интерфейс командной строки

source: Kanboard provides a simple command line interface that can be used from any Unix terminal. This tool can be used only on the local machine.
ru: Канборд обеспечивает простой интерфейс командной строки, которым можно воспользоваться только из Unix терминала. Эта возможность доступна только с локальной машины.

source: This feature is useful to run commands outside of the web server processes.
ru: Интерфейс командной строки полезен для выполнения команд вне процессов веб сервера.

source: Usage
ru: Использование

source: Open a terminal and go to your Kanboard directory (example: ``cd /var/www/kanboard``)
ru: Откройте терминал и перейдите в директорию Канборд (например: ``cd /var/www/kanboard``)

source: Run the command ``./kanboard``
ru: Выполните команду ``./kanboard``

source: Available commands
ru: Доступные команды

source: Tasks CSV export
ru: Экспорт задач в формате CSV

source: Usage:
ru: Применение:

source: Example:
ru: Пример:

source: CSV data are sent to ``stdout``.
ru: Данные CSV передаются в ``stdout``.

source: Subtasks CSV export
ru: Экспорт подзадач в формате CSV

source: Task transitions CSV export
ru: Экспорт перемещения задач в формате CSV

source: Export daily summaries data in CSV
ru: Экспорт ежедневных сведений в формате CSV

source: The exported data will be printed on the standard output:
ru: Экспортированные данные будут выведены в стандартный вывод:

source: Send notifications for overdue tasks
ru: Отправка уведомлений для просроченных задач

source: Emails will be sent to all users with notifications enabled.
ru: Email сообщения будут отправлены всем пользователям, у которых включено оповещение.

source: Optional parameters:
ru: Необязательные параметры:

source: ``--show``: Display notifications sent
ru: ``--show``: Показывать отправку уведомлений

source: ``--group``: Group all overdue tasks for one user (from all projects) in one email
ru: ``--group``: Группировать все просроченные задачи для одного пользователя (со всех проектов) на один email

source: ``--manager``: Send all overdue tasks to project manager(s) in one email
ru: ``--manager``: Посылать все просроченные задачи менеджеру (менеджерам) проекта в одном email сообщении

source: You can also display the overdue tasks with the flag ``--show``:
ru: Вы можете просмотреть просроченные задачи с помощью параметра ``--show``:

source: Run daily project stats calculation
ru: Запуск ежедневной калькуляции статистики

source: This command calculate the statistics of each project:
ru: Эта команда считает статистику для каждого проекта:

source: Trigger for tasks
ru: Триггеры для задач

source: This command send a "daily cronjob event" to all open tasks of each project.
ru: Эта команда посылает "событие для ежедневных фоновых заданий" для всех открытых задач в каждом проекте.

source: Reset user password
ru: Сброс пароля пользователя

source: You will be prompted for a password and confirmation. Characters are not printed to the screen.
ru: Будет запрошен пароль и подтверждение. Символы не отображаются на экране.

source: Remove two-factor authentication for a user
ru: Удаление двухуровневой аутентификации для пользователя

source: Install a plugin
ru: Установка плагина

source: Note: Installed files will have the same permissions as the current user
ru: Заметка: Установленные файлы будут иметь теже права, что и у текущего пользователя

source: Remove a plugin
ru: Удаление плагина

source: Upgrade all plugins
ru: Обновление всех плагинов
