Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/coding-standards.po
Languages: ru

source: Coding standards
ru: Стандарты используемые при написании кода

source: PHP code
ru: Код PHP

source: Indentation: 4 spaces
ru: Отступ: 4 пробела

source: Line return: Unix => ``\n``
ru: Перевод строки: Unix => ``\n``

source: Encoding: UTF-8
ru: Кодировка: UTF-8

source: Use only the opening tags ``<?php`` or ``<?=`` for templates, but **never** use ``<?``
ru: Используйте только открытые теги ``<?php`` or ``<?=`` для templates, но **никогда** не используйте ``<?``

source: Always write PHPdoc comments for methods and class properties
ru: Всегда пишите коментарии PHPdoc для свойств методов и классов

source: Coding style: `PSR-1 <http://www.php-fig.org/psr/psr-1/>`__ and `PSR-2 <http://www.php-fig.org/psr/psr-2/>`__
ru: Стиль кодирования: `PSR-1 <http://www.php-fig.org/psr/psr-1/>`__ и `PSR-2 <http://www.php-fig.org/psr/psr-2/>`__

source: JavaScript code
ru: Код JavaScript

source: CSS code
ru: Код CSS
