Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/config.po
Languages: ru

source: Config file
ru: Конфигурационный файл

source: You can customize the default settings of Kanboard by adding a file ``config.php`` at the project root or in the ``data`` folder. You can also rename the file ``config.default.php`` to ``config.php`` and change the desired values.
ru: Вы можете изменить базовые настройки Канборда добавив файл ``config.php`` в корень проекта или в каталог ``data``. Вы, также, можете переименовать файл ``config.default.php`` в ``config.php`` и установить желаемые значения.

source: Enable/Disable debug mode
ru: Включение/выключение режима отладки

source: The log driver must be defined if you enable the debug mode. The debug mode logs all SQL queries and the time taken to generate pages.
ru: Обработчик логов может быть определен если вы включите режим отладки. Режим отладки фиксирует все SQL запросы и время затрачиваемое на генерацию страниц.

source: Plugins
ru: Плагины

source: Plugin folder:
ru: Каталог плагинов:

source: Enable/disable plugin installation from the user interface:
ru: Включение/выключение установки плагинов через интерфейс пользователя:

source: Folder for uploaded files
ru: Каталог для загружаемых файлов

source: Enable/disable url rewrite
ru: Включение/выключение переопределения url адресов

source: Email configuration
ru: Настройка email

source: Database settings
ru: Настройки базы данных

source: LDAP settings
ru: Настройки LDAP

source: Reverse-Proxy Authentication settings
ru: Настройки аутентификации Reverse-Proxy

source: RememberMe Authentication settings
ru: Настройки аутентификации RememberMe

source: Secure HTTP headers settings
ru: Настройки Secure HTTP headers

source: Logging
ru: Запись событий

source: By default, Kanboard do not log anything. If you want to enable the logging, you have to set a log driver.
ru: По умолчанию, Канборд записывает не все события. Если вы хотите включить запись событий, вы должны установить обработчик логов.

source: Brute-force protection
ru: Защита от Brute-force

source: Session
ru: Сессии

source: HTTP client proxy
ru: Проксирование клиентских HTTP

source: If external HTTP requests need to be sent through a proxy:
ru: Если внешние запросы HTTP необходимо пробрасывать через прокси:

source: Various settings
ru: Другие настройки
