Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/contributing.po
Languages: ru

source: Contributor Guidelines
ru: Руководство для участников проекта

source: How can I help?
ru: Как я могу помочь проекту?

source: Kanboard is not perfect but there are many ways to help:
ru: Канборд пока не идеален, поэтому есть несколько вариантов помочь проекту:

source: Give feedback
ru: Присылать отзывы

source: Report bugs
ru: Сообщать об ошибках

source: Add or update translations
ru: Добавлять или обновлять переводы

source: Improve the documentation
ru: Улучшать документацию

source: Writing code
ru: Писать код

source: Tell your friends that Kanboard is awesome :)
ru: Рассказать друзьям, что Канборд отличная программа :)

source: Before doing any large undertaking, open a new issue and explain your proposal.
ru: Перед тем как начать большое дело, создайте новое "обсуждение вопроса" (issue) на https://github.com/fguillot/kanboard/issues и объясните ваше предложение.

source: I want to give feedback
ru: Я хочу внести предложения по проекту

source: You think something should be improved (user interface, feature requests)
ru: У вас есть идея по улучшению (пользовательский интерфейс или другие возможности)

source: Check if your idea is not already proposed
ru: Посмотрите в обсуждениях (issue), может ваша идея уже предложена кем-то

source: Open a new issue
ru: Откройте новое обсуждение (issue)

source: Describe your idea
ru: Опишите вашу идею

source: You can also up-vote with +1 on existing proposals
ru: Вы можете проголосовать +1 за имеющиеся предложения

source: I want to report a bug
ru: Я хочу сообщить об ошибке

source: Check if the issue is not already reported
ru: Убедитесь, что обсуждение вопроса (issue) ранее не публиковалось

source: Open a new ticket
ru: Откройте новую заявку (ticket)

source: Explain what is broken
ru: Опишите, что именно не работает

source: Describe how to reproduce the bug
ru: Опишите, как воспроизвести ошибку (последовательность, как вы вышли на данную ошибку)

source: Describe your environment (Kanboard version, OS, web server, PHP version, database version, hosting provider)
ru: Опишите ваше окружение (версию Канборда, какая ОС, веб сервер, версию PHP, база данных и версия, хостинг провайдер)

source: I want to translate Kanboard
ru: Я хочу перевести Канборд на другой язык

source: Kanboard is translated in many languages. However, translations are not complete, take look at the `translation guide to contribute <https://kanboard.net/documentation/translations>`__.
ru: Канборд уже переведен на несколько языков. Вы можете улучшить эти переводы. Некоторые переводы еще не завершены. Для того, чтобы сделать перевод, ознакомтесь с `руководством по переводу на другой язык <translations.html>`__.

source: I want to improve the documentation
ru: Я хочу улучшить документацию

source: You think something is not clear, there is grammatical errors, typo errors, anything.
ru: Вы считаете, что что-то недостаточно хорошо описано, имеются грамматические или орфографические ошибки, что-то еще.

source: The documentation is written in Markdown and stored in the folder ``docs``.
ru: Документация написана в формате Markdown и хранится в каталоге ``docs``.

source: Edit the files and send a pull-request.
ru: Редактируйте файлы и присылайте pull-request.

source: The documentation on the official website is synchronized with the repository.
ru: Документация на официальном вебсайте синхронизируется с репозиторием.

source: I want to contribute to the code
ru: Я хочу внести свой вклад в код

source: Pull-requests are always welcome however, to be accepted you have to follow those directives:
ru: Pull-requests всегда приветствуются, однако, чтобы они были приняты, вы должны следовать следующим указаниям:

source: **Before doing any large change or design proposal, open a new ticket to start a discussion.**
ru: **Перед тем как внести большое изменение или переделать дизайн, откройте новую заявку (ticket) для обсуждения.**

source: If you want to add a new feature, respect the philosophy behind Kanboard. **We focus on simplicity**, we don't want to have a bloated software.
ru: Если вы хотите добавить новую возможность, уважайте филосовию Канборда: **Мы фокусируемся на простоте**, мы не хотим иметь раздутую программу.

source: The same apply for the user interface, **simplicity and efficiency**.
ru: Это же относится и к пользовательскому интерфейсу: **простота и производительность**

source: Send only one pull-request per feature or bug fix.
ru: Присылайте только по одному pull-request для новой возможности или исправления ошибки.

source: A smaller pull-request is easier to review and faster it will be merged.
ru: Небольшие pull-request легче просмотреть и быстрее влить в проект.

source: Make sure the `unit tests pass <tests.markdown>`__.
ru: Убедитесь, что `модульные тесты выполняются успешно <tests.html>`__.

source: Respect the `coding standards <coding-standards.markdown>`__.
ru: Уважайте `стандарты кодирования <coding-standards.html>`__.

source: Write maintainable code, avoid code duplication, use PHP good practices.
ru: Пишите код, который могут поддерживать другие, избегайте дублирования, используйте лучше практики PHP.

source: In any case, if you are not sure about something open a new ticket.
ru: В любом случае, если вы не уверены в чем-то - открывайте новую заявку (ticket)

source: If you use Kanboard, spread the word around you. Tell them that free and open source software are cool :)
ru: Если вы используете Канборд, покажите его и окружающим. Расскажите всем о прелестях бесплатного и опенсурсного программного обеспечения.
