Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/creating-tasks.po
Languages: ru

source: Creating Tasks
ru: Создание задач

source: From the board, click on the plus sign next to the column name:
ru: На Доске нажмите значок плюс рядом с названием колонки:

source: Task creation from the board
ru: Рисунок. Создание задачи на Доске

source: Then the task creation form appears:
ru: Далее появится форма создания задачи:

source: Task creation form
ru: Рисунок. Форма создания задачи.

source: The only mandatory field is the title.
ru: Только поле **Название** является обязательным полем для заполнения.

source: Field description:
ru: Описание полей:

source: **Title**: The title of your task, which will be displayed on the board.
ru: **Название**: Название вашей задачи, которое будет отображаться на доске.

source: **Description**: Allow you to add more information about the task, the content can be written in `Markdown <https://kanboard.net/documentation/syntax-guide>`__.
ru: **Описание**: Позволяет вам добавить больше информации о задаче, содержимое может содержать синтаксис `Markdown <syntax-guide.html>`__.

source: **Create another task**: Check this box if you want to create a similar task (some fields will be pre-filled).
ru: **Создать другую задачу**: Отметьте этот чекбокс если вы хотите создать похожую задачу (некоторые поля будут заполнены).

source: **Assignee**: The person that will work on the task.
ru: **Назначена**: Пользователь, которому будет назначена для выполнения эта задача.

source: **Category**: Only one category can be assigned to a task.
ru: **Категория**: Только одна категория может быть назначена задаче.

source: **Column**: The column where the task will be created, your task will be positioned at the bottom.
ru: **Колонка**: Колонка в которой задача будет создана, ваша задача будет помещена вниз.

source: **Color**: Choose the color of the card.
ru: **Цвет**: Выберите цвет для карточки.

source: **Complexity**: Used in agile project management (Scrum), the complexity or story points is a number that tells the team how hard the story is. Often, people use the Fibonacci series.
ru: **Сложность**: используется в быстрых управлениях проектами (Scrum); сложность - это число, которое говорит команде проекта насколько тяжело выполнить задачу. Обычно пользователи используют шкалу Фибоначи.

source: **Original Estimate**: Estimation in hours to complete the tasks.
ru: **Запланировано часов**: Планирование времени, которое будет затрачено на выполнение задачи. Измеряется в часах.

source: **Due Date**: Overdue tasks will have a red due date and upcoming due dates will be black on the board. Several date format are accepted in addition to the date picker.
ru: **Сделать до**: Просроченные задачи будут иметь дату завершения красного цвета, а предстоящие задачи будут иметь дату завершения черного цвета.
