Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/creating-projects.po
Languages: ru

source: Creating Projects
ru: Создание проектов

source: Kanboard can handle multiple projects. There are two kinds of projects:
ru: Kanboard может содержать одновременно несколько проектов. Проекты могут быть следующих типов:

source: Team projects
ru: Командный проект

source: Private project for a single user
ru: Приватный проект для одного пользователя

source: Creating projects for multiple users
ru: Создание проекта для нескольких пользователей

source: Only administrators and project administrators can create those projects
ru: Только пользователи с ролью администратор и менеджер могут создавать такие проекты

source: User management is available
ru: Можно добавлять к проекту пользователей и группы

source: From the dashboard, click on the link **New project**:
ru: На рабочей панели нажмите ссылку **Новый проект**:

source: Project creation form
ru: Рисунок. Форма создания проекта.

source: It's very easy, you just have to find a name for your project!
ru: Теперь надо только добавить название для проекта! Легко, не правда ли?

source: Creating a private project
ru: Создание приватного проекта

source: Everybody can create a private project
ru: Любой пользователь Kanboard может создать приватный проект

source: There is **NO** user management
ru: **Нет** возможности добавлять участников к приватному проекту

source: Only the owner and administrators can access to the project
ru: Только владелец приватного проекта и администратор могут получить доступ к проекту

source: From the dashboard, click on the link **New private project**.
ru: На рабочей панели нажмите **Новый проект с ограниченным доступом**.

source: Creating projects from another project
ru: Создание проекта из другого проекта

source: When you create a new project, your can choose to duplicate the properties of another project :
ru: При создании нового проекта у вас есть возможность использовать данные другого (ранее созданного) проекта:

source: Permissions
ru: Разрешения

source: Actions
ru: Действия

source: Swimlanes
ru: Дорожки

source: Catégories
ru: Категории

source: Tasks
ru: Задачи
