Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/create-tasks-by-email.po
Languages: ru

source: Create tasks by email
ru: Создание задач через email

source: You can create tasks directly by sending an email. This feature is available by using plugins.
ru: Вы можете создавать задачи отправляя email (сообщения через электронную почту). Эта возможность доступна при использовании плагинов.

source: At the moment, Kanboard is integrated with 3 external services:
ru: В настоящий момент, Канборд поддерживает три внешних плагина:

source: These services handle incoming emails without having to configure any SMTP server.
ru: Эти плагины позволяют обрабатывать входящие электронные сообщения (email) без дополнительной настройки SMTP сервера.

source: When an email is received, Kanboard receive the message on a specific end-point. All complicated works are already handled by those services.
ru: При получении плагином email сообщения, плагин передает это сообщение в веб транслятор Канборда.

source: Incoming emails workflow
ru: Обработка входящих email сообщений

source: You send an email to a specific address, for example **something+myproject@inbound.mydomain.tld**
ru: Вы отправляете email сообщение на определенный адрес, например **something+myproject@inbound.mydomain.tld**

source: Your email is forwarded to the third-party SMTP servers
ru: Email сообщение перенаправляется на SMTP сервер

source: The SMTP provider call the Kanboard web hook with the email in JSON or multipart/form-data formats
ru: SMTP провайдер передает в веб сервис Канборда email сообщение в JSON формате или в формате multipart/form-data

source: Kanboard parses the received email and create the task to the right project
ru: Канборд обрабатывает полученное email сообщение и создает задачу в указанном проекте

source: Note: New tasks are automatically created in the first column.
ru: **Заметка**: Новые задачи автоматически создаются в первой колонке.

source: Email format
ru: Формат email сообщения

source: The local part of the email address must use the plus separator, for example **kanboard+project123**
ru: Email адрес до знака **@** должен содержать разделитель **плюс**, например **kanboard+project123**

source: The string defined after the plus sign must match a project identifier, for example **project123** is the identifier of the project **Project 123**
ru: Строка следующая после знака плюс означает **Идентификатор проекта**, например, проект **Проект 123** может иметь идентификатор проекта **project123**. Идентификатор проекта можно задать в свойствах проекта **Меню** -> **Настройки** -> **Изменить проект** -> **Идентификатор**. **Идентификатор** должен быть из цифр и латинских букв.

source: The email subject becomes the task title
ru: Тема из email сообщения становится названием задачи

source: The email body becomes the task description (Markdown format)
ru: Текст email сообщения становится описанием задачи (в формате Markdown)

source: Incoming emails can be written in text or HTML formats. **Kanboard is able to convert simple HTML emails to Markdown**.
ru: Email сообщения могут быть написаны в текстовом или HTML формате. **Канборд сам переконвертирует формат сообщения в Markdown**

source: Security and requirements
ru: Безопастность и требования

source: The Kanboard web hook is protected by a random token
ru: Веб транслятор Канборд защищен случайным ключом

source: The sender email address must match a Kanboard user
ru: Email адрес отправителя должен быть такой же как и у пользователя Канборд

source: The Kanboard project must have a unique identifier, for example **MYPROJECT**
ru: Проект в Канборде должен иметь уникальный идентификатор

source: The Kanboard user must be a member of the project
ru: Отправитель email сообщения должен быть участником проекта
