Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/cronjob.po
Languages: ru

source: Background Job Scheduling
ru: Ежедневные фоновые задачи

source: To work properly, Kanboard requires that a background job run on a daily basis. Usually on Unix platforms, this process is done by ``cron``.
ru: Для корректной работы, Канборд должен запускать ежедневные фоновые задачи. На Unix платформах этот процесс выполнятся в ``cron``.

source: This background job is necessary for these features:
ru: Фоновые задачи необходимы для следующих возможностей:

source: Reports and analytics (calculate daily stats of each projects)
ru: Отчеты и аналитика (подсчет ежедневной статистики для каждого проекта)

source: Send overdue task notifications
ru: Рассылка оповещений для просроченных задач

source: Execute automatic actions connected to the event "Daily background job for tasks"
ru: Выполнение автоматических действий подключенных к событиям "Ежедневные фоновые процессы для задач"

source: Configuration on Unix and Linux platforms
ru: Настройка на Unix и Linux платформах

source: There are multiple ways to define a cronjob on Unix/Linux operating systems, this example is for Ubuntu 14.04. The procedure is similar to other systems.
ru: Для создания фоновых задач под операционной системой Unix/Linux используются разные решения. Здесь приведен пример для Ubuntu 14.04. Для других систем процедура похожа.

source: Edit the crontab of your web server user:
ru: Отредактируйте crontab под пользователем вашего веб сервера:

source: Example to execute the daily cronjob at 8am:
ru: Пример запуска ежедневной фоновой задачи в 8 утра:

source: Note: the cronjob process must have write access to the database in case you are using Sqlite. Usually, running the cronjob under the web server user is enough.
ru: Примечание: процес выполнения фоновых задач должен иметь права доступа к вашей базе данных в случае если вы используете Sqlite. Обычно, достаточно запускать фоновую задачу под пользователем веб сервера.
