Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/docker.po
Languages: ru

source: How to run Kanboard with Docker?
ru: Как запустить Канборд с Docker?

source: Kanboard can run easily with `Docker <https://www.docker.com>`__.
ru: Канборд можно легко запустить с `Docker <https://www.docker.com>`__.

source: The image size is approximately **50MB** and contains:
ru: Размер образа, приблизительно, **50MB** содержит:

source: The Kanboard cronjob is also running everyday at midnight. URL rewriting is enabled in the included config file.
ru: Канборд запускает фоновые задачи каждый день в полночь. Переписывание URL (URL rewriting) включено в базовой конфигурации.

source: When the container is running, the memory utilization is around **20MB**.
ru: Когда контейнер запущен, использование памяти около **20MB**.

source: Use the stable version
ru: Использование стабильной версии

source: To fetch the latest stable release of Kanboard use the tag **stable**:
ru: Для получения последней стабильной версии Канборда используйте тег **stable**:

source: Use the development version (automated build)
ru: Использование разрабатываемой версии (автоматической сборки)

source: Every new commit on the repository trigger a new build on the `Docker Hub <https://registry.hub.docker.com/u/kanboard/kanboard/>`__.
ru: Каждый новый коммит в репозитории вызывает новую сборку в `Docker Hub <https://registry.hub.docker.com/u/kanboard/kanboard/>`__.

source: The tag **latest** is the **development version** of Kanboard, use at your own risk.
ru: Используя **разрабатываемую версию** Канборда с тегом **latest**, вы принимаете на себя все риски нестабильной версии.

source: Build your own Docker image
ru: Создание своего образа Docker

source: There is a ``Dockerfile`` in the Kanboard repository to build your own image. Clone the Kanboard repository and run the following command:
ru: Для сборки своего образа, в репозитории Канборда имеется ``Dockerfile``. Склонируйте репозиторий Канборда и выполните следующую команду:

source: or
ru: или

source: To run your container in background on the port 80:
ru: Для запуска вашего контейнера в фоновом режиме на порту 80:

source: Volumes
ru: Тома

source: You can attach 2 volumes to your container:
ru: Вы можете прикрепить 2 тома к вашему контейнеру:

source: Data folder: ``/var/www/kanboard/data``
ru: Каталог с данными: ``/var/www/kanboard/data``

source: Plugins folder: ``/var/www/kanboard/plugins``
ru: Католог с плагинами: ``/var/www/kanboard/plugins``

source: Use the flag ``-v`` to mount a volume on the host machine like described in `official Docker documentation <https://docs.docker.com/engine/userguide/containers/dockervolumes/>`__.
ru: Используйте опцию ``-v`` для монтирования тома на удаленной машине как описано в `официальной документации Docker <https://docs.docker.com/engine/userguide/containers/dockervolumes/>`__.

source: Upgrade your container
ru: Обновление вашего контейнера

source: Pull the new image
ru: Загрузите новый образ

source: Remove the old container
ru: Удалите старый контейнер

source: Restart a new container with the same volumes
ru: Перезапустите новый контейнер с теми же томами

source: Environment variables
ru: Переменные окружения

source: The list of environment variables is available on `this page <env.markdown>`__.
ru: Список переменных окружения доступен на `этой странице <env.html>`__.

source: Config files
ru: Файлы конфигурации

source: The container already include a custom config file located at ``/var/www/kanboard/config.php``.
ru: Контейнер уже содержит конфигурационный файл расположенный в ``/var/www/kanboard/config.php``.

source: You can store your own config file on the data volume: ``/var/www/kanboard/data/config.php``.
ru: Вы можете сохранить свой конфиг файл в томе с данными: ``/var/www/kanboard/data/config.php``.

source: References
ru: Ссылки

source: `Official Kanboard images <https://registry.hub.docker.com/u/kanboard/kanboard/>`__
ru: `Официальные образы Канборд <https://registry.hub.docker.com/u/kanboard/kanboard/>`__

source: `Docker documentation <https://docs.docker.com/>`__
ru: `Документация Docker <https://docs.docker.com/>`__

source: `Dockerfile stable version <https://github.com/kanboard/docker>`__
ru: `Стабильная версия Dockerfile <https://github.com/kanboard/docker>`__

source: `Dockerfile dev version <https://github.com/fguillot/kanboard/blob/master/Dockerfile>`__
ru: `Разрабатываемая версия Dockerfile <https://github.com/fguillot/kanboard/blob/master/Dockerfile>`__
