Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/duplicate-move-tasks.po
Languages: ru

source: Duplicate and move tasks
ru: Дублирование и перенос задач

source: Duplicate a task into the same project
ru: Создание копии задачи в том же проекте

source: Go to the task view and choose **Duplicate** on the left.
ru: Перейдите в детальное представление задачи и выберите в боковой панели (слева) **Клонировать**.

source: Task Duplication
ru: Рисунок. Создание копии задачи.

source: A new task will be created with the same properties as the original.
ru: Новая задача будет создана с теми же свойствами как и у оригинальной задачи.

source: Duplicate a task to another project
ru: Создание копии задачи в другой проект

source: Go to the task view and choose **Duplicate to another project**.
ru: Перейдите в детальное представление задачи и выберите в боковом меню (слева) **Клонировать в другой проект**.

source: Task Duplication Another Project
ru: Рисунок. Создание копии задачи в другой проект.

source: Only projects where you are members will be shown in the drop-down.
ru: При выборе проекта в выпадающем списке, показываются только те проекты в которых вы являетесь участниками.

source: Before to copy the tasks, Kanboard will ask you the destination properties that are not common between the source and destination project.
ru: Перед тем как скопировать задачу, Канборд просит вас указать свойства проекта (куда будет копироваться), потому что проекты могуг иметь разные столбцы, дорожки и т.д.

source: Basically, you need to define:
ru: Вам нужно указать:

source: The destination swim lane
ru: Дорожку, в которую скопируется задача

source: The column
ru: Колонку

source: The category
ru: Категорию

source: The assignee
ru: Испольнителя

source: Move a task to another project
ru: Перемещение задачи в другой проект

source: Go to the task view and choose **Move to another project**.
ru: Перейдите в детальное представление задачи и выберите в боковом меню **Переместить в другой проект**

source: Moving a task to another project work in the same way as the duplication, you have to choose the new properties of the task.
ru: Процедура перемещения задачи в другой проект такая же как и при копировании, вы должны указать новые свойства для задачи.

source: List of fields duplicated
ru: Список копируемых полей

source: Here are the list of properties duplicated:
ru: Ниже приведен список полей (свойств), которые будут скопированы:

source: title
ru: заголовок

source: description
ru: описание

source: date\_due
ru: дата\_исполнение

source: color\_id
ru: цвет\_id

source: project\_id
ru: проект\_id

source: column\_id
ru: колонка\_id

source: owner\_id
ru: владелец\_id

source: score
ru: оценка

source: category\_id
ru: категория\_id

source: time\_estimated
ru: время\_запланировано

source: swimlane\_id
ru: дорожка\_id

source: recurrence\_status
ru: повторение\_статус

source: recurrence\_trigger
ru: повторение\_триггер

source: recurrence\_factor
ru: повторение\_фактор

source: recurrence\_timeframe
ru: повторение\_timeframe

source: recurrence\_basedate
ru: повторение\_basedate
