Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/email-configuration.po
Languages: ru

source: Email configuration
ru: Настройка email

source: User settings
ru: Настройки пользователя

source: To receive email notifications, users of Kanboard must have:
ru: Для получение уведомлений на email, пользователи Канборда должны иметь:

source: Activated notifications in their profile
ru: Включенные уведомления, должны быть включены в профиле пользователя

source: Have a valid email address in their profile
ru: Должен быть прописан правильный email адрес в профиле пользователя

source: Be a member of the project that will trigger notifications
ru: Быть участником проекта, который отсылает уведомления

source: Note: The logged user who performs the action doesn't receive any notifications, only other project members.
ru: Примечание: Пользователь, выполнивший вход в Канборд и выполняющий действие, не будет получать уведомления. Уведомления будут получать только другие участники проекта.

source: Email transports
ru: Email шлюзы

source: There are several email transports available:
ru: В Канборд доступны несколько шлюзов для email:

source: PHP native mail function
ru: Встроенная mail функция PHP

source: Other methods can be provided by external plugins: Postmark, Sendgrid and Mailgun
ru: Другие методы могут предоставить внешние плагины: Postmark, Sendgrid and Mailgun

source: Server settings
ru: Настройки сервера

source: By default, Kanboard will use the bundled PHP mail function to send emails. Usually that requires no configuration if your server can already send emails.
ru: По умолчанию, Канборд использует встроенную в PHP функцию для передачи email сообщений. Обычно не требуется дополнительных настроек, если ваш сервер уже может отправлять email сообщения.

source: However, it's possible to use other methods, the SMTP protocol and Sendmail.
ru: Если вы захотите использовать другие методы: SMTP протокол и Sendmail, то ниже приведены инструкции по настройке.

source: SMTP configuration
ru: Настройка SMTP

source: Rename the file ``config.default.php`` to ``config.php`` and change these values:
ru: Переименуйте файл ``config.default.php`` в ``config.php`` и измените следующие значения:

source: It's also possible to use a secure connection, TLS or SSL:
ru: Возможно понадобится использовать шифрованное подключение TLS или SSL:

source: Sendmail configuration
ru: Настройка Sendmail

source: By default the sendmail command will be ``/usr/sbin/sendmail -bs`` but you can customize that in your config file.
ru: По умолчанию команда отправки сообщений выглядит так ``/usr/sbin/sendmail -bs``, но вы можете изменить ее в файле конфигурации.

source: Example:
ru: Например:

source: This is the default configuration:
ru: Это конфигурация по умолчанию:

source: The sender email address
ru: Email адрес отправителя

source: By default, emails will use the sender address ``notifications@kanboard.local``. It's not possible to reply to this address.
ru: По умолчанию, сообщения отправляются с адресом отправителя ``notifications@kanboard.local``. На этот адрес нельзя ответить.

source: You can customize this address by changing the value of the constant ``MAIL_FROM`` in your config file.
ru: Вы можете настроить этот адрес изменив значение константы ``MAIL_FROM`` в вашем конфигурационном файле.

source: That can be useful if your SMTP server configuration doesn't accept the default address.
ru: Это может быть полезным, если ваш SMTP сервер не принимает неправильные адреса.

source: How to display a link to the task in notifications?
ru: Как отобразить ссылку на задачу в уведомлении?

source: To do that, you have to specify the URL of your Kanboard installation in your `Application Settings <https://kanboard.net/documentation/application-configuration>`__. By default, nothing is defined, so no links will be displayed.
ru: Чтобы сделать это, вы должны указать URL вашего установленного Канборда в `Настройках приложения <application-configuration.html>`__.

source: Examples:
ru: Например:

source: http://demo.kanboard.net/
ru: http://demo.kanboard.ru/

source: http://myserver/kanboard/
ru: http://имясервера/kanboard/

source: Don't forget the ending slash ``/``.
ru: Не забудьте добавить в конце слеш ``/``.

source: You need to define that manually because Kanboard cannot guess the URL from a command line script and some people have a very specific configuration.
ru: Вы должны сделать это вручную, потому что Канборд не может угадать URL из скрипта командной строки и некоторые конфигурации веб серверов очень специфичны.

source: Troubleshooting
ru: Решение проблем

source: If no emails are sent and you are sure that everything is configured correctly:
ru: Если email сообщения не отправляются и вы уверены, что все настроили правильно:

source: Check your spam folder
ru: Проверьте папку Спам

source: Enable the debug mode and check the debug file ``data/debug.log``, you should see the exact error
ru: Включите режим отладки и посмотрите отладочный файл ``data/debug.log``, вы можете увидеть конкретную ошибку

source: Be sure that your server or your hosting provider allows you to send emails
ru: Убедитесь, что ваш сервер или ваш хостинг провайдер позволяет вам отсылать email сообщения

source: If you use SeLinux, allow PHP to send emails
ru: Если вы используете SeLinux, разрешите PHP отсылать email сообщения.
