Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/ext-search.po
Languages: ru

source: Advanced Search Syntax
ru: Синтаксис расширенного поиска

source: Kanboard uses a simple query language for advanced search. You can search in tasks, comments, subtasks, links but also in the activity stream.
ru: В Канборде используется простой язык запросов для расширенного поиска. Вы можете искать задачи, комментарии, подзадачи, ссылки, но только активные.

source: Example of query
ru: Пример запроса

source: This example will return all tasks assigned to me with a due date for tomorrow and a title that contains "my title":
ru: В этом примере показываются как отобразить задачи назначенные мне с датой окончания завтра и название содержит "my title":

source: Global search
ru: Глобальный поиск

source: Search by task id or title
ru: Поиск по id задачи или названию задачи

source: Search by task id: ``#123``
ru: Поиск задачи по id: ``#123``

source: Search by task id and task title: ``123``
ru: Поиск по id задачи и названию задачи: ``123``

source: Search by task title: anything that doesn't match any search attributes
ru: Поиск по названию задачи: ``любые слова и цифры``, но не должны содержать атрибуты поиска

source: Search by status
ru: Поиск по статусу

source: Attribute: **status**
ru: Атрибут: **status**

source: Query to find open tasks: ``status:open``
ru: Запрос на поиск открытых задач: ``status:open``

source: Query to find closed tasks: ``status:closed``
ru: Запрос на поиск закрытых задач: ``status:closed``

source: Search by assignee
ru: Поиск по испольнителю

source: Attribute: **assignee**
ru: Атрибут: **assignee**

source: Query with the full name: ``assignee:"Frederic Guillot"``
ru: Поиск по полному имени испольнителя: ``assignee:"Петр Иванов"``

source: Query with the username: ``assignee:fguillot``
ru: Поиск исполнителя по имени пользователя: ``assignee:pivanov``

source: Multiple assignee lookup: ``assignee:user1 assignee:"John Doe"``
ru: Отбор нескольких испольнителей: ``assignee:tsemenov assignee:"Петр Иванов"``

source: Query for unassigned tasks: ``assignee:nobody``
ru: Поиск задач без исполнителя: ``assignee:nobody``

source: Query for my assigned tasks: ``assignee:me``
ru: Поиск задач назначенных мне: ``assignee:me``

source: Search by task creator
ru: Поиск по создателю задач

source: Attribute: **creator**
ru: Атрибут: **creator**

source: Tasks created by myself: ``creator:me``
ru: Отбор задач созданных мной: ``creator:me``

source: Tasks created by John Doe: ``creator:"John Doe"``
ru: Отбор задач которые создал Петр Иванов: ``creator:"Петр Иванов"``

source: Tasks created by the user id #1: ``creator:1``
ru: Отбор задач созданных пользователем с id #1: ``creator:1``

source: Search by subtask assignee
ru: Поиск по исполнителю подзадач

source: Attribute: **subtask:assignee**
ru: Атрибут: **subtask:assignee**

source: Example: ``subtask:assignee:"John Doe"``
ru: Например: ``subtask:assignee:"Петр Иванов"``

source: Search by color
ru: Поиск по цвету

source: Attribute: **color**
ru: Атрибут: **color**

source: Query to search by color id: ``color:blue``
ru: Отбор по цвету с id blue: ``color:blue``

source: Query to search by color name: ``color:"Deep Orange"``
ru: Отбор по названию цвета: ``color:"Deep Orange"``

source: Search by the due date
ru: Отбор по "Сделать до"

source: Attribute: **due**
ru: Атрибут: **due**

source: Search tasks due today: ``due:today``
ru: Поиск задач со сроком испольнения до сегодня: ``due:today``

source: Search tasks due tomorrow: ``due:tomorrow``
ru: Поиск задач со сроком исполнения завтра: ``due:tomorrow``

source: Search tasks due yesterday: ``due:yesterday``
ru: Поиск задач со сроком исполнения вчера: ``due:yesterday``

source: Search tasks due with the exact date: ``due:2015-06-29``
ru: Поиск задач с конкретной датой исполнения: ``due:2016-06-29``

source: The date must use the ISO 8601 format: **YYYY-MM-DD**.
ru: Дата должна быть в формате ISO 8601: **YYYY-MM-DD**.

source: All string formats supported by the ``strtotime()`` function are supported, for example ``next Thursday``, ``-2 days``, ``+2 months``, ``tomorrow``, etc.
ru: Все строковые форматы поддерживаемые функцией ``strtotime()`` допустимы. Например, ``next Thursday``, ``-2 days``, ``+2 months``, ``tomorrow`` и т.д.

source: Operators supported with a date:
ru: Операторы сравнения с датой:

source: Greater than: **due:>2015-06-29**
ru: Старше чем: **due:>2015-06-29**

source: Lower than: **due:<2015-06-29**
ru: Моложе чем: **due:<2015-06-29**

source: Greater than or equal: **due:>=2015-06-29**
ru: Старше чем или равно: **due:>=2015-06-29**

source: Lower than or equal: **due:<=2015-06-29**
ru: Моложе чем или равно: **due:<=2015-06-29**

source: Search by modification date
ru: Поиск по дате изменения

source: Attribute: **modified** or **updated**
ru: Атрибут: **modified** или **updated**

source: The date formats are the same as the due date.
ru: Формат даты такой же как и у "Сделать до"

source: There is also a filter by recently modified tasks: ``modified:recently``.
ru: Отфильтровать недавно измененные задачи: ``modified:recently``.

source: This query will use the same value as the board highlight period configured in settings.
ru: Этот запрос использует тоже значение что и в настройках Доски - "Время подсвечивания задачи".

source: Search by creation date
ru: Поиск по дате создания

source: Attribute: **created**
ru: Атрибут: **created**

source: Works in the same way as the modification date queries.
ru: Работает также как и поиск по дате изменения.

source: Search by description
ru: Поиск по описанию

source: Attribute: **description** or **desc**
ru: Атрибут: **description** or **desc**

source: Example: ``description:"text search"``
ru: Например: ``description:"здесь пишем тескт для поиска"``

source: Search by external reference
ru: Поиск по внешним ссылкам

source: The task reference is an external id of your task, by example a ticket number from another software.
ru: Например: нужно найти задачу, которая содержит ссылку на id или название другой задачи.

source: Find tasks with a reference: ``ref:1234`` or ``reference:TICKET-1234``
ru: ``ref:1234`` или ``reference:TICKET-1234``

source: Search by category
ru: Поиск по категории

source: Attribute: **category**
ru: Атрибут: **category**

source: Find tasks with a specific category: ``category:"Feature Request"``
ru: Найти задачи с указанной категорией: ``category:"Важные запросы"``

source: Find all tasks that have those categories: ``category:"Bug" category:"Improvements"``
ru: Найти задачи, которые содержать указанные категории: ``category:"Ошибки" category:"Изменения"``

source: Find tasks with no category assigned: ``category:none``
ru: Найти задачи без категорий: ``category:none``

source: Search by project
ru: Поиск проектов

source: Attribute: **project**
ru: Атрибут: **project**

source: Find tasks by project name: ``project:"My project name"``
ru: Поиск задач по имени проекта: ``project:"Какой-то проект"``

source: Find tasks by project id: ``project:23``
ru: Поиск задач по id проекта: ``project:23``

source: Find tasks for several projects: ``project:"My project A" project:"My project B"``
ru: Поиск задач в нескольких проектах: ``project:"Проект A" project:"Проект B"``

source: Search by columns
ru: Поиск в колонках

source: Attribute: **column**
ru: Атрибут: **column**

source: Find tasks by column name: ``column:"Work in progress"``
ru: Поиск задач в указанной колонке: ``column:"В работе"``

source: Find tasks for several columns: ``column:"Backlog" column:ready``
ru: Поиск задач в нескольких колонках: ``column:"Невыполненные заказы" column:ready``

source: Search by swim-lane
ru: Поиск в Дорожках

source: Attribute: **swimlane**
ru: Атрибут: **swimlane**

source: Find tasks by swim-lane: ``swimlane:"Version 42"``
ru: Поиск задач в указанной Дорожке: ``swimlane:"Версия 42"``

source: Find tasks in the default swim-lane: ``swimlane:default``
ru: Поиск задач в базовой Дорожке: ``swimlane:default``

source: Find tasks into several swim-lanes: ``swimlane:"Version 1.2" swimlane:"Version 1.3"``
ru: Поиск задач в нескольких Дорожках: ``swimlane:"Версия 1.2" swimlane:"Версия 1.3"``

source: Search by task link
ru: Поиск ссылки на задачу

source: Attribute: **link**
ru: Атрибут: **link**

source: Find tasks by link name: ``link:"is a milestone of"``
ru: Поиск задач содержащих ссылку: ``link:"это веха задачи "``

source: Find tasks into several links: ``link:"is a milestone of" link:"relates to"``
ru: Поиск задач по нескольким ссылкам: ``link:"веха задачи " link:"относится к"``

source: Search by comment
ru: Поиск по комментарию

source: Attribute: **comment**
ru: Атрибут: **comment**

source: Find comments that contains this title: ``comment:"My comment message"``
ru: Найти комментарии, которые содержат указанное название: ``comment:"Какое-то название"``

source: Activity stream search
ru: Поиск активности задач

source: Search events by task title
ru: Поиск событий по названию задачи

source: Attribute: **title** or none (default)
ru: Атрибут: **title** или без ничего (по умолчанию)

source: Example: ``title:"My task"``
ru: Например: ``title:"My task"``

source: Search events by task status
ru: Поиск событий по статусу задачи

source: Search by event creator
ru: Поиск событий по создателю

source: Search by event creation date
ru: Поиск событий по дате создания

source: Search events by project
ru: Поиск событий по проекту
