Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: Frequently Asked Questions
ru: Часто задаваемые вопросы

source: Can you recommend a web hosting provider for Kanboard?
ru: Вы можете порекомендовать веб хостинг провайдера для Канборд?

source: Kanboard works well with any great VPS hosting provider such as `Digital Ocean <https://www.digitalocean.com/?refcode=4b541f47aae4>`__, `Linode <https://www.linode.com/?r=4e381ac8a61116f40c60dc7438acc719610d8b11>`__ or `Gandi <https://www.gandi.net/>`__.
ru: Работу Канборд поддерживают несколько крупных провайдеров VPS, такие как `Digital Ocean <https://www.digitalocean.com/?refcode=4b541f47aae4>`__, `Linode <https://www.linode.com/?r=4e381ac8a61116f40c60dc7438acc719610d8b11>`__ или `Gandi <https://www.gandi.net/>`__.

source: To have the best performances, choose a provider with fast disk I/O because Kanboard use Sqlite by default. Avoid hosting providers that use a shared NFS mount point.
ru: Для получения большей производительности, выбирайте провайдера с быстрыми дисками чтения/записи, потому что Канборд использует по умолчанию Sqlite. Избегайте провайдеров которые используют подключения NFS.

source: I get a blank page after installing or upgrading Kanboard
ru: У меня выводится пустая страница после установки или обновления Канборд

source: Check if you have installed all requirements on your server
ru: Проверьте, установили ли вы всё на сервер, что было указано в требованиях

source: Check the PHP and Apache error logs
ru: Посмотрите ошибки в PHP и Apache логах

source: Check if the files have the correct permission
ru: Проверьте права доступа к файлам

source: If you use an aggressive OPcode caching, reload your web-server or php-fpm
ru: Если вы используете кеширование OPcode, перезапустите ваш веб сервер или php-fpm

source: I have the error "There is no suitable CSPRNG installed on your system"
ru: У меня выводится ошибка "There is no suitable CSPRNG installed on your system"

source: If you use PHP < 7.0, you need to have the openssl extension enabled or ``/dev/urandom`` accessible from the application if restricted by an ``open_basedir`` restriction.
ru: Если вы используете PHP < 7.0, то вам нужно включить расширение openssl или доступ из приложения к ``/dev/urandom``, если имеются ограничения от ``open_basedir``.

source: Page not found and the URL seems wrong (&amp;)
ru: Страница не найдена и URL выглядит криво (&amp;)

source: The URL looks like ``/?controller=auth&amp;action=login&amp;redirect_query=`` instead of ``?controller=auth&action=login&redirect_query=``
ru: UTL выглядит как ``/?controller=auth&amp;action=login&amp;redirect_query=`` вместо ``?controller=auth&action=login&redirect_query=``

source: Kanboard returns a "Page not found" error
ru: Канборд выдает ошибку "Страница не найдена"

source: This issue comes from your PHP configuration, the value of ``arg_separator.output`` is not the PHP's default, there is different ways to fix that:
ru: Эта ошибка исходит из настроек конфигурации вашего PHP, значение ``arg_separator.output`` отсутствует в базовой настройке. Есть разные пути решения этой проблемы:

source: Change the value directly in your ``php.ini`` if you can:
ru: Измените значение прямо в вашем ``php.ini``:

source: Override the value with a ``.htaccess``:
ru: Переделайте значение с помощью ``.htaccess``:

source: Otherwise Kanboard will try to override the value directly in PHP.
ru: Иначе Канборд будет брать значение напрямую из PHP.

source: Authentication failure with the API and Apache + PHP-FPM
ru: Ошибка аутентификации в API и Apache + PHP-FPM

source: php-cgi under Apache does not pass HTTP Basic user/pass to PHP by default. For this workaround to work, add these lines to your ``.htaccess`` file:
ru: По умолчанию, php-cgi под Apache не передает HTTP Basic user/pass в PHP. Чтобы это окружение заработало, добавьте эти строки в ваш файл ``.htaccess``:

source: Known issues with eAccelerator
ru: Проблемы с eAccelerator

source: Kanboard doesn't work very well with `eAccelerator <http://eaccelerator.net>`__. The issue caused can be a blank page or an Apache crash:
ru: Канборд не очень хорошо работает с `eAccelerator <http://eaccelerator.net>`__. Проблема в том, что выдается чистая страница или падает Apache:

source: The best way to avoid this issue is to disable eAccelerator or define manually which files you want to cache with the config parameter ``eaccelerator.filter``.
ru: Лучшее решение, чтобы избежать этой проблемы, выключить eAccelerator или прописать в конфиге какие файлы вы хотите кешировать (параметр ``eaccelerator.filter``).

source: The project `eAccelerator seems dead and not updated since 2012 <https://github.com/eaccelerator/eaccelerator/commits/master>`__. We recommend to switch to the last version of PHP because it's bundled with `OPcache <http://php.net/manual/en/intro.opcache.php>`__.
ru: Проект `eAccelerator выглядит мертвым и не обновляется с 2012 <https://github.com/eaccelerator/eaccelerator/commits/master>`__. Мы рекомендуем перейти на последнюю версию PHP, потому что в него включен `OPcache <http://php.net/manual/en/intro.opcache.php>`__.

source: Why the minimum requirement is PHP 5.3.3?
ru: Почему минимальная рекомендуемая версия PHP 5.3.3?

source: Kanboard uses the function ``password_hash()`` to crypt passwords but it's available only for PHP >= 5.5.
ru: Канборд использует функцию ``password_hash()`` для шифрования пароля, а эта функция доступна только для PHP >= 5.5.

source: However, there is a back-port for `older versions of PHP <https://github.com/ircmaxell/password_compat#requirements>`__. This library requires at least PHP 5.3.7 to work correctly.
ru: Однако, имеется back-port для `более ранних версий PHP <https://github.com/ircmaxell/password_compat#requirements>`__. Эта библиотека требует минимум PHP 5.3.7 для корректной работы.

source: Apparently, Centos and Debian back-ports security patches so PHP 5.3.3 should be ok.
ru: По всей видимости, патчи безопасности back-port имеются в Centos и Debian, поэтому PHP 5.3.3 подходит для работы Канборд.

source: Kanboard v1.0.10 and v1.0.11 requires at least PHP 5.3.7 but this change has been reverted to be compatible with PHP 5.3.3 with Kanboard >= v1.0.12
ru: Канборд v1.0.10 и v1.0.11 требует минимум PHP 5.3.7, но эти изменения возвращены на PHP 5.3.3 в Канборде >= v1.0.12

source: How to test Kanboard with the PHP built-in web server?
ru: Как проверить работу Канборда со встроенным веб-сервером PHP?

source: If you don't want to install a web server like Apache on localhost. You can test with the `embedded web server of PHP <http://www.php.net/manual/en/features.commandline.webserver.php>`__:
ru: Если вы не хотите устанавливать веб сервер типа Apache, то вы можете протестировать работу Канборда на `встроенном в PHP веб сервере <http://www.php.net/manual/en/features.commandline.webserver.php>`__:

source: How to install Kanboard on Yunohost?
ru: Как установить Канборд на Yunohost?

source: `YunoHost <https://yunohost.org/>`__ is a server operating system aiming to make self-hosting accessible to everyone.
ru: `YunoHost <https://yunohost.org/>`__ это серверная операционная система, цель которой предоставить хостинг для всех.

source: There is a `package to install Kanboard on Yunohost easily <https://github.com/mbugeia/kanboard_ynh>`__.
ru: Отсюда можно `загрузить инсталяционный пакет Kanboard для Yunohost <https://github.com/mbugeia/kanboard_ynh>`__.

source: Where can I find a list of related projects?
ru: Где я могу найти список связанных с Канборд проектов?

source: Are there some tutorials about Kanboard in other languages?
ru: Имеются ли руководства по Канборду на других языках?

source: `German article series about Kanboard <http://demaya.de/wp/2014/07/kanboard-eine-jira-alternative-im-detail-installation/>`__
ru: `Серия статей про Kanboard на немецком языке <http://demaya.de/wp/2014/07/kanboard-eine-jira-alternative-im-detail-installation/>`__ . `Русская документация по Канборд <http://kanboard.ru/doc/>`__.
