Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/freebsd-installation.po
Languages: ru

source: FreeBSD 10 Installation
ru: Инсталяция на FreeBSD 10

source: Install from packages
ru: Инсталяция из пакетов

source: Enable Apache in your ``/etc/rc.conf``:
ru: Включите Apache в ``/etc/rc.conf``:

source: Set up PHP for Apache:
ru: Установите PHP для Apache:

source: Then start Apache:
ru: Затем, запустите Apache:

source: Add symlink to Kanboard folder into your Apache docroot:
ru: Создайте символическую ссылку на каталог Kanboard в корне Apache:

source: Go to http://your.server.domain.tld/kanboard and enjoy!
ru: Готово. Можете перейти в http://вашвебсервер/kanboard и начинать работать!

source: *Notes*: - If you want to use additional features like LDAP integration etc. please install proper PHP module using pkg. - You may have to adjust the permissions of the folder data
ru: *Примечание*: Если вы хотите добавить дополнительные возможности, типа интеграции LDAP, то нужно установить соответствующий PHP модуль. Также, вам необходимо настроить соответсвующие права на каталог data.

source: Installing from ports
ru: Установка из портов

source: Generally 3 elements have to be installed:
ru: Нужно установить 3 основных элемента:

source: Fetch and extract ports...
ru: Загрузите и распакуйте порты:

source: or update already existing:
ru: или обновите имеющиеся:

source: More details regarding portsnap can be found in the `FreeBSD Handbook <https://www.freebsd.org/doc/handbook/ports-using.html>`__.
ru: Дополнительную информацию о дереве портов вы можете посмотреть на `FreeBSD Handbook <https://www.freebsd.org/doc/handbook/ports-using.html>`__.

source: Install Apache:
ru: Установка Apache:

source: Install mod\_php for Apache:
ru: Установите mod\_php для Apache:

source: Install Kanboard form ports:
ru: Установите Kanboard из портов:

source: *Note*: If you want to use additional features like LDAP integration etc. please install proper PHP module from ``lang/php5-extensions``.
ru: *Примечание*: Если вы хотите использовать дополнительные возможности, типа интеграции LDAP, то нужно установить PHP модуль из ``lang/php5-extensions``.

source: Manual installation
ru: Установка из архива

source: As of version 1.0.16 Kanboard can be found in FreeBSD ports there is no need to install it manually.
ru: Начина с версии 1.0.16 Kanboard имеется в портах FreeBSD, поэтому нет необходимости устанавливать вручную.

source: Please note
ru: Обратите внимание

source: Port is being hosted on `bitbucket <https://bitbucket.org/if0/freebsd-kanboard/>`__. Feel free to comment, fork and suggest updates!
ru: Порт расположен на хостинге `bitbucket <https://bitbucket.org/if0/freebsd-kanboard/>`__. Делайте комментарии, ответвления и предлагайте обновления!

source: Some features of Kanboard require that you run `a daily background job <cronjob.markdown>`__.
ru: Некоторые возможности Канборд требуют `запуск ежедневных фоновых задач <cronjob.html>`__.
