Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/gantt-chart-projects.po
Languages: ru

source: Gantt Chart for all projects
ru: Диаграмма Ганта для всех проектов

source: The goal of this Gantt chart is to display an overview of all projects based on the start and end dates.
ru: Цель диаграммы Ганта для проектов - показать прогресс проектов основанный на дате начала и дате завершения.

source: This Gantt chart is available in the project management section
ru: Диаграмма Ганта для проектов доступна из раздела **Управление проектами**

source: Only project administrators and administrators can access this section
ru: Только менеджеры проекта и администраторы имеют доступ в этот раздел

source: Project administrators will see only projects where they are members
ru: Менеджеры проекта могут видеть только те проекты, в которых они являются участниками

source: Private projects are not shown on this chart
ru: Приватные проекты не показывают этот график

source: The **start date** and the **end date** of projects are used to draw the chart
ru: **Дата начала** и **дата завершения** проекта используются для рисования графика

source: Horizontal bars can be resized and moved horizontally with your mouse
ru: Горизонтальные полосы (столбики) могут быть расширены (сжаты) и перемещены горизонтально с помощью мыши

source: There is no vertical drag and drop
ru: Перемещение по вертикали невозможно

source: Project bars are displayed in black when there is no start or end date defined
ru: Полосы (столбики) проекта отображаются черным, когда проект не имеет дату начала и завершения

source: The information tooltip shows the list of project managers and standard members
ru: Информационная подсказка показывает список менеджеров и участников проекта
