Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/gantt-chart-tasks.po
Languages: ru

source: Gantt chart for tasks
ru: Диаграмма Ганта для задач

source: The goal of this Gantt chart is to display a time based overview of the tasks for a given project.
ru: Цель диаграммы Ганта - показать время отведенное на задачу в заданном проекте.

source: The Gantt chart is available from the "view switcher"
ru: Диаграмма Ганта доступна в рабочем окружении проекта

source: Only project managers can access this section
ru: Только менеджеры проектов могут иметь доступ в этот раздел

source: Gantt Chart
ru: Рисунок. Диаграмма Ганта.

source: The **start date** and the **due date** of tasks are used to draw the chart
ru: Дата начала и дата завершения задач используется для рисования диаграммы

source: Tasks can be resized and moved horizontally with your mouse
ru: Задача может быть расширена и перемещена горизонтально с помощью мыши

source: There is no vertical drag and drop
ru: Перемещение по вертикали невозможно

source: The bar is the same color as the task
ru: Полоса (горизонтальный столбик) на диаграмме имеет такой же цвет как и задача

source: Each bar display a progression status in percentage, this percentage is calculated by using the column position on the board
ru: Каждая полоса отображает статус прогресса в процентах. Проценты подсчитываются с учетом позиции задачи в колонке на Доске.

source: To fit with the Kanban model, tasks can be ordered by the board positions or by the start date
ru: Для соответсвия модели Kanban, задачи могут быть отсортированы в соответствии с позициями на доске или по дате начала

source: New tasks created from this view will be displayed on the board at the position 1 in the first column
ru: Новые задачи созданные через диаграмму Ганта будут показаны на Доске в первой колонке на первой позиции

source: Tasks are displayed in black when there is no start or due date defined
ru: Задачи отображаются черным цветом, если не указана дата начала или дата исполнения

source: Task not defined
ru: Рисунок. Задача без указанных дат начала или завершения
