Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/ical.po
Languages: ru

source: Syncing your calendars
ru: Синхронизация вашего календаря

source: Kanboard supports iCal feeds for projects and users. This feature allows you to import Kanboard tasks in almost any calendar program (by example Microsoft Outlook, Apple Calendar, Mozilla Thunderbird and Google Calendar).
ru: Канборд поддерживает iCal транслятор для проектов и пользователей. Эта возможность позволяет вам импортировать задачи из Канборд в любую программу календарь (например, Microsoft Outlook, Apple Calendar, Mozilla Thunderbird и Google Calendar).

source: Calendar subscriptions are **read-only** access, you cannot create tasks from external calendar software. The Calendar feed export follows the iCal standard.
ru: Подписки на календарь возможны только на **чтение**, т.е. вы не можете создавать задачи во внешнем календаре. Данные из Календаря экспортируются в стандарте iCal.

source: Note: Only tasks within the date range of -2 months to +6 months are exported to the iCalendar feed.
ru: Заметка: Только задачи в промежутке от -2 месяцев до +6 месяцев (прошедшие два месяца и предстоящие 6 месяцев) экспортируются в iCalendar транслятор.

source: Project calendars
ru: Календарь проекта

source: Each project has its own calendar.
ru: Каждый проект имеет свой календарь.

source: The subscription link is unique per project, the link is activated when you enable the public access of your project: **Project settings > Public access**.
ru: Ссылка на подписку уникальна для каждого проекта. Ссылка становится активной, когда вы включаете общий доступ к вашему проекту: **Меню** -> **Настройки** -> **Общий доступ**

source: This calendar shows only tasks for the selected project.
ru: Этот календарь показывает только задачи для выбранного проекта.

source: User calendars
ru: Календарь пользователя

source: Each user has its own calendar.
ru: Каждый пользователь имеет свой собственный календарь.

source: The subscription link is unique per user, the link is activated when you enable the public access of your user: **User profile > Public access**.
ru: Ссылка на подписку уникальная для каждого пользователя. Ссылка становится активной, когда вы включите общий доступ для пользователя: в правом верхнем выпадающем меню - **Мой профиль** -> в левом меню - **Общий доступ**.

source: This calendar show tasks assigned to the user for all projects.
ru: Этот календарь показывает задачи назначенные пользователю во всех проектах.

source: Adding your Kanboard calendar to Apple Calendar
ru: Добавление Канборд календаря в календарь Apple

source: Open Calendar
ru: Откройте календарь

source: Select **File > New Calendar Subscription**
ru: Выберите **Файл** -> **Новая подписка на календарь**

source: Copy and paste the iCal feed URL from Kanboard
ru: Скопируйте в Канборд URL ссылку на iCal транслятор и вставьте

source: Add iCal subscription
ru: Рисунок. Добавление подписки на календарь.

source: You can choose to synchronize the calendar with iCloud to be available across all your devices
ru: Вы можете выбрать синхронизацию календаря с iCloud, чтобы иметь доступ к календарю с любых ваших устройств

source: Don't forget to select the refresh frequency
ru: Не забудьте указать частоту синхронизации

source: Edit iCal subscription
ru: Рисунок. Редактирование подписки на календарь.

source: Adding your Kanboard calendar to Microsoft Outlook
ru: Добавление вашего календаря из Канборд в Microsoft Outlook

source: Outlook Add Internet Calendar
ru: Рисунок. Добавление в Outlook календаря из интернет

source: Open Outlook
ru: Откройте Outlook

source: Select **Open Calendar > From Internet**
ru: Выберите **Открыть календарь** -> **Из интернета**

source: Outlook Edit Internet Calendar
ru: Рисунок. Настройка интернет календаря в Outlook.

source: Adding your Kanboard calendar to Mozilla Thunderbird
ru: Добавление вашего календаря из Канборд в Mozilla Thunderbird

source: Install the Add-on **Lightning** to add calendar support to Thunderbird
ru: Установите в Thunderbird Дополнение **Lightning**

source: Click on **File > New Calendar**
ru: Выберите **Файл** -> **Новый календарь**

source: In the dialog box, choose **On the Network**
ru: В диалоговом окне, выберите **Из сети**

source: Thunderbird Step 1
ru: Рисунок. Создание календаря в Thunderbird, шаг 1.

source: Choose the format iCalendar
ru: Выберите формат iCalendar

source: Thunderbird Step 2
ru: Рисунок. Создание календаря в Thunderbird, шаг 2.

source: Choose the colors and other settings and finally save
ru: Выберите цвета и другие настройки и в завершении нажмите **Сохранить**.

source: Adding your Kanboard calendar to Google Calendar
ru: Добавление вашего календаря Канборд в календарь Google

source: Click the down-arrow next to **Other calendars**.
ru: Нажмите иконку "треугольник" рядом с **Другие календари** (слева).

source: Select **Add by URL** from the menu.
ru: Вставьте ссылку на календарь из Канборд в поле "Добавить календарь друга"

source: Google Calendar
ru: Рисунок. Календарь Google.

source: Your Kanboard calendar can also be available from your Android device if you enable the synchronization.
ru: Ваш календарь из Канборд будет доступен на планшетах и смартфонах, нужно только сделать синхронизацию.

source: Note: According to the Google Support, external calendars are not refreshed very often, `read the documentation <https://support.google.com/calendar/answer/37100?hl=en&ref_topic=1672445>`__.
ru: `Справка по настройке календаря Google <https://support.google.com/calendar/?hl=ru#topic=3417969>`__.
