Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Documentation
ru: Документация

source: Using Kanboard
ru: Как работать в Kanboard

source: Introduction
ru: Введение

source: `What is Kanban? <what-is-kanban.markdown>`__
ru: `Что такое Kanban? <what-is-kanban.html>`__

source: `Kanban vs Todo Lists and Scrum <kanban-vs-todo-and-scrum.markdown>`__
ru: `Kanban против Todo списков и Scrum <kanban-vs-todo-and-scrum.html>`__

source: `Usage examples <usage-examples.markdown>`__
ru: `Где можно использовать Kanboard <usage-examples.html>`__

source: Using the board
ru: Использование доски

source: `Board, Calendar, List and Gantt views <project-views.markdown>`__
ru: `Доска, Календарь, Список и Гант представления <project-views.html>`__

source: `Collapsed and expanded mode <board-collapsed-expanded.markdown>`__
ru: `Компактное или развернутое отображение задач <board-collapsed-expanded.html>`__

source: `Horizontal scrolling and compact mode <board-horizontal-scrolling-and-compact-view.markdown>`__
ru: `Горизонтальная прокрутка и компактный вид <board-horizontal-scrolling-and-compact-view.html>`__

source: `Show and hide columns <board-show-hide-columns.markdown>`__
ru: `Отображение и скрытие колонок <board-show-hide-columns.html>`__

source: Working with projects
ru: Работа с проектами

source: `Project Types <project-types.markdown>`__
ru: `Типы проектов <project-types.html>`__

source: `Creating projects <creating-projects.markdown>`__
ru: `Создание проектов <creating-projects.html>`__

source: `Editing projects <editing-projects.markdown>`__
ru: `Редактирование проектов <editing-projects.html>`__

source: `Sharing boards and tasks <sharing-projects.markdown>`__
ru: `Публичные доски и задачи <sharing-projects.html>`__

source: `Automatic actions <automatic-actions.markdown>`__
ru: `Автоматизация процессов <automatic-actions.html>`__

source: `Project permissions <project-permissions.markdown>`__
ru: `Права доступа к проекту <project-permissions.html>`__

source: `Swimlanes <swimlanes.markdown>`__
ru: `Дорожки <swimlanes.html>`__

source: `Calendar <calendar.markdown>`__
ru: `Календарь <calendar.html>`__

source: `Analytics <analytics.markdown>`__
ru: `Аналитика <analytics.html>`__

source: `Gantt chart for tasks <gantt-chart-tasks.markdown>`__
ru: `Диаграмма Ганта для задач <gantt-chart-tasks.html>`__

source: `Gantt chart for projects <gantt-chart-projects.markdown>`__
ru: `Диаграмма Ганта для проектов <gantt-chart-projects.html>`__

source: `Custom filters <custom-filters.markdown>`__
ru: `Пользовательские фильтры <custom-filters.html>`__

source: Working with tasks
ru: Работа с задачами

source: `Creating tasks <creating-tasks.markdown>`__
ru: `Создание задач <creating-tasks.html>`__

source: `Closing tasks <closing-tasks.markdown>`__
ru: `Закрытие задач <closing-tasks.html>`__

source: `Duplicate and move tasks <duplicate-move-tasks.markdown>`__
ru: `Дублирование и перенос задач <duplicate-move-tasks.html>`__

source: `Adding screenshots <screenshots.markdown>`__
ru: `Добавление снимка экрана (скриншота) <screenshots.html>`__

source: `Task links <task-links.markdown>`__
ru: `Ссылки на задачу <task-links.html>`__

source: `Transitions <transitions.markdown>`__
ru: `Перемещения <transitions.html>`__

source: `Time tracking <time-tracking.markdown>`__
ru: `Отслеживание времени <time-tracking.html>`__

source: `Recurring tasks <recurring-tasks.markdown>`__
ru: `Повторяющиеся задачи <recurring-tasks.html>`__

source: `Create tasks by email <create-tasks-by-email.markdown>`__
ru: `Создание задач через email <create-tasks-by-email.html>`__

source: `Subtasks <subtasks.markdown>`__
ru: `Подзадачи <subtasks.html>`__

source: `Analytics for tasks <analytics-tasks.markdown>`__
ru: `Аналитика для задач <analytics-tasks.html>`__

source: `User mentions <user-mentions.markdown>`__
ru: `Ссылка на пользователя <user-mentions.html>`__

source: Working with users and groups
ru: Работа с пользователями и группами

source: `Roles <roles.markdown>`__
ru: `Роли <roles.html>`__

source: `User Types <user-types.markdown>`__
ru: `Типы пользователей <user-types.html>`__

source: `Group management <groups.markdown>`__
ru: `Управление группами <groups.html>`__

source: `User management <user-management.markdown>`__
ru: `Управление пользователями <user-management.html>`__

source: `Notifications <notifications.markdown>`__
ru: `Уведомления <notifications.html>`__

source: `Two factor authentication <2fa.markdown>`__
ru: `Двухуровневая аутентификация <2fa.html>`__

source: Settings
ru: Настройки

source: `Keyboard shortcuts <keyboard-shortcuts.markdown>`__
ru: `Горячие клавиши <keyboard-shortcuts.html>`__

source: `Application settings <application-configuration.markdown>`__
ru: `Настройки приложения <application-configuration.html>`__

source: `Project settings <project-configuration.markdown>`__
ru: `Настройки проекта <project-configuration.html>`__

source: `Board settings <board-configuration.markdown>`__
ru: `Настройка Доски <board-configuration.html>`__

source: `Calendar settings <calendar-configuration.markdown>`__
ru: `Настройки календаря <calendar-configuration.html>`__

source: `Link settings <link-labels.markdown>`__
ru: `Настройка ссылок <link-labels.html>`__

source: `Currency rate <currency-rate.markdown>`__
ru: `Курсы валют <currency-rate.html>`__

source: Integrations
ru: Встроенные возможности

source: `iCalendar subscriptions <ical.markdown>`__
ru: `iCalendar подписки <ical.html>`__

source: `RSS/Atom subscriptions <rss.markdown>`__
ru: `RSS/Atom подписки <rss.html>`__

source: `Json-RPC API <api-json-rpc.markdown>`__
ru: `Json-RPC API <api-json-rpc.html>`__

source: `Webhooks <webhooks.markdown>`__
ru: `Webhooks <webhooks.html>`__

source: `Plugins <plugins.markdown>`__
ru: `Плагины <plugins.html>`__

source: More
ru: Дополнительно

source: `Advanced Search Syntax <search.markdown>`__
ru: `Синтаксис расширенного поиска <ext-search.html>`__

source: `Command line interface <cli.markdown>`__
ru: `Интерфейс командной строки <cli.html>`__

source: `Syntax guide <syntax-guide.markdown>`__
ru: `Руководство по синтаксису <syntax-guide.html>`__

source: `Brute force protection <bruteforce-protection.markdown>`__
ru: `Защита от Brute force <bruteforce-protection.html>`__

source: `Frequently asked questions <faq.markdown>`__
ru: `Часто задаваемые вопросы <faq.html>`__

source: Technical details
ru: Технические детали

source: Installation
ru: Инсталяция

source: `Requirements <requirements.markdown>`__
ru: `Требования <requirements.html>`__

source: `Installation instructions <installation.markdown>`__
ru: `Инструкция по инсталяции <installation.html>`__

source: `Upgrade Kanboard to a new version <update.markdown>`__
ru: `Обновление Kanboard до новой версии <update.html>`__

source: `Installation on Ubuntu <ubuntu-installation.markdown>`__
ru: `Инсталяция на Ubuntu <ubuntu-installation.html>`__

source: `Installation on Debian <debian-installation.markdown>`__
ru: `Инсталяция на Debian <debian-installation.html>`__

source: `Installation on Centos <centos-installation.markdown>`__
ru: `Инсталяция на Centos <centos-installation.html>`__

source: `Installation on OpenSuse <suse-installation.markdown>`__
ru: `Инсталяция на OpenSuse <suse-installation.html>`__

source: `Installation on FreeBSD <freebsd-installation.markdown>`__
ru: `Инсталяция на FreeBSD <freebsd-installation.html>`__

source: `Installation on Windows Server with IIS <windows-iis-installation.markdown>`__
ru: `Инсталяция на Windows Server и IIS <windows-iis-installation.html>`__

source: `Installation on Windows Server with Apache <windows-apache-installation.markdown>`__
ru: `Инсталяция на Windows Server и Apache <windows-apache-installation.html>`__

source: `Installation on Heroku <heroku.markdown>`__
ru: `Инсталяция на Heroku <heroku.html>`__

source: `Run Kanboard with Docker <docker.markdown>`__
ru: `Запуск Kanboard под Docker <docker.html>`__

source: `Run Kanboard with Vagrant <vagrant.markdown>`__
ru: `Запуск Kanboard под Vagrant <vagrant.html>`__

source: `Run Kanboard on Cloudron <cloudron.markdown>`__
ru: `Запуск Kanboard на Cloudron <cloudron.html>`__

source: `Run Kanboard on Nitrous <nitrous.markdown>`__
ru: `Запуск Kanboard на Nitrous <nitrous.html>`__

source: Configuration
ru: Настройка

source: `Daily background job <cronjob.markdown>`__
ru: `Ежедневные фоновые задачи <cronjob.html>`__

source: `Config file <config.markdown>`__
ru: `Конфигурационный файл <config.html>`__

source: `Environment variables <env.markdown>`__
ru: `Переменные окружения <env.html>`__

source: `Email configuration <email-configuration.markdown>`__
ru: `Настройка email <email-configuration.html>`__

source: `URL rewriting <nice-urls.markdown>`__
ru: `Переопределение URL <nice-urls.html>`__

source: `Plugin Directory <plugin-directory.markdown>`__
ru: `Директория плагинов <plugin-directory.html>`__

source: Database
ru: База данных

source: `Sqlite database management <sqlite-database.markdown>`__
ru: `База данных Sqlite <sqlite-database.html>`__

source: `How to use Mysql <mysql-configuration.markdown>`__
ru: `Как использовать Mysql <mysql-configuration.html>`__

source: `How to use Postgresql <postgresql-configuration.markdown>`__
ru: `Как использовать Postgresql <postgresql-configuration.html>`__

source: Authentication
ru: Аутентификация

source: `LDAP authentication <ldap-authentication.markdown>`__
ru: `LDAP аутентификация <ldap-authentication.html>`__

source: `LDAP group synchronization <ldap-group-sync.markdown>`__
ru: `Синхронизация групп LDAP <ldap-group-sync.html>`__

source: `LDAP profile picture <ldap-profile-picture.markdown>`__
ru: `Изображения из профиля LDAP <ldap-profile-picture.html>`__

source: `LDAP parameters <ldap-parameters.markdown>`__
ru: `Параметры LDAP <ldap-parameters.html>`__

source: `LDAP configuration examples <ldap-configuration-examples.markdown>`__
ru: `Пример конфигурации LDAP <ldap-configuration-examples.html>`__

source: `Reverse proxy authentication <reverse-proxy-authentication.markdown>`__
ru: `Аутентификация Reverse proxy <reverse-proxy-authentication.html>`__

source: Contributors
ru: Участие в проекте

source: `Contributor guide <contributing.markdown>`__
ru: `Руководство для участников проекта <contributing.html>`__

source: `Translations <translations.markdown>`__
ru: `Переводы <translations.html>`__

source: `Coding standards <coding-standards.markdown>`__
ru: `Стандарты при написании кода <coding-standards.html>`__

source: `Running tests <tests.markdown>`__
ru: `Выполнение тестов <tests.html>`__

source: `Build assets <assets.markdown>`__
ru: `Создание assets <assets.html>`__

source: The documentation is written in `Markdown <http://en.wikipedia.org/wiki/Markdown>`__. If you want to improve the documentation, just send a pull-request.
ru: `Оригинальная документация <https://github.com/fguillot/kanboard/tree/master/doc>`__ написана в `Markdown <https://ru.wikipedia.org/wiki/Markdown>`__. Если вы желаете улучшить документацию - пошлите pull-request. * `Русская документация <https://github.com/hairetdin/kanboard-doc-ru>`__ написана в `Sphinx-doc <https://ru.wikipedia.org/wiki/Sphinx_%28%D0%B3%D0%B5%D0%BD%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80_%D0%B4%D0%BE%D0%BA%D1%83%D0%BC%D0%B5%D0%BD%D1%82%D0%B0%D1%86%D0%B8%D0%B8%29>`__. Вы можете принять участие в переводе документации на русский язык. Переводите `<https://github.com/hairetdin/kanboard-doc-ru/tree/master/source/locale/ru/LC_MESSAGES>`__ .po файлы и присылайте pull request. Редакторы .po файлов - gtranslator, poedit
