Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/installation.po
Languages: ru

source: Installation
ru: Инсталяция

source: Firstly, check the `requirements <requirements.markdown>`__ before to go further.
ru: В первую очередь, ознакомтесь с `требованиями <requirements.html>`__.

source: From the archive (stable version)
ru: Инсталяция из архива (стабильная версия)

source: You must have a web server with PHP installed
ru: У вас должен быть установлен веб сервер с PHP

source: Download the source code and copy the directory ``kanboard`` where you want
ru: Скачайте исходный код и скопируйте директорию ``kanboard`` в каталог веб сервера

source: Check if the directory ``data`` is writeable
ru: Проверьте, чтобы директория ``data`` была доступна на запись

source: With your browser go to http://yourpersonalserver/kanboard
ru: В вашем браузере перейдите по ссылке http://вашвебсервер/kanboard

source: The default login and password is **admin/admin**
ru: Логин и пароль по умолчанию - **admin/admin**

source: Start to use the software
ru: Все, теперь вы можете работать в Канборд

source: Don't forget to change your password!
ru: Не забудьте сменить пароль!

source: The data folder is used to store:
ru: Место хранения данных:

source: Sqlite database: ``db.sqlite``
ru: База данных Sqlite: ``db.sqlite``

source: Debug file: ``debug.log`` (if debug mode enabled)
ru: Файл отладки: ``debug.log`` (если включена отладка)

source: Uploaded files: ``files/*``
ru: Загруженные файлы: ``files/*``

source: Image thumbnails: ``files/thumbnails/*``
ru: Изображения: ``files/thumbnails/*``

source: People who are using a remote database (Mysql/Postgresql) and a remote file storage (Aws S3 or similar) don't necessarily need to have a persistent local data folder or to change the permission.
ru: Те, кто использует удаленную базу данных (Mysql/Postgresql) и удаленное файловое хранилище (Aws S3 или подобное), могут не назначать права доступа к локальным данным.

source: From the repository (development version)
ru: Инсталяция из репозитория (разрабатываемая версия)

source: You must install `composer <https://getcomposer.org/>`__ to use this method.
ru: Вы можете установить `composer <https://getcomposer.org/>`__ для этого метода инсталяции.

source: Go to the third step just above
ru: Далее, перейдите к третьему шагу `Инсталяция из архива <installation.html#from-the-archive-stable-version>`__

source: Note: This method will install the **current development version**, use at your own risk.
ru: **Внимание**: Инсталируя **текущую разрабатываемую версию**, вы должны понимать, что это нестабильная версия и берете все риски по работе Канборд на себя.

source: Installation outside of the document root
ru: Инсталяция в другой каталог

source: If you would like to install Kanboard outside of the web server document root, you need to create at least these symlinks:
ru: Если вы хотите инсталировать Канборд в другую директорию, вне корневого каталога веб сервера, вам нужно создать, как минимум, следующие символьные ссылки:

source: The ``.htaccess`` is optional because its content can be included directly in the Apache configuration.
ru: ``.htaccess`` необязательно, потому что его содержимое может быть включена прямо в конфигурацию Apache.

source: You can also define a custom location for the plugins and files folders by changing the `config file <config.markdown>`__.
ru: Вы можете указать текущее месторасположение директорий плагинов и файлов изменив `конфигурационный файл <config.html>`__.

source: Security
ru: Безопасность

source: Don't forget to change the default user/password
ru: Не забудьте изменить логин и пароль пользователя admin, назначенный по умолчанию

source: Don't allow everybody to access to the directory ``data`` from the URL. There is already a ``.htaccess`` for Apache but nothing for Nginx.
ru: Не предоставляйте всем права на директорию ``data`` через URL.

source: Notes
ru: Примечание

source: Some features of Kanboard require that you run `a daily background job <cronjob.markdown>`__
ru: Некоторые возможности Канборда требуют, чтобы `ежедневно выполнялись фоновые задачи <cronjob.html>`__.
