Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/kanban-vs-todo-and-scrum.po
Languages: ru

source: Kanban vs Todo lists and Scrum
ru: Сравнение Kanban, Todo lists и Scrum

source: Kanban vs Todo lists
ru: Сравнение Kanban и Todo lists

source: Todo lists:
ru: Todo lists (списки для исполнения):

source: Single phase (just a list of items)
ru: Имеют одну фазу (только список пунктов)

source: Multitasking possible (not efficient)
ru: Возможна многозадачность (не эффективна)

source: Multiple phases, each column represent a step
ru: Имеет много фаз, каждая колонка представлена как шаг процесса

source: Bring focus and avoid multitasking because you can set a work in progress limit per column
ru: Концентрация внимания и исключение многозадачности, потому что вы можете установить этап процесса заданной колонкой

source: Kanban vs Scrum
ru: Сравнение Kanban и Scrum

source: Scrum:
ru: `Scrum: <https://ru.wikipedia.org/wiki/Scrum>`__

source: Sprints are time-boxed, usually 2 or 4 weeks
ru: Спринты жестко фиксированные временем, обычно 2 или 4 недели

source: Do not allow changes during the iteration
ru: Не позволяет вносить изменения в течении итерации

source: Estimation is required
ru: Обязательна предварительная оценка

source: Uses velocity as default metric
ru: Используется скорость как единица измерения по умолчанию

source: Scrum board is cleared between each sprint
ru: Доска Scrum очищается между спринтами

source: Scrum has pre-defined roles like scrum master, product owners and the team
ru: Scrum имеет преопределенные роли, такие как, мастер, владелец продукта и команда

source: A lot of meetings: planning, backlogs grooming, daily stand-up, retrospective
ru: Множество встреч: планирование, беклог груминг (причесывание), ежедневные совещания, ретроспектива

source: Continuous flow
ru: Непрерывный поток

source: Changes can be made at anytime
ru: Гибкость - изменения могут быть сделаны в любое время

source: Estimation is optional
ru: Предварительная оценка опциональна

source: Use lead and cycle time to measure performance
ru: Используется время выполнения (lead time) и время цикла (cycle time) для измерения производительности

source: Kanban board is persistent
ru: Доска Kanboar постоянна

source: Kanban doesn't impose strict constraints or meetings, process is more flexible
ru: Kanban не навязывает строгих ограничений или встреч, процессы более гибкие
