Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/keyboard-shortcuts.po
Languages: ru

source: Keyboard shortcuts
ru: Горячие клавиши

source: Keyboard shortcuts availability depends of the page you are presently.
ru: Горячие клавиши доступны в зависимости от страницы на которой вы находитесь.

source: Project views (Board, Calendar, List, Gantt)
ru: В проекте (Доска, Календарь, Список, Гант)

source: Switch to the project overview = **v o**
ru: Переключиться на Обзор проектов = **v o** (переключите клавиатуру в английскую раскладку и нажмите клавиши **v** и **o** )

source: Switch to the board view = **v b** (press on **v** then **b**)
ru: Переключиться на Доску = **v b**

source: Switch to the calendar view = **v c**
ru: Переключиться на Календарь = **v c**

source: Switch to the list view = **v l**
ru: Переключиться на список = **v l**

source: Switch to the Gantt view = **v g**
ru: Переключиться на диаграмму Ганта = **v g**

source: Board view
ru: На Доске

source: New task = **n**
ru: Новая задача = **n**

source: Expand/collapse tasks = **s**
ru: Свернуть/развернуть задачи = **s**

source: Compact/wide view = **c**
ru: Компактный/широкий вид = **c**

source: Task view
ru: В Задаче

source: Edit task = **e**
ru: Редактировать задачу = **e**

source: New subtask = **s**
ru: Новая подзадача = **s**

source: New comment = **c**
ru: Новый комментарий = **c**

source: New internal link = **l**
ru: Новая внутренняя ссылка = **l**

source: Application
ru: В приложении (главное окно Канборд)

source: Display list of keyboard shortcuts = **?**
ru: Показать список горячих клавиш = **?**

source: Open board switcher = **b**
ru: Открыть переключатель проектов = **b**

source: Go to the search box = **f**
ru: Переход в окно поиска = **f**

source: Reset the search box = **r**
ru: Очистить окно поиска = **r**

source: Close dialog box = **ESC**
ru: Закрыть окно диалога = **ESC**

source: Submit form = **CTRL+ENTER** or **⌘+ENTER**
ru: Расширенный поиск = **CTRL+ENTER** or **⌘+ENTER**
