Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/ldap-configuration-examples.po
Languages: ru

source: LDAP Configuration Examples
ru: Пример конфигурации LDAP

source: User authentication
ru: Аутентификация пользователя

source: Download the user profile picture from Active Directory
ru: Загрузка пользовательского профиля из Active Directory

source: Set user language from LDAP attribute
ru: Установка языка пользователя из атрибутов LDAP

source: Kanboard roles are mapped to Active Directory groups
ru: Роли в Канборд сопоставляются с группами в Active Directory

source: LDAP group providers is enabled
ru: Поставщики групп LDAP включены

source: OpenLDAP with memberOf overlay
ru: OpenLDAP с memberOf overlay

source: User LDIF example:
ru: Пример LDIF пользователя:

source: Group LDIF example:
ru: Пример LDIF группы:

source: Kanboard Configuration:
ru: Конфигурация Канборд:

source: Kanboard roles are mapped to LDAP groups
ru: Роли в Канборд сопоставляются с группами LDAP

source: OpenLDAP with Posix groups (memberUid)
ru: OpenLDAP с Posix groups (memberUid)

source: OpenLDAP with groupOfNames
ru: OpenLDAP с groupOfNames
