Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/ldap-profile-picture.po
Languages: ru

source: LDAP User Profile Photo
ru: Фотография пользователя из профиля LDAP

source: Kanboard can download automatically user pictures from the LDAP server.
ru: Канборд может автоматически загружать фотографию пользователя из сервера LDAP.

source: This feature is enabled only if LDAP authentication is activated and the parameter ``LDAP_USER_ATTRIBUTE_PHOTO`` is defined.
ru: Эта функция возможна только если активирована аутентификация LDAP и указан параметр ``LDAP_USER_ATTRIBUTE_PHOTO``.

source: Configuration
ru: Настройка

source: In your ``config.php``, you have to set the LDAP attribute used to store the image.
ru: В вашем ``config.php``, вы должны установить атрибут LDAP, используемый для хранения изображения.

source: Usually, the attributes ``jpegPhoto`` or ``thumbnailPhoto`` are used. The image can be stored in JPEG or PNG format.
ru: Обычно используются атрибуты ``jpegPhoto`` или ``thumbnailPhoto``. Изображения могут хранится в формате JPEG или PNG.

source: To upload the image in the user profile, Active Directory administrators may use software like `AD Photo Edit <http://www.cjwdev.co.uk/Software/ADPhotoEdit/Info.html>`__.
ru: Для загрузки изображения в пользовательски профиль, администраторы Active Directory могут использовать программу `AD Photo Edit <http://www.cjwdev.co.uk/Software/ADPhotoEdit/Info.html>`__.

source: Notes
ru: Примечание

source: The profile image is **downloaded at login time only if the user do not already have uploaded an image previously**.
ru: Изображение из профиля **загружается при входе, только если изображение не было загружено ранее**.

source: To change the user photo, the previous one have to be removed manually in the user profile.
ru: Для смены изображения, нужно вручную удалить ранее загруженное изображение из профиля пользователя.
