Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/ldap-authentication.po
Languages: ru

source: LDAP Authentication
ru: Аутентификация LDAP

source: Requirements
ru: Требования

source: PHP LDAP extension enabled
ru: Включенное в PHP раширение LDAP

source: LDAP server:
ru: Сервер LDAP:

source: Workflow
ru: Рабочий процесс

source: When the LDAP authentication is activated, the login process works like that:
ru: Когда активирована аутентификация LDAP, процесс входа выглядит следующим образом:

source: Try first to authenticate the user by using the database
ru: Выполняется попытка аутентификации пользователя в базе данных Канборда

source: If the user is not found inside the database, a LDAP authentication is performed
ru: Если пользователь не найден в базе Канборда, выполняется аутентификация LDAP

source: If the LDAP authentication is successful, by default a local user is created automatically with no password and marked as LDAP users.
ru: Если аутентификация LDAP выполнена успешно, по умолчанию, локальный пользователь (в Канборде) создается автоматически без пароля и помечается как пользователь LDAP.

source: The full name and the email address are automatically fetched from the LDAP server.
ru: Полное имя и email адрес автоматически подгружаются из сервера LDAP.

source: Authentication Types
ru: Типы аутентификации

source: Type
ru: Тип

source: Description
ru: Описание

source: A specific user is used to browse LDAP directory
ru: Использовать специального пользователя для просмотра директории LDAP

source: The end-user credentials are used for browsing LDAP directory
ru: Использовать учетные данные конечного пользователя для просмотра директории LDAP

source: No authentication is performed for LDAP browsing
ru: Не надо выполнять аутентификацию для доступа к каталогу LDAP

source: **The recommended authentication method is "Proxy"**.
ru: **Рекомендуемый метод аутентификации - "Proxy"**.

source: Anonymous mode
ru: Анонимный (Anonymous) метод

source: This is the default value but some LDAP servers don't allow anonymous browsing for security reasons.
ru: Этот метод используется по умолчанию, но некоторые сервера LDAP не поддерживают доступ анонимам, из соображений безопасности.

source: Proxy mode
ru: Proxy метод

source: A specific user is used to browse the LDAP directory:
ru: Специальный пользователь используется для доступа к директории LDAP:

source: User mode
ru: Пользовательский метод (user)

source: This method uses the credentials provided by the end-user.
ru: Этот метод используется для доступа под учетной записью конечного пользователя.

source: For example, Microsoft Active Directory doesn't allow anonymous browsing by default and if you don't want to use a proxy user you can use this method.
ru: Например, Microsoft Active Directory не разрешает подключение под анонимным пользователем и если вы не хотите использовать пользователя proxy, то используйте этот метод.

source: In this case, the constant ``LDAP_USERNAME`` is used as a pattern to the ldap username, examples:
ru: В этом методе, константа ``LDAP_USERNAME`` использутся как шаблон для пользователя ldap, например:

source: ``%s@kanboard.local`` will be replaced by ``my_user@kanboard.local``
ru: ``%s@kanboard.local`` будет заменен ``my_user@kanboard.local``

source: ``KANBOARD\\%s`` will be replaced by ``KANBOARD\my_user``
ru: ``KANBOARD\\%s`` будет заменен на ``KANBOARD\my_user``

source: User LDAP filter
ru: Фильтр пользователей LDAP

source: The configuration parameter ``LDAP_USER_FILTER`` is used to find users in LDAP directory.
ru: Параметр конфигурации ``LDAP_USER_FILTER`` используется для поиска пользователей по директории LDAP.

source: Examples:
ru: Например:

source: ``(&(objectClass=user)(sAMAccountName=%s))`` is replaced by ``(&(objectClass=user)(sAMAccountName=my_username))``
ru: ``(&(objectClass=user)(sAMAccountName=%s))`` будет заменено на ``(&(objectClass=user)(sAMAccountName=указанный_пользователь))``

source: ``uid=%s`` is replaced by ``uid=my_username``
ru: ``uid=%s`` is replaced by ``uid=указанный_пользователь``

source: Other examples of `filters for Active Directory <http://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`__
ru: Другие примеры `фильтров для Active Directory <http://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`__

source: Example to filter access to Kanboard:
ru: Пример фильра доступа в Канборд:

source: This example allows only people members of the group "Kanboard Users" to connect to Kanboard.
ru: Этот пример разрешает подключатся к Канборду только пользователям участникам группы "Kanboard Users"

source: Example for Microsoft Active Directory
ru: Пример для Microsoft Active Directory

source: Let's say we have a domain ``KANBOARD`` (kanboard.local) and the primary controller is ``myserver.kanboard.local``.
ru: Предположим, что мы имеем домен ``KANBOARD`` (kanboard.local) и контролер домена ``myserver.kanboard.local``.

source: First example with proxy mode:
ru: Первый пример для метода прокси (proxy):

source: Second example with user mode:
ru: Второй пример с пользовательским методом (user):

source: Example for OpenLDAP
ru: Пример для OpenLDAP

source: Our LDAP server is ``myserver.example.com`` and all users are stored under ``ou=People,dc=example,dc=com``.
ru: Наш сервер LDAP - ``myserver.example.com`` и все пользователи хранятся в ``ou=People,dc=example,dc=com``.

source: For this example we use the anonymous binding.
ru: Для этого примера мы использовали анонимное подключение.

source: Disable automatic account creation
ru: Выключение автоматического создания учетных записей

source: By default, Kanboard will create a user account automatically if nothing is found.
ru: По умолчанию, Канборд автоматически создает учетную запись пользователя, если такой пользователь не найден.

source: You can disable this behavior if you prefer to create user accounts manually to restrict Kanboard to only some people.
ru: Вы можете выключить это поведение, если вы предпочитаете создавать учетные записи вручную.

source: Just change the value of ``LDAP_ACCOUNT_CREATION`` to ``false``:
ru: Для этого установите значение ``LDAP_ACCOUNT_CREATION`` в ``false``:

source: Troubleshooting
ru: Устранение неисправностей

source: If SELinux is enabled, you have to allow Apache to reach out your LDAP server.
ru: Если включен SELinux, вы должны разрешить Apache доступ к вашему серверу LDAP.

source: You can switch SELinux to the permissive mode or disable it (not recommended)
ru: Вы должны переключить SELinux в разрешающий режим (permissive mode) или совсем выключить (не рекомендуется)

source: You can allow all network connections, by example ``setsebool -P httpd_can_network_connect=1`` or have a more restrictive rule
ru: Вы должны разрешить все сетевые подключения, например ``setsebool -P httpd_can_network_connect=1`` или назначить более ограничивающие правила

source: In any case, refer to the official Redhat/Centos documentation.
ru: В любом случае, ознакомтесь с официальной документацией Redhat/Centos.

source: If you are not able to setup correctly the LDAP authentication, you can `enable the debug mode <config.markdown>`__ and watch log files.
ru: Если вам не удается настроить аутентификацию LDAP, то вы можете `включить режим отладки <config.html>`__ и посмотреть файлы событий.
