Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/ldap-group-sync.po
Languages: ru

source: LDAP Group Synchronization
ru: Синхронизация групп LDAP

source: Requirements
ru: Требования

source: Have LDAP authentication properly configured
ru: Правильно настроенную аутентификацию LDAP

source: Use a LDAP server that supports ``memberOf`` or ``memberUid`` (PosixGroups)
ru: Используется сервер LDAP, который поддерживает ``memberOf`` или ``memberUid`` (PosixGroups)

source: Define automatically user roles based on LDAP groups
ru: Автоматическое определение ролей пользователей на основании LDAP групп

source: Use these constants in your config file:
ru: Используйте следующие константы в вашем конфигурационном файле:

source: ``LDAP_GROUP_ADMIN_DN``: Distinguished names for application administrators
ru: ``LDAP_GROUP_ADMIN_DN``: Уникальные имена (Distinguished Names) для администраторов приложения

source: ``LDAP_GROUP_MANAGER_DN``: Distinguished names for application managers
ru: ``LDAP_GROUP_MANAGER_DN``: Уникальные имена (Distinguished Names) для менеджеров приложения

source: Example for Active Directory:
ru: Пример для Active Directory:

source: People member of "Kanboard Admins" will have the role "Administrator"
ru: Участники группы "Kanboard Admins" будут иметь роль "Администратор"

source: People member of "Kanboard Managers" will have the role "Managers"
ru: Участники группы "Kanboard Managers" будут иметь роль "Менеджер"

source: Everybody else will have the role "User"
ru: Все, кто не попадает под предыдущие определения, будут иметь роль "Пользователь"

source: Example for OpenLDAP with Posix Groups:
ru: Пример OpenLDAP с Posix Groups:

source: You **must define the parameter** ``LDAP_GROUP_USER_FILTER`` if your LDAP server use ``memberUid`` instead of ``memberOf``. All parameters of this example are mandatory.
ru: Вы **должны определить параметр** ``LDAP_GROUP_USER_FILTER``, если ваше сервер LDAP использует ``memberUid`` вместо ``memberOf``. Все параметры в этом примере обязательные.

source: Automatically load LDAP groups for project permissions
ru: Автоматическая загрузка групп LDAP для Канборд проекта

source: This feature allows you to sync automatically LDAP groups with Kanboard groups. Each group can have a different project role assigned.
ru: Эта возможность позволяет вам синхронизировать автоматически группы LDAP с группами Канборд. Каждая группа может иметь разные роли в проектах.

source: On the project permissions page, people can enter groups in the auto-complete field and Kanboard can search for groups with any provider enabled.
ru: В проекте на странице *Разрешения*, можно ввести имя группы (имеется автодополнение) и Канборд будет искать группу во всех подключенных поставщиках.

source: If the group doesn't exist in the local database, it will be automatically synced.
ru: Если группа не найдена в локальной базе данных, то она будет автоматически синхронизированна.

source: ``LDAP_GROUP_PROVIDER``: Enable the LDAP group provider
ru: ``LDAP_GROUP_PROVIDER``: Включение поставщика группы LDAP

source: ``LDAP_GROUP_BASE_DN``: Distinguished names to find groups in LDAP directory
ru: ``LDAP_GROUP_BASE_DN``: Уникальное имя (Distinguished Names) для поиска группы в LDAP директории

source: ``LDAP_GROUP_FILTER``: LDAP filter used to perform the query
ru: ``LDAP_GROUP_FILTER``: фильтр LDAP используемый для выполнения запроса

source: ``LDAP_GROUP_ATTRIBUTE_NAME``: LDAP attribute used to fetch the group name
ru: ``LDAP_GROUP_ATTRIBUTE_NAME``: атрибут LDAP используемый для получения имени группы

source: With the filter given as example above, Kanboard will search for groups that match the query. If the end-user enter the text "My group" in the auto-complete box, Kanboard will return all groups that match the pattern: ``(&(objectClass=group)(sAMAccountName=My group*))``.
ru: С помощью фильтра, в примере выше, Канборд будет искать группы соответсвующие запросу. Если пользователь введет текст "Мои группы" в автозаполняемое поле, Канборд вернет все группы которые соответсвуют шаблону: ``(&(objectClass=group)(sAMAccountName=Мои группы*))``.

source: Note 1: The special characters ``*`` is important here, **otherwise an exact match will be done**.
ru: Примечание 1: Спец символ ``*`` очень важен, в противном случает **будет выбрано только точное совпадение**

source: Note 2: This feature is only compatible with LDAP authentication configured in "proxy" or "anonymous" mode
ru: Примечание 2: Эта функция возможна только с аутентификацией LDAP настроенной на метод "proxy" или "anonymous"

source: `More examples of LDAP filters for Active Directory <http://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`__
ru: `Больше примеров фильтров LDAP для Active Directory <http://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`__
