Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/mysql-configuration.po
Languages: ru

source: Mysql/MariaDB Configuration
ru: Настройка Mysql/MariaDB

source: By default Kanboard use Sqlite to stores its data. However it's possible to use Mysql or MariaDB instead of Sqlite.
ru: По умолчанию Канборд использует для хранения данных Sqlite. Вместо Sqlite возможно использовать Mysql или MariaDB.

source: Requirements
ru: Требования

source: Mysql server
ru: Сервер Mysql

source: The PHP extension ``pdo_mysql`` installed
ru: Установленное расширение PHP - ``pdo_mysql``

source: Note: Kanboard is tested with **Mysql >= 5.5 and MariaDB >= 10.0**
ru: Примечание: работа Канборда протестирована с **Mysql >= 5.5 и MariaDB >= 10.0**

source: Mysql configuration
ru: Настройка Mysql

source: Create a database
ru: Создание базы данных

source: The first step is to create a database on your Mysql server. By example, you can do that with the command line mysql client:
ru: Первым шагом надо создать базу данных на вашем сервере Mysql. Например, вы можете создать базу в командной строке клиента mysql:

source: Create a config file
ru: Создание файла конфигурации

source: The file ``config.php`` should contains those values:
ru: Файл ``config.php`` должен содержать следующие значения:

source: Note: You can also rename the template file ``config.default.php`` to ``config.php``.
ru: Примечание: Вы можете переименовать демонстрационный файл ``config.default.php`` в ``config.php``.

source: Importing SQL dump (alternative method)
ru: Импорт SQL дампа (альтернативный метод)

source: For the first time, Kanboard will run one by one each database migration and this process can take some time according to your configuration.
ru: В первый раз, Канборд запускает по очереди каждую миграцию базы данных и этот процес может занять некоторое время, в зависимости от вашей конфигурации.

source: To avoid any potential timeout you can initialize the database directly by importing the SQL schema:
ru: Чтобы избежать задержек, вы можете инициализировать базу данных напрямую, имопртируя SQL схему:

source: The file ``app/Schema/Sql/mysql.sql`` is a SQL dump that represents the last version of the database.
ru: Файл ``app/Schema/Sql/mysql.sql``это SQL дамп, который представляет последнюю версию базы данных.

source: SSL configuration
ru: Конфигурация SSL

source: These parameters have to be defined to enable the Mysql SSL connection:
ru: Эти параметры должны быть указаны для включения соединения Mysql SSL:
