Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/nice-urls.po
Languages: ru

source: URL rewriting
ru: Переопределение URL

source: Kanboard is able to work indifferently with URL rewriting enabled or not.
ru: Канборд может работать и с переопределенными URL и с простыми.

source: Example of URL rewritten: ``/board/123``
ru: Пример переопределенного URL: ``/board/123``

source: Otherwise: ``?controller=board&action=show&project_id=123``
ru: По другому: ``?controller=board&action=show&project_id=123``

source: If you use Kanboard with Apache and with the mode rewrite enabled, nice URLs will be used automatically. In case you get a "404 Not Found", you might need to set at least the following overrides for your DocumentRoot to get the .htaccess files working:
ru: Если вы используете Канборд с Apache и включенным mode rewrite, красивые URL будут использоваться автоматически. В случае, если вы получаете ошибку "404 Not Found", то возможно надо внести изменения в DocumentRoot:

source: URL Shortcuts
ru: URL ярлыки

source: Go to the task #123: **/t/123**
ru: Перейти к задаче #123: **/t/123**

source: Go to the board of the project #2: **/b/2**
ru: Перейти на доску в проект #2: **/b/2**

source: Go to the project calendar #5: **/c/5**
ru: Перейти в календарь проекта #5: **/c/5**

source: Go to the list view of the project #8: **/l/8**
ru: Перейти к просмотру списком проекта #8: **/l/8**

source: Go to the project settings for the project id #42: **/p/42**
ru: Перейти к настройкам проекта для проекта id #42: **/p/42**

source: Configuration
ru: Настройка

source: By default, Kanboard will check if the Apache mode rewrite is enabled.
ru: По умолчанию, Канборд проверяет включен ли в Apache mode rewrite.

source: To avoid the automatic detection of URL rewriting from the web server, you can enable this feature in your config file:
ru: Для исключения автоматической проверки переопределения URL на веб сервере, вы должны включить эту опцию в вашем конфигурационном фале:

source: When this constant is at ``true``:
ru: Когда константа имеет значение ``true``:

source: URLs generated from command line tools will be also converted
ru: Сгенерированные из утилиты командной строки URL будут также преобразованы

source: If you use another web server than Apache, by example Nginx or Microsoft IIS, you have to configure yourself the URL rewriting
ru: Если вы используете другой веб сервер вместо Apache, например Nginx или Microsoft IIS, вы можете сами настроить переопределение URL

source: Note: Kanboard always fallback to old school URLs when it's not configured, this configuration is optional.
ru: Примечание: Канборд всегда использует URL по "старинке", если данная константа не настроена. Эта настройка опциональна.

source: Nginx configuration example
ru: Пример настройки Nginx

source: In the section ``server`` of your Nginx config file you can use this example:
ru: В разделе ``server``, вашего конфигурационного файла Nginx, вы можете использовать этот пример:

source: In your Kanboard ``config.php``:
ru: В конфигурационном файле Канборда ``config.php``:

source: Adapt the example above according to your own configuration.
ru: Адаптируйте пример приведенный выше к вашей конфигурации.

source: IIS configuration example
ru: Пример настройки IIS

source: Create a web.config in you installation folder:
ru: Создайте web.config в каталоге где установлен Канборд:
