Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/notifications.po
Languages: ru

source: Notifications
ru: Уведомления

source: Kanboard is able to send notifications through several channels:
ru: Канборд имеет возможность отправлять сообщения по нескольким каналам:

source: Web (List of unread messages)
ru: Веб (уведомления в Канборд)

source: External plugins allow you to send notifications to Slack, Hipchat, Jabber or any chat system.
ru: Внешние плагины позволяют вам посылать уведомления в Slack, Hipchat, Jabber или другие чат системы.

source: Configuration
ru: Настройка

source: Each user must enable the notifications in their profile: **User Profile > Notifications**. It's disabled by default.
ru: Любой пользователь может включить уведоления в своем профиле: в правом верхнем углу выберите во всплывающем меню **Мой профиль** -> **Уведомления**. Уведомления по умолчанию выключены.

source: To receive email notifications you need a valid email address in your profile and the application must be configured to send emails.
ru: Для получения уведомлений по email вам надо иметь электронную почту (email), которая должна быть указана в вашем профиле, и Канборд должен быть настроен на отправку электронной почты.

source: You can choose your favorite notification method:
ru: Вы можете выбрать, удобный для вас, способ получения уведомлений:

source: Emails
ru: Email

source: Web (see below)
ru: Веб (смотрите ниже)

source: For each project you are a member, you can choose to receive notifications for:
ru: Для каждого проекта в котором вы являетесь участником, вы можете выбрать получение уведомления для:

source: All tasks
ru: Всех задач

source: Only for tasks assigned to you
ru: Только для задач назначеных вам

source: Only for tasks created by you
ru: Только для задач, которые создали вы

source: Only for tasks created by you and assigned to you
ru: Только для задач, созданных вами и назначенных вам

source: You can also select only some projects, by default it's all projects where you are a member.
ru: Также, вы можете выбрать проекты из которых хотите получать уведомления. По умолчанию - все проекты, в которых вы являетесь участником.

source: Web notifications
ru: Веб уведомления

source: Web notifications are available from the dashboard or from the icon at the top:
ru: Веб уведомления доступны на рабочей панели **Мои уведомления** или вверху в виде иконки:

source: Web Notifications Icon
ru: Рисунок. Иконка веб уведомления.

source: Notifications are shown in a list, so you can mark individual notification as read or everything.
ru: Уведомления отображаются списком. Вы можете выбрать действие **Пометить как прочитанное** для каждого сообщения или отметить сразу все.

source: Web Notifications
ru: Рисунок. Веб уведомления.

source: In this way you can still get notified without having to receive emails.
ru: Таким образом, вы можете получать веб уведомления без использования электронной почты.
