Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/plugins.po
Languages: ru

source: Plugin Development
ru: Разработка плагина

source: Note: The plugin API is **considered alpha** at the moment.
ru: **Внимание: API плагинов на данный момент в состоянии альфа.**

source: Plugins are useful to extend the core functionalities of Kanboard, adding features, creating themes or changing the default behavior.
ru: Плагины удобны для расширения базового функционала Канборда: добавление возможностей, создание тем или изменения базового поведения.

source: Plugin creators should specify explicitly the compatible versions of Kanboard. Internal code of Kanboard may change over time and your plugin must be tested with new versions. Always check the `ChangeLog <https://github.com/fguillot/kanboard/blob/master/ChangeLog>`__ for breaking changes.
ru: Создатели плагина должны указать точную версию Канборда, под которую написан плагин. Внутренний код Канборда может изменяться и ваш плагин должен тестироваться на совместимость с новой версией. Всегда следите за `ChangeLog <https://github.com/fguillot/kanboard/blob/master/ChangeLog>`__ для внесения изменений.

source: `Creating your plugin <plugin-registration.markdown>`__
ru: `Создание вашего плагина <plugin-registration.html>`__

source: `Using plugin hooks <plugin-hooks.markdown>`__
ru: `Использование plugin hooks <plugin-hooks.html>`__

source: `Events <plugin-events.markdown>`__
ru: `События <plugin-events.html>`__

source: `Override default application behaviors <plugin-overrides.markdown>`__
ru: `Изменение базового поведения приложений <plugin-overrides.html>`__

source: `Add schema migrations for plugins <plugin-schema-migrations.markdown>`__
ru: `Добавление миграции схемы для плагинов <plugin-schema-migrations.html>`__

source: `Custom routes <plugin-routes.markdown>`__
ru: `Пользовательские маршруты <plugin-routes.html>`__

source: `Add helpers <plugin-helpers.markdown>`__
ru: `Добавление обработчиков <plugin-helpers.html>`__

source: `Add mail transports <plugin-mail-transports.markdown>`__
ru: `Добавление почтовых трансляторов <plugin-mail-transports.html>`__

source: `Add notification types <plugin-notifications.markdown>`__
ru: `Добавление типов оповещений <plugin-notifications.html>`__

source: `Add automatic actions <plugin-automatic-actions.markdown>`__
ru: `Добавление автоматических действий <plugin-automatic-actions.html>`__

source: `Attach metadata to users, tasks and projects <plugin-metadata.markdown>`__
ru: `Расширение данных пользователей, задач и проектов <plugin-metadata.html>`__

source: `Authentication architecture <plugin-authentication-architecture.markdown>`__
ru: `Архитектура аутентификации <plugin-authentication-architecture.html>`__

source: `Authentication plugin registration <plugin-authentication.markdown>`__
ru: `Регистрация плагина аутентификации <plugin-authentication.html>`__

source: `Authorization architecture <plugin-authorization-architecture.markdown>`__
ru: `Архитектура авторизации <plugin-authorization-architecture.html>`__

source: `Custom group providers <plugin-group-provider.markdown>`__
ru: `Провайдер пользовательской группы <plugin-group-provider.html>`__

source: `External link providers <plugin-external-link.markdown>`__
ru: `Провайдер внешней ссылки <plugin-external-link.html>`__

source: `Add avatar providers <plugin-avatar-provider.markdown>`__
ru: `Добавление провайдера аватара <plugin-avatar-provider.html>`__

source: `LDAP client <plugin-ldap-client.markdown>`__
ru: `Клиент LDAP <plugin-ldap-client.html>`__

source: Examples of plugins
ru: Примеры плагинов

source: `SMS Two-Factor Authentication <https://github.com/kanboard/plugin-sms-2fa>`__
ru: `Двухуровневая аутентификация SMS <https://github.com/kanboard/plugin-sms-2fa>`__

source: `Reverse-Proxy Authentication with LDAP support <https://github.com/kanboard/plugin-reverse-proxy-ldap>`__
ru: `Аутентификация Reverse-Proxy с поддержкой LDAP <https://github.com/kanboard/plugin-reverse-proxy-ldap>`__

source: `Budget planning <https://github.com/kanboard/plugin-budget>`__
ru: `Планирование бюджета <https://github.com/kanboard/plugin-budget>`__

source: `User timetables <https://github.com/kanboard/plugin-timetable>`__
ru: `Расписание пользователя <https://github.com/kanboard/plugin-timetable>`__

source: `Subtask Forecast <https://github.com/kanboard/plugin-subtask-forecast>`__
ru: `Прогнозирование подзадач <https://github.com/kanboard/plugin-subtask-forecast>`__

source: `Automatic Action example <https://github.com/kanboard/plugin-example-automatic-action>`__
ru: `Пример автоматических действий <https://github.com/kanboard/plugin-example-automatic-action>`__

source: `Theme plugin example <https://github.com/kanboard/plugin-example-theme>`__
ru: `Пример плагина темы <https://github.com/kanboard/plugin-example-theme>`__

source: `CSS plugin example <https://github.com/kanboard/plugin-example-css>`__
ru: `Пример плагина CSS <https://github.com/kanboard/plugin-example-css>`__
