Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/postgresql-configuration.po
Languages: ru

source: Postgresql configuration
ru: Настройка Postgresql

source: By default, Kanboard use Sqlite to store its data but it's also possible to use Postgresql.
ru: По умолчанию, Канборд использует для хранения данных Sqlite, но возможно использовать и Postgresql.

source: Requirements
ru: Требования

source: Postgresql server already installed and configured
ru: Установленный и настроенный сервер Postgresql

source: The PHP extension ``pdo_pgsql`` installed (Debian/Ubuntu: ``apt-get install php5-pgsql``)
ru: Установленное PHP расширение - ``pdo_pgsql`` (Debian/Ubuntu: ``apt-get install php5-pgsql``)

source: Note: Kanboard is tested with **Postgresql 9.3 and 9.4**
ru: Примечание: работа Канборда протестирована с **Postgresql 9.3 и 9.4**

source: Configuration
ru: Настройка

source: Create an empty database with the command ``pgsql``:
ru: Создайте пустую базу данных выполнив команду ``pgsql``:

source: Create a config file
ru: Создание конфигурационного файла

source: The file ``config.php`` should contain those values:
ru: Файл ``config.php`` должен содержать следующие значения:

source: Note: You can also rename the template file ``config.default.php`` to ``config.php``.
ru: Примечание: Вы можете переименовать демонстрационный файл ``config.default.php`` в ``config.php``.

source: Importing SQL dump (alternative method)
ru: Импортирование дампа SQL (альтернативный метод)

source: For the first time, Kanboard will run one by one each database migration and this process can take some time according to your configuration.
ru: В первый раз, Канборд запускает по очереди каждую миграцию базы данных и этот процес может занять некоторое время, в зависимости от вашей конфигурации.

source: To avoid any issues or potential timeouts you can initialize the database directly by importing the SQL schema:
ru: Для избежания проблем или задержек вы можете инициализировать базу данных напрямую посредством импорта схемы SQL:

source: The file ``app/Schema/Sql/postgres.sql`` is a sql dump that represents the last version of the database.
ru: Файл ``app/Schema/Sql/postgres.sql`` - это sql дамп, который представляет последнюю версию базы данных.
