Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/project-views.po
Languages: ru

source: Board, Calendar and List Views
ru: Представления Доска, Календарь, Список и Гант

source: For each project, tasks can be visualized with several views: **Board, Calendar, List and Gantt**. Each view shows the result of the filter box at the top. The search engine uses the `advanced syntax <search.markdown>`__.
ru: В каждом проекте задачи могут быть отображены в разных представлениях: **Доска, Календарь, Список и Гант**. Для отображения представлений используется фильтр в верхней части рабочей панели. Для поиска используется `расширенный синтаксис <search.html>`__.

source: Board View
ru: Представление - Доска

source: Board view
ru: Представление зачад в виде доски

source: With this view you can drag and drop tasks between columns easily.
ru: В этом представлении вы можете мышкой перемещать задачи между колонками.

source: You can also use the keyboard shortcut **"v b"** to switch to the board view.
ru: Также, для перемещения задач на доске, можно использовать горячие клавиши **"v b"**.

source: Tasks with a shadow are recently modified.
ru: Затемнения вокруг задачи показывает активную или измененную задачу.

source: Board Task Limit
ru: Лимит задач на Доске

source: When the task limit is reached for a column, the background becomes red. That means there are too many tasks in progress at the same time.
ru: Когда лимит задач для колонки достигнут, тогда фон колонки становится красный. Это означает, что слишком много задач выполняются одновременно.

source: `Learn more about board configuration <board-configuration.markdown>`__
ru: `Ознакомится с настройками Доски (нажмите ссылку) <board-configuration.html>`__

source: Calendar View
ru: Представление - Календарь

source: Calendar view
ru: Представление в виде календаря

source: With this view you can visualize tasks with a due date.
ru: В этом представлении вы можете видеть задачи на конкретные даты.

source: Depending of the settings, you can also see tasks in progress.
ru: Вы можете сделать настройки, которые позволят вам видеть задачи в работе.

source: You can also use the keyboard shortcut **"v c"** to switch to the calendar view.
ru: Вы можете использовать горячие клавиши **"v c"** для перехода на представление Календарь.

source: `Learn more about calendar configuration <calendar-configuration.markdown>`__
ru: `Ознакомится с настройками Календаря <calendar-configuration.html>`__

source: List View
ru: Представление - Список

source: List view
ru: Представление списком.

source: With this view all results of your search are displayed in a table.
ru: С помощью этого представления все результаты отображаются в виде таблицы.

source: You can also use the keyboard shortcut **"v l"** to switch to the list view.
ru: Для быстрого перехода на представление Список вы можете использовать горячие клавиши **"v l"**.

source: Gantt View
ru: Представление - Гант.

source: Gantt view
ru: Представление диаграммой Ганта.

source: The Gantt view displays tasks on a horizontal timeline
ru: Представление Гант отображает задачи горизонтальными графиками

source: The start date and the due date are used to display the chart
ru: Для построения графика используется дата начала и срок выполнения

source: For quick access, use the keyboard shortcut: **v g**
ru: Для быстрого перехода к представлению Гант используйте горячие клавиши : **"v g"**

source: Project Overview
ru: Обзор Проекта

source: Project overview
ru: Представления проекта:

source: View the description of the project
ru: Отображает описание проекта

source: Attach and upload documents to the project
ru: Показывает прикрепленные и загруженные документы проекта

source: View list of project members
ru: Показывает список участников проекта

source: View the last activities of the project
ru: Показывает последнюю активность в проекте
