Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/project-types.po
Languages: ru

source: Project Types
ru: Типы проектов

source: There are two kinds of projects:
ru: Проекты могут быть двух типов:

source: Type
ru: Тип

source: Description
ru: Описание

source: Team Project
ru: Коммандный проект

source: Project with user and group management
ru: В проекте могут принимать участие пользователи и группы

source: Private Project
ru: Приватный проект

source: Project that belongs to only one person, there is no user management
ru: Проект принадлежит только одному пользователю, к проекту нельзя присоединить участников

source: Only Administrators and Application Managers can create team projects.
ru: Коммандный проект могут создавать только пользователи с ролью Администратор и Менеджер.

source: Private projects can be created by anyone.
ru: Приватный проект могут создавать все пользователи.

source: `Read the documentation about roles in Kanboard <roles.markdown>`__
ru: `Читать документацию про роли в Kanboard <roles.html>`__
