Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/project-configuration.po
Languages: ru

source: Project Settings
ru: Настройки проекта

source: Go to the menu **Settings**, then choose **Project settings** on the left.
ru: В правом верхнем выпадающем меню выберите **Настройки**, затем выберите **Настройки проекта** слева.

source: Project settings
ru: Рисунок. Настройки проекта.

source: Default columns for new projects
ru: Колонки по умолчанию для новых проектов

source: You can change the default column names here. It's useful if you always create projects with the same columns.
ru: Вы можете изменить колонки по умолчанию. Это удобно, когда вы создаете однотипные проекты с одними и теми же колонками.

source: Each column name must be separated by a comma.
ru: Название колонок должны быть разделены запятой.

source: By default, Kanboard use those column names: Backlog, Ready, Work in progress and Done.
ru: По умолчанию, в Канборде используются следующие колонки: Ожидающие, Готовые, В процессе, Выполнено

source: Default categories for new projects
ru: Стандартные категории для новых проектов

source: Categories are not global to the application but attached to a project. Each project can have different categories.
ru: Категории не являются общими для приложения, но могут использоваться в проектах. Каждый проект может иметь разные категории.

source: However, if you always create the same categories for all your projects, you can define here the list of categories to create automatically.
ru: Однако, если вы постоянно создаете одни и теже категории для разных проектов, то вы можете задать список категорий, которые будут автоматически создаваться при создании проекта.

source: Allow only one subtask in progress at the same time for a user
ru: Разрешена только одна подзадача в разработке одновременно для одного пользователя

source: When this option is enabled, a user can work with only one subtask at the time.
ru: Когда эта опция включена, пользователь может работать только с одной подзадачей одновременно.

source: If another subtask have the status "in progress", the user will see this dialog box:
ru: Если другая подзадача перейдет статус "В процессе", то пользователь увидит следующее диалоговое окно:

source: Subtask user restriction
ru: Рисунок. Ограничение пользовательских подзадач.

source: Trigger automatically subtask time tracking
ru: Триггер автоматического отслеживания времени подзадач

source: If enabled, when a subtask status is changed to "in progress", the timer will start automatically.
ru: Если этот триггер включен когда статус подзадачи меняется на "В процессе", то таймер автоматически запускается.

source: Disable this option if you don't use time tracking.
ru: Выключите эту опцию, если вы не хотите отслеживать время.

source: Include closed tasks in the cumulative flow diagram
ru: Включить в диаграмму закрытые задачи

source: If enabled, closed tasks will be included in the cumulative flow diagram.
ru: Если эта опция включена, закрытые задачи будут добавлены в накопительную диаграмму.

source: If disabled, only open tasks will be included.
ru: Если выключена, то только открытые задачи будут подсчитаны.

source: This option affects the column "total" of the table "project\_daily\_column\_stats"
ru: Эта опция влияет на колонку "total" (всего) в таблице "project\_daily\_column\_stats" (проект\_ежедневно\_колонка\_статистика)
