Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/project-permissions.po
Languages: ru

source: Project Permissions
ru: Права доступа к проекту

source: Each project is isolated and compartmented from each other. The project access must be allowed by the project owner.
ru: Все проекты изолированы и отделены друг от друга. Доступ к проекту может назначать владелец проекта.

source: Each user and each group can have a different role assigned. There are 3 types of `roles for projects <roles.markdown>`__:
ru: Каждый пользователь и каждая группа могут иметь разные назначенные роли. Имеются `три типа ролей для проектов <roles.html>`__:

source: Project Manager
ru: Менеджер проекта

source: Project Member
ru: Участник проекта

source: Project Viewer
ru: Наблюдатель проекта

source: Only administrators have access to everything.
ru: Только администратор может иметь полный доступ ко всему.

source: Roles assignation is available from **Project Settings > Permissions**:
ru: Назначение ролей доступно через **Меню -> Настройки -> Разрешения**

source: If you choose to allow everybody, all Kanboard users will be considered Project Member. That also means there is no role management anymore. Permission per user or per group cannot be applied.
ru: Если вы выберите **Разрешить любому**, то все пользователи Канборд будут считаться участниками Проекта. В таком случае, нет необходимости назначать роли. Потому что, разрешения, назначенные пользователям и группам, на доступ к Проекту не будут работать.

source: Private projects cannot define permission.
ru: Приватный проект не позволяет устанавливать разрешения.
