Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/recurring-tasks.po
Languages: ru

source: Recurring tasks
ru: Повторяющиеся задачи

source: To fit with the Kanban methodology, the recurring tasks are not based on a date but on board events.
ru: Для соответсвия методологии Канбан, повторяющиеся задачи не имеют в качестве основы дату, а запускаются при наступлении событий на Доске.

source: Recurring tasks are duplicated to the first column of the board when the selected events occur
ru: Повторяющиеся задачи копируются (появляются вновь) в первой колонке Доски когда наступает определенное событие

source: The due date can be recalculated automatically
ru: Дата завершения (срок выполнения задачи) пересчитывается автоматически

source: Configuration
ru: Настройка

source: Go to the task view page or use the drop-down menu on the board, then select **Edit recurrence**.
ru: Перейдите на страницу детального представления задачи или используйте выпадающее меню на доске, выберите **Редактировать повторы**.

source: Recurring task
ru: Рисунок. Редактировать повторы.

source: There are 3 triggers that currently create a new recurring task:
ru: В редактировании повторов имеется выбор 3 триггеров для генерации периодической задачи:

source: Moving a task from the first column
ru: Когда задача перемещается из первой колонки

source: Moving a task to the last column
ru: Когда задача перемещается в последнюю колонку

source: Closing the task
ru: Когда задача закрывается

source: Due dates, if set on the current task, can be recalculated by a given factor of days, months or years. The base date for the calculation of the new due date can be either the existing due date, or the action date.
ru: Дата завершения, если установлена для текущей задачи, может быть пересчитана с учетом **Коэффициента для расчета новой даты** и **Период для рассчета новой даты завершения** (например, 7 дней, 6 месяцев, 1 год). Базовой датой вычисления новой даты завершения может быть и имеющаяся дата завершения, или дата действия.
