Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/requirements.po
Languages: ru

source: Requirements
ru: Системные требования

source: Server side
ru: На сервере

source: Compatible Operating Systems
ru: Поддерживаемые операционные системы

source: \| Operating System \| \|--------------------------------------\| \| Linux Ubuntu Xenial Xerus 16.04 LTS \| \| Linux Ubuntu Trusty 14.04 LTS \| \| Linux Centos 6.x \| \| Linux Centos 7.x \| \| Linux Redhat 6.x \| \| Linux Redhat 7.x \| \| Linux Debian 8 \| \| FreeBSD 10.x \| \| Microsoft Windows 2012 R2 \| \| Microsoft Windows 2008 \|
ru: Linux Ubuntu Xenial Xerus 16.04 LTS, Linux Ubuntu Trusty 14.04 LTS, Linux Centos 6.x, Linux Centos 7.x, Linux Redhat 6.x, Linux Redhat 7.x, Linux Debian 8, FreeBSD 10.x, Microsoft Windows 2012 R2, Microsoft Windows 2008

source: Compatible Databases
ru: Поддерживаемые базы данных

source: \| Database \| \|--------------------\| \| Sqlite 3.x \| \| Mysql >= 5.5 \| \| MariaDB >= 10 \| \| Postgresql >= 9.3 \|
ru: Sqlite 3.x, Mysql >= 5.5, MariaDB >= 10, Postgresql >= 9.3

source: Which database to choose?
ru: Какую базу данных выбрать?

source: Type
ru: Тип

source: Usage
ru: Когда использовать

source: Single user or small team (almost no concurrency)
ru: Один пользователь или небольшая команда

source: Larger team, high-availability configuration
ru: Большая команда, конфигурация высокой доступности

source: Do not use Sqlite on NFS mounts, use Sqlite only when you have a disk with fast I/O
ru: Не используйте Sqlite на смонтированном NFS. Используйте Sqlite только на дисках с высокой скоростью чтение/запись.

source: Compatible Web Servers
ru: Совместимые веб сервера

source: \| Web Server \| \|--------------------\| \| Apache HTTP Server \| \| Nginx \| \| Microsoft IIS \|
ru: Apache HTTP Server, Nginx , Microsoft IIS

source: Kanboard is pre-configured to work with Apache (URL rewriting).
ru: Канборд изначально сконфигурирован для работы с Apache (URL rewriting).

source: PHP Versions
ru: Версии PHP

source: \| PHP Version \| \|----------------\| \| PHP >= 5.3.3 \| \| PHP 5.4 \| \| PHP 5.5 \| \| PHP 5.6 \| \| PHP 7.x \|
ru: PHP >= 5.3.3, PHP 5.4, PHP 5.5, PHP 5.6, PHP 7.x

source: PHP Extensions Required
ru: Требуемые расширения для PHP

source: PHP Extensions required
ru: Требуемые расширения для PHP

source: Note
ru: Примечание

source: Only if you use Sqlite
ru: Только при использовании Sqlite

source: Only if you use Mysql/MariaDB
ru: Только при использоании Mysql/MariaDB

source: Only if you use Postgres
ru: Только при использовании Postgres

source: Only for LDAP authentication
ru: Только для аутентификации LDAP

source: Recommended
ru: Рекомендуется

source: Recommendations
ru: Рекомендуется

source: Modern Linux or Unix operating system.
ru: Современная Linux или Unix операционная система.

source: Best performances are obtained with the latest version of PHP with OPcode caching activated.
ru: Высокая производительность достигается с последней версией PHP со включенным кешированием OPcode.

source: Client side
ru: На клиенте

source: Browsers
ru: Браузеры

source: Always use a modern browser with the latest version if possible:
ru: Используйте современные браузеры, обновленные до последней версии:

source: \| Browser \| \|---------------------------------------\| \| Safari \| \| Google Chrome \| \| Mozilla Firefox \| \| Microsoft Internet Explorer >= 11 \| \| Microsoft Edge \|
ru: Safari, Google Chrome, Mozilla Firefox, Microsoft Internet Explorer >= 11, Microsoft Edge

source: Devices
ru: Устройства

source: Device
ru: Устройство

source: Screen resolution
ru: Разрешение экрана

source: Laptop or desktop
ru: Персональный компьютер или ноутбук

source: Tablet
ru: Планшет

source: Kanboard is not yet optimized for smartphones. It's working but the user interface is not really convenient to use.
ru: Канборд, пока, не оптимизирован для работы на смартфонах. Конечно, он работает, но пользовательский интерфейс не совсем удобный для использования.
