Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/reverse-proxy-authentication.po
Languages: ru

source: Reverse Proxy Authentication
ru: Аутентификация Reverse Proxy

source: This authentication method is often used for `SSO <http://en.wikipedia.org/wiki/Single_sign-on>`__ (Single Sign-On) especially for large organizations.
ru: Этот метод аутентификации часто используется для `SSO <https://ru.wikipedia.org/wiki/%D0%A2%D0%B5%D1%85%D0%BD%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8%D1%8F_%D0%B5%D0%B4%D0%B8%D0%BD%D0%BE%D0%B3%D0%BE_%D0%B2%D1%85%D0%BE%D0%B4%D0%B0>`__ (Технология единого входа), особенно удобно в больших организациях.

source: The authentication is done by another system, Kanboard doesn't know your password and suppose you are already authenticated.
ru: Аутентификация выполняется с помощью другой системы, поэтому Канборд не знает вашего пароля и допускает вас к приложению, так как вы уже прошли аутентификацию.

source: Requirements
ru: Требования

source: A well-configured reverse proxy
ru: Правильно сконфигурированный reverse proxy

source: or
ru: или

source: Apache Auth on the same server
ru: Apache Auth на том же сервере

source: How does this work?
ru: Как это работает?

source: Your reverse proxy authenticates the user and send the username through a HTTP header.
ru: Ваш reverse proxy аутентифицирует пользователя и посылает имя пользователя через заголовок HTTP.

source: Kanboard retrieve the username from the request
ru: Канборд извлекает имя пользователя из запроса

source: The user is created automatically if necessary
ru: Пользователь создается в Канборд автоматически (опция настраивается)

source: Open a new Kanboard session without any prompt assuming it's valid
ru: Открывается новая сессия Канборд (дополнительная аутентификация в Канборд не нужна)

source: Installation instructions
ru: Инструкция по установке

source: Setting up your reverse proxy
ru: Настройка вашего reverse proxy

source: This is not in the scope of this documentation. You should check the user login is sent by the reverse proxy using a HTTP header, and find out which one.
ru: В рамках данной документации не рассматривается установка и настройка reverse proxy. Вы должны убедится, что логин пользователя отправляется с reverse proxy в заголовке HTTP.

source: Setting up Kanboard
ru: Настройки Канборда

source: Create a custom ``config.php`` file or copy the ``config.default.php`` file:
ru: Создайте свой файл конфигурации ``config.php`` или скопируйте конфигурацию из файла ``config.default.php``:

source: Notes:
ru: Примечание:

source: If the proxy is the same web server that runs Kanboard, according the `CGI protocol <http://www.ietf.org/rfc/rfc3875>`__ the header name will be ``REMOTE_USER``. By example, Apache add ``REMOTE_USER`` by default if ``Require valid-user`` is set.
ru: Если proxy находится на том же сервере, что и Канборд, то в соответствии с протоколом <http://www.ietf.org/rfc/rfc3875>`__ имя заголовка будет ``REMOTE_USER``. Например, Apache добавляет ``REMOTE_USER`` по умолчанию, если установлено ``Require valid-user``.

source: If Apache is a reverse proxy to another Apache running Kanboard, the header ``REMOTE_USER`` is not set (same behavior with IIS and Nginx).
ru: Если Apache служит reverse proxy для другого Apache выполняющего Канборд, то заголовок ``REMOTE_USER`` не установлен (это же относится к IIS и Nginx).

source: If you have a real reverse proxy, the `HTTP ICAP draft <http://tools.ietf.org/html/draft-stecher-icap-subid-00#section-3.4>`__ proposes the header to be ``X-Authenticated-User``. This de facto standard has been adopted by a number of tools.
ru: Если у вас имеется действующий reverse proxy, то `проект HTTP ICAP <http://tools.ietf.org/html/draft-stecher-icap-subid-00#section-3.4>`__ предпологает, что заголовок должен быть ``X-Authenticated-User``. Этот стандарт де-факто был принят разными инструментами.
