Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/roles.po
Languages: ru

source: User Roles
ru: Пользовательские роли

source: Application Roles
ru: Роли в приложениях

source: Each Kanboard user has one of these roles:
ru: Каждый пользователь системы Канборд имеет одну из этих ролей

source: Role
ru: Роль

source: Description
ru: Описание

source: Administrator
ru: Администратор

source: Access to everything
ru: Имеет доступ ко всему

source: Manager
ru: Менеджер

source: Can create team projects but cannot change application settings
ru: Может создавать командные проекты, но не может изменять настройки приложения

source: User
ru: Пользователь

source: Can create private projects only
ru: Может создавать только приватные проекты

source: Project Roles
ru: Роли в проектах

source: Each individual team project can assign a different role to each user and group:
ru: В каждом командном проекте могут быть назначены разные роли для пользователей и групп:

source: Project Manager
ru: Менеджер проекта

source: Can change project settings, access to the Gantt chart and reports
ru: Может изменять настройки проекта, имеет доступ к диаграмме Ганта и отчетам

source: Project Member
ru: Участник проекта

source: Can create tasks and use the board
ru: Может создавать задачи и пользоваться доской

source: Project Viewer
ru: Наблюдатель проекта

source: Read-only access to the board and tasks
ru: Имеет доступ к доске и задачам только на просмотр (чтение)
