Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/rss.po
Languages: ru

source: RSS/Atom subscriptions
ru: RSS/Atom подписки

source: Kanboard supports RSS feeds for projects and users.
ru: Канборд поддерживает RSS ленты для проектов и пользователей.

source: Project feeds contains only the activity the project
ru: RSS/Atom лента для проекта - содержит только активность в проекте

source: User feeds contains the activity stream of all projects the user is a member
ru: RSS/Atom лента пользователя - содержит поток активности пользователя во всех проектах, в которых пользователь является участником

source: Those subscriptions are only activated when the public access is enabled in the user profile or in the project settings.
ru: Эти подписки доступны только при включенном общем доступе в пользовательском профиле или в настройках проекта.

source: Enable/disable project RSS feeds
ru: Включение/выключение RSS ленты проекта

source: Go to **Project settings > Public access**.
ru: Перейдите в **Настройки проекта** -> **Общий доступ**

source: Disable public access
ru: Рисунок. Выключение общего доступа.

source: Enable/disable user RSS feeds
ru: Включение/выключение RSS ленты пользователя

source: Go to **User profile > Public access**.
ru: Перейдите в **Мой профиль** -> **Общий доступ**

source: The RSS link is protected by a random token, only people who know the URL can access to the feed.
ru: Ссылка на RSS ленту защищена случайным ключом, только пользователи, которые знают URL ссылку, могут иметь доступ к ленте.
