Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/screenshots.po
Languages: ru

source: Adding screenshots
ru: Добавление снимков экрана (скриншота)

source: You can copy and paste images directly in Kanboard to save time. These images are uploaded as attachments to the task.
ru: Для экономии времени вы можете копировать и вставлять изображения прямо в Канборде. Загруженные изображения прикрепляются к задаче.

source: This is especially useful for taking screenshots to describe an issue for example.
ru: Например, очень удобно для решения проблемы прикрепить снимок экрана.

source: You can add screenshots directly from the board by clicking on the dropdown menu or in the task view page.
ru: Вы можете добавить снимок экрана прямо из Доски нажав на выпадающее меню задачи и выбрав **Прикрепить картинку** или на странице детального просмотра задачи.

source: Drop-down screenshot menu
ru: Рисунок. Выпадающее меню задачи - **Прикрепить картинку**.

source: To add a new image, take your screenshot and paste with CTRL+V or Command+V:
ru: Для добавления нового снимка экрана (скриншота), сделайте снимок экрана (нажмите клавиши Ctrl+PrtScn) и вставьте его используя сочетания клавиш CTRL+V или Command+V

source: Screenshot page
ru: Рисунок. Прикрепить картинку.

source: On Mac OS X, you can use those shortcuts to take screenshots:
ru: В Mac OS X вы можете использовать следующие горячие клавиши для создания снимка экрана:

source: Command-Control-Shift-3: Take a screenshot of the screen, and save it to the clipboard
ru: Command-Control-Shift-3: Делает снимок экрана и сохраняет его в буфер обмена

source: Command-Control-Shift-4, then select an area: Take a screenshot of the area and save it to the clipboard
ru: Command-Control-Shift-4 и выделите необходимую область на экране: Делает снимок экрана для области экрана и сохраняет ее в буфер обмена

source: Command-Control-Shift-4, then space, then click a window: Take a screenshot of a window and save it to the clipboard
ru: Command-Control-Shift-4, затем пробел, затем нажать на окно: Делает снимок окна и сохраняет его в буфер обмена

source: There are also several third-party applications that can be used to take screenshots with annotations and shapes.
ru: Имеется много разных других программ для создания снимков с экрана с примечаниями и разными формами.

source: **Note: This feature doesn't work with all browsers.** It doesn't work with Safari due to this bug: https://bugs.webkit.org/show\_bug.cgi?id=49141
ru: **Заметка**: Эта возможность работает не во всех браузерах. Например не работет в Safari из-за этой ошибки: https://bugs.webkit.org/show\_bug.cgi?id=49141
