Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/sharing-projects.po
Languages: ru

source: Sharing boards and tasks
ru: Публичные доски и задачи

source: By default, boards are private but it's possible to make a board public.
ru: По умолчанию, Доска имеет приватный доступ, но имеется возможность сделать Доску публичной.

source: A public board **cannot be modified, it's a read-only access**. This access is protected by a random token, only people who have the right URL can see the board.
ru: Публичная доска **не может быть изменена (имеется только доступ на чтение)**. Доступ к доске защищен случайно сгенерированным ключом, только пользователи знающие правильный URL могут увидеть публичную Доску.

source: Public boards are automatically refreshed every 60 seconds. Task details are also available in read-only.
ru: Публичная Доска автоматически обновляется каждые 60 секунд. Детали задач, также, доступны только для чтения.

source: Usage examples:
ru: Пример использования:

source: Share your board with someone outside of your organization
ru: Публикация вашей Доски для кого-либо снаружи (работник из другой организации)

source: Display the board on a large screen in your office
ru: Отображение Доски на большом экране в вашем офисе

source: Enable public access
ru: Включение общего доступа

source: Select your project, then click on "Public access" and finally click on the button "Enable public access".
ru: Выберете ваш проект, затем нажмите на ссылку **"Общий доступ"** и в завершении нажмите на кнопку **"Включить общий доступ"**

source: When the public access is enabled, a couple of links are generated:
ru: Когда общий доступ к проекту включен, сгенерируется несколько ссылок:

source: Public board view
ru: Ссылка для просмотра

source: RSS feed subscription link
ru: RSS лента

source: iCalendar subscription link
ru: iCalendar данные

source: Disable public access
ru: Рисунок. Отключить общий доступ.

source: You can also disable the public access whenever you want.
ru: Вы можете выключить общий доступ к проекту в любой момент.

source: Each time, you enable or disable the public access a new random token is generated. **The previous links will not work anymore**.
ru: Каждый раз, когда вы включаете или выключаете общий доступ, генерируется новый ключ. **Доступ по предыдущей ссылке будет невозможен**.
