Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/sqlite-database.po
Languages: ru

source: Sqlite database management
ru: Настройка базы данных Sqlite

source: Kanboard uses Sqlite by default to store its data. All tasks, projects and users are stored inside this database.
ru: Канборд использует для хранения данных Sqlite по умолчанию. Все задачи, проекты и учетные записи пользователей храняться в этой базе данных.

source: Technically, the database is just a single file located inside the directory ``data`` and named ``db.sqlite``.
ru: База данных Sqlite хранит данные в файле ``db.sqlite`` в директории ``data``.

source: Export/Backup
ru: Экспорт/Резервное копирование

source: Command line
ru: Командная строка

source: Doing a backup is very easy, just copy the file ``data/db.sqlite`` somewhere else when nobody use the software.
ru: Создание резервных копий выполняется просто, надо скопировать файл ``data/db.sqlite`` туда, где у вас будут хранится резервные копии.

source: User interface
ru: Пользовательский интерфейс

source: You can also download at any time the database directly from the **settings** menu.
ru: Также, в любое время, вы можете скачать базу данных прямо через меню **Настройки**.

source: The downloaded database is compressed with Gzip, the filename becomes ``db.sqlite.gz``.
ru: Выгружаемая база данных упакована с помощью Gzip и имя базы выглядитит как ``db.sqlite.gz``.

source: Import/Restoration
ru: Импорт/Восстановление

source: There is actually no way to restore the database from the user interface. The restoration must be done manually when no body use the software.
ru: Загрузить базу данных через пользовательский интерфейс невозможно. Восстановление должно быть выполнено вручную, когда никто не работает с программой.

source: To restore an old backup, just replace and overwrite the actual file ``data/db.sqlite``.
ru: Для восстановления резервной копии, достаточно заменить рабочий файл ``data/db.sqlite``.

source: To uncompress a gzipped database, execute this command from a terminal ``gunzip db.sqlite.gz``.
ru: Для разархивирования базы данных упакованной с помощью gzip, выполните следующую команду в терминале: ``gunzip db.sqlite.gz``.

source: Optimization
ru: Оптимизация

source: Occasionally, it's possible to optimize the database file by running the command ``VACUUM``. This command rebuild the entire database and can be used for several reasons:
ru: Время от времени, рекомендуется оптимизировать базу данных выполнив команду ``VACUUM``. Эта команда пересоздает всю базу данных и используется в следующих случаях:

source: Reduce the file size, deleting data produce empty space but doesn't change the file size.
ru: Для уменьшения размера файла базы данных. В процессе работы пользователей, после удаления записей, в базе данных остается пустое пространство и, соответственно, размер файла базы данных остается прежним.

source: The database is fragmented due to frequent inserts or updates.
ru: Дефрагментация, база данных фрагментирована выполнением частыми вставками или обновлениями.

source: From the command line
ru: Выполнение оптимизации в командной строке

source: From the user interface
ru: Выполнение оптимизации через пользовательский интерфейс

source: Go to the menu **settings** and click on the link **Optimize the database**.
ru: Перейдите в правое выпадающее меню **Настройки** и нажмите на ссылку **Оптимизировать базу данных**

source: For more information, read the `Sqlite documentation <https://sqlite.org/lang_vacuum.html>`__.
ru: Для дополнительной информации, изучите `документацию Sqlite <https://sqlite.org/lang_vacuum.html>`__.
