Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/subtasks.po
Languages: ru

source: Subtasks
ru: Подзадачи

source: Subtasks are useful to split the work of a task.
ru: Подзадачи - это прекрасная возможность разделить основную задачу на части.

source: Each subtask:
ru: Каждая подзадача:

source: Can be assigned to a project member
ru: Может быть назначена участнику проекта

source: Have 3 different statuses: **Todo**, **In progress**, **Done**
ru: Имеет 3 разных статуса: **Для исполнения**, **В работе**, **Выполнено**

source: Have time tracking information: **time spent** and **time estimated**
ru: Имеет информацию по отслеживанию времени: **затраченное время** и **запланированное время**

source: Be ordered by position
ru: Может быть перемещена в списке, для изменения порядка выполнения

source: Creating subtasks
ru: Создание подзадачи

source: From the task view, on left sidebar click on **Add a subtask**:
ru: В детальном представлении задачи, в левой боковой панели нажмите **Добавить подзадачу**:

source: Add a subtask
ru: Рисунок. Добавление подзадачи.

source: You can also add a subtask quickly by entering only the title:
ru: Вы, также, можете быстро добавить подзадачу нажав на заголовок:

source: Add a subtask from the task view
ru: Рисунок. Добавление подзадачи на странице детального просмотра задачи.

source: Change subtask status
ru: Изменение статуса подзадачи

source: When you click on the subtask title the status change:
ru: Когда вы нажимаете на заголовок подзадачи стату меняется:

source: Subtask in progress
ru: Рисунок. Выполнение подзадачи.

source: The icon before the title is updated according to the status.
ru: Иконка перед названием подзадачи обновляется в соответсвии со статусом.

source: Subtask done
ru: Рисунок. Подзадача выполнена.

source: Note: When the task is closed, all subtasks are changed to the status **Done**.
ru: **Заметка**: Когда задача закрыта, то все подзадачи меняют статус на **Выполнена**.

source: Subtask timer
ru: Таймер подзадачи

source: Each time a subtask is in progress, the timer is also started. The timer can be started and stopped at any time.
ru: Когда подзадача выполняется, таймер должен быт запущен. Таймер можно запустить и остановить в любое время.

source: The timer records the time spent on the subtask automatically. You can also change manually the value of the time spent field when you edit a subtask.
ru: Время таймера записывается автоматически в затраченное время. Так же, вы можете изменить вручную значение **затраченного времени** при редактировании подзадачи.

source: The time calculated is rounded to the nearest quarter. This information is recorded in a separate table.
ru: Подсчитываемое время округляется до 15 минут. Эта информация записывается в отдельную таблицу.

source: The task time spent and time estimated is updated automatically according to the sum of all subtasks.
ru: Время, затраченное на выполнение задачи, и запланированнное время обновляется автоматически, в соответсвии с суммой всех подзадач.
