Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/swimlanes.po
Languages: ru

source: Swimlanes
ru: Дорожки

source: Swimlanes are horizontal separations in your board. For example, it's useful to separate software releases, divide your tasks in different products, teams or whatever you want.
ru: Дорожки - это горизонтальное разделение вашей Доски. Например, очень удобно разделять релизы программ, разделить ваши задачи для разных продуктов, команд или чего-то еще.

source: Board with swimlanes
ru: Доска с дорожками

source: You can collapse swimlanes by clicking on the icon on the left
ru: Вы можете свернуть дорожку нажав на иконку слева

source: The default swimlane is always shown at the top
ru: "Стандатная дорожка" всегда расположена сверху

source: Managing swimlanes
ru: Управление дорожками

source: All projects have a default swimlane.
ru: Все проекты имеют дорожку по умолчанию - **Стандартная дорожка**

source: If there is more than one swimlane, the board will show all swimlanes.
ru: Если имеется больше одной дорожки, то на Доске будут показаны все имеющиеся дорожки.

source: You can drag and drop tasks between swimlanes.
ru: Вы можете перемещать мышкой задачи между дорожками.

source: To configure swimlanes go to the **project configuration page** and choose the section **Swimlanes**.
ru: Для настройки дорожек перейдите на страницу **настройки проекта** (Меню -> Настройки) и нажмите **Дорожки** (слева).

source: Swimlanes Configuration
ru: Рисунок. Настройка Дорожек.

source: From there, you can add a new swimlane or rename the default one. You can also disable and change the position of the different swimlanes.
ru: Теперь вы можете добавить новую дорожку или переименовать стандартную дорожку. Также, вы можете выключить дорожку или изменить расположение любой дорожки.

source: The default swimlane is always on the top but you can hide it.
ru: Стандартная дорожка всегда расположена сверху, но вы можете ее выключить и она не будет отображаться на Доске.

source: Inactive swimlanes are not shown on the board.
ru: Выключенные дорожки не отображаются на Доске.

source: **Removing a swimlane doesn't remove tasks assigned to it**, those tasks will be moved to the default swimlane.
ru: **Удаление дорожки не влечет за собой удаление расположенных на этой дорожке задач**, эти задачи будут перемещены в "Стандартную дорожку".
