Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/syntax-guide.po
Languages: ru

source: Syntax Guide
ru: Руководство по синтаксису

source: Kanboard use the `Markdown syntax <http://en.wikipedia.org/wiki/Markdown>`__ for comments or task descriptions. Here are some examples:
ru: Канборд использует `Markdown синтаксис <https://ru.wikipedia.org/wiki/Markdown>`__ для комментариев или описания задач. Далее приведены примеры:

source: Bold and italic
ru: Жирный и курсив

source: Bold text: Use 2 asterisks or 2 underscores
ru: Жирный текст: Используйте 2 звездочки или 2 подчеркивания вокруг слов(а)

source: Italic text: Use 1 asterisk or 1 underscore
ru: Курсив: Используйте 1 звездочку или 1 подчеркивание вокруг слов(а)

source: Source
ru: Пример написания (источник)

source: Result
ru: Результат

source: Unordered Lists
ru: Неупорядоченные списки

source: Unordered list can use asterisks, minuses or pluses.
ru: Неупорядоченный список использует звездочки, минусы или плюсы вначале абзаца

source: Ordered lists
ru: Упорядоченные списки

source: Ordered lists are prefixed by a number like that:
ru: Упорядоченные списки префиксом имеют цифру:

source: Links
ru: Ссылки

source: Source code
ru: Исходный код

source: Inline code
ru: Код встраиваемый в текст

source: Use a backtick.
ru: Используйте обратные кавычки (переключитесь на анлийскую раскладку и нажмите `ё`)

source: Code blocks
ru: Блоки кода

source: Use 3 backticks with eventually the language name.
ru: Используйте 3 обратных кавычки с указанием языка программирования

source: Titles
ru: Заголовки
