Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/task-links.po
Languages: ru

source: Task Links
ru: Ссылки на задачи

source: Tasks can be linked together with pre-defined relationships:
ru: Задачи могут быть созданы вместе с предопределенными связями:

source: The default relationships are:
ru: Связи по умолчанию:

source: **relates to**
ru: **относится к**

source: **blocks** \| is blocked by
ru: **блокирована**\| блокирует

source: **is blocked by** \| blocks
ru: **блокирует** \| блокирована

source: **duplicates** \| is duplicated by
ru: **дублирована** \| дублирует

source: **is duplicated by** \| duplicates
ru: **дублирует** \| дублирована

source: **is a child of** \| is a parent of
ru: **является продолжением** \| является началом для

source: **is a parent of** \| is a child of
ru: **является началом для** \| является продолжением

source: **targets milestone** \| is a milestone of
ru: **часть вехи** \| является вехой для

source: **is a milestone of** \| targets milestone
ru: **является вехой для** \| часть вехи

source: **fixes** \| is fixed by
ru: **исправлено** \| исправляет

source: **is fixed by** \| fixes
ru: **исправляет** \| исправлено

source: Those labels can be changed in the application settings.
ru: Эти названия могут быть быть изменены в настройках приложения.
