Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/tests.po
Languages: ru

source: Automated tests
ru: Автоматизированные тесты

source: `PHPUnit <https://phpunit.de/>`__ is used to run automated tests on Kanboard.
ru: `PHPUnit <https://phpunit.de/>`__ используется для запуска автоматизированных тестов в Канборд.

source: You can run tests across different databases (Sqlite, Mysql and Postgresql) to be sure that the result is the same everywhere.
ru: Вы можете запускать тесты для разных баз данных (Sqlite, Mysql and Postgresql), чтобы убедится, что результаты будут одинаковые.

source: Requirements
ru: Требования

source: Linux/Unix machine
ru: Компьютер Linux/Unix

source: PHPUnit installed
ru: Установленный PHPUnit

source: Mysql and Postgresql (optional)
ru: Mysql и Postgresql (опционально)

source: Unit Tests
ru: Unit тесты

source: Test with Sqlite
ru: Тестирование с Sqlite

source: Sqlite tests use a in-memory database, nothing is written on the file system.
ru: Sqlite тестирование использует базу данных в памяти, без использования записи на файловую систему.

source: The PHPUnit config file is ``tests/units.sqlite.xml``. From your Kanboard directory, run the command ``phpunit -c tests/units.sqlite.xml``.
ru: Конфигурационный файл PHPUnit - ``tests/units.sqlite.xml``. Из директории Kanboard запустите команду ``phpunit -c tests/units.sqlite.xml``.

source: Example:
ru: Пример:

source: Test with Mysql
ru: Тестирование с Mysql

source: You must have Mysql or MariaDb installed on localhost.
ru: У вас должна быть локально установлена база данных Mysql или MariaDb.

source: By default, those credentials are used:
ru: По умолчанию, используются следующие учетные данные:

source: For each execution the database is dropped and created again.
ru: При каждом выполнении база данных удаляется и создается снова.

source: The PHPUnit config file is ``tests/units.mysql.xml``. From your Kanboard directory, run the command ``phpunit -c tests/units.mysql.xml``.
ru: Конфигурационный файл HPUnit - ``tests/units.mysql.xml``. Из директории Kanboard запустите команду ``phpunit -c tests/units.mysql.xml``.

source: Test with Postgresql
ru: Тестирование с Postgresql

source: You must have Postgresql installed on localhost.
ru: У вас должен быть локально установлен Postgresql.

source: Be sure to allow the user ``postgres`` to create and drop databases. The database is recreated for each execution.
ru: Убедитесь, что пользователь ``postgres`` может создавать и удалять базу данных. База данных пересоздается при каждом выполнении теста.

source: The PHPUnit config file is ``tests/units.postgres.xml``. From your Kanboard directory, run the command ``phpunit -c tests/units.postgres.xml``.
ru: Конфигурационных файл PHPUnit - ``tests/units.postgres.xml``. Из директории Kanboard, запустите команду ``phpunit -c tests/units.postgres.xml``.

source: Integration Tests
ru: Тесты интеграции

source: Actually only the API calls are tested.
ru: Фактически тестируются только вызовы API.

source: Real HTTP calls are made with those tests. So a local instance of Kanboard is necessary and must listen on ``http://localhost:8000/``.
ru: Реальные HTTP calls выполняются с этими тестами. Поэтому, необходим локальный экземпляр Канборда, который слушает на ``http://localhost:8000/``.

source: All data will be removed/altered by the test suite. Moreover the script will reset and set a new API key.
ru: Все данные будут удалены/изменены при тестировании. Более того скрипт будет сброшен и установлен новый ключ API.

source: Start a local instance of Kanboard ``php -S 127.0.0.1:8000``
ru: Запустите локольный экземпляр Канборда: ``php -S 127.0.0.1:8000``

source: Run the test suite from another terminal
ru: Запустите тест в другом терминале

source: The same method as above is used to run tests across different databases:
ru: Этот же метод используется для запуска тестов для разных баз данных:

source: Continuous Integration with Travis-CI
ru: Непрерывная интеграция с Travis-CI

source: After each commit pushed on the main repository, unit tests are executed across 5 different versions of PHP:
ru: После каждого commit влитого в мой репозиторий, юнит тесты выполняются для 5 различных версий PHP:

source: Each version of PHP is tested against the 3 supported database: Sqlite, Mysql and Postgresql.
ru: При тестировании каждой версии PHP используются 3 поддерживаемые базы данных: Sqlite, Mysql and Postgresql.

source: The Travis config file ``.travis.yml`` is located on the root directory of Kanboard.
ru: Конфигурационный файл Travis - ``.travis.yml`` - находится в корневой директории Kanboard.
