Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/time-tracking.po
Languages: ru

source: Time Tracking
ru: Отслеживание времени

source: Time tracking information can be defined at the task level or at the subtask level.
ru: Отслеживание времени (контроль времени) может быть использовано для уровня задач или для уровня подзадач.

source: Task time tracking
ru: Отслеживание времени испольнения задач

source: Tasks have two fields:
ru: Задачи имеют два поля:

source: Time estimated
ru: Запланировано времени

source: Time spent
ru: Затрачено времени

source: These values represent hours of work and have to be set manually.
ru: Эти значения показывают время работы и могут быть установлены вручную

source: Subtask time tracking
ru: Отслеживание времени подзадач

source: Subtasks also have the fields "time spent" and "time estimated".
ru: Подзадачи тоже имеют поля "Запланировано" и "Затрачено" время.

source: When you change the value of these fields, **the task time tracking values are updated automatically and becomes the sum of all subtask values**.
ru: Когда вы меняете значения в этих полях, **отслеживание времени задачи обновляется автоматически и формируется суммарное время всех подзадач**

source: Kanboard records the time between each subtask status change in a separate table.
ru: Канборд записывает время между изменениями статуса каждой подзадачи в отдельную таблицу.

source: Changing subtask status from **todo** to **in pogress** logs the start time
ru: При изменении статуса подзадачи с **"Для испольнения"** на **"В работе"**, записывается время начала

source: Changing subtask status from **in progress** to **done** logs the end time but also update the time spent of the subtask and the task
ru: При изменении статуса подзадачи с **"В работе"** на **"Выполнено"**, записывается как время окончания и, при этом, обновляется **затраченное время** в подзадаче и в задаче.

source: The breakdown of all records is visible in the task view page:
ru: Анализ всех записей можно увидеть на странице детального просмотра задачи:

source: Task timesheet
ru: Рисунок. Таблица учета времени.

source: For each subtask, the timer can be stopped/started at any time:
ru: Для каждой подзадачи, таймер может быть остановлен и запущен в любое время:

source: Subtask timer
ru: Рисунок. Таймер подзадач.

source: The timer doesn't depend of the subtask status
ru: Таймер не зависит от статуса подзадачи

source: Each time you start the timer a new record is created in the time tracking table
ru: Вы можете запустить таймер для новой записи, созданной в таблице отслеживания задач, в любое время

source: Each time you stop the clock the end date is recorded in the time tracking table
ru: Вы можете остановить учет времени даты завершения в таблице отслеживания задач, в любое время

source: The calculated time spent is rounded to the nearest quarter
ru: Подсчет затраченного времени округляется до четверти часа
