Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/transitions.po
Languages: ru

source: Task transitions
ru: Перемещения задач

source: Transitions record each movement of the tasks between columns.
ru: Запись о перемещении отражает каждое движение задачи между колонками.

source: Transitions
ru: Рисунок. Перемещения.

source: Available from the task view, you can see that information:
ru: Перемещение доступно в боковом меню в детальном представлении задачи (**Перемещения**). Вы можете увидеть следующую информацию:

source: Date of the action
ru: Дата, когда было выполенено перемещение

source: Source column
ru: Исходная колонка - колонка, из которой было сделано перемещение

source: Destination column
ru: Колонка назначения - колонка, в которую была перемещена задача

source: Executor (users that moves the task)
ru: Исполнитель (пользователь, который переместил задачу)

source: Time spent in the origin column
ru: Время проведенное в колонке (сколько времени было затрачено на выполнение задачи в указанной колонке)

source: Task transition data can also be exported from the project settings page.
ru: Данные о перемещении задач, также, могут быть экспортированы со страницы настроек проекта (**Меню** -> **Экспорт**).

source: Transitions Export
ru: Рисунок. Экспорт перемещений задач.

source: For the specified time range you will generate a CSV file that you can use with any spreadsheet software.
ru: Для указанного промежутка времени вы можете сформировать CSV файл, который вы можете импортировать в любое программное обеспечение с электронными таблицами (например, Excell).
