Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/translations.po
Languages: ru

source: Translations
ru: Переводы на другие языки (локализация)

source: How to translate Kanboard to a new language?
ru: Как перевести Канборд на новый язык?

source: Translations are stored inside the directory ``app/Locale``
ru: Переводы хранятся в директории ``app/Locale``

source: There is a subdirectory for each language, for example in French we have ``fr_FR``, Italian ``it_IT`` etc.
ru: В этой директории есть поддиректории для разных языков, например, для русского имеется ``ru_RU``, для французского - ``fr_FR`` и т.д.

source: A translation is a PHP file that returns an Array with a key-value pairs
ru: Переводы находятся в PHP файле, который возвращает массив с парой ключ-значение

source: The key is the original text in English and the value is the translation of the corresponding language
ru: Ключ - оригинальный текст на английском и значение - перевод на соответсвующем языке

source: **French translations are always up to date**
ru: **Французские переводы всегда в актуальном состоянии**

source: Always use the last version (branch master)
ru: Всегда используйте последнюю версию (branch master)

source: Create a new translation:
ru: Создание нового перевода

source: Make a new directory: ``app/Locale/xx_XX`` for example ``app/Locale/fr_CA`` for French Canadian
ru: Создайте новую директорию: ``app/Locale/xx_XX``, например ``app/Locale/fr_CA`` для канадского фрацузского

source: Create a new file for the translation: ``app/Locale/xx_XX/translations.php``
ru: Создайте новый файл для перевода: ``app/Locale/xx_XX/translations.php``

source: Use the content of the French locales and replace the values
ru: Используйте как образец содержимое французского перевода (локализации) и замените значения

source: Update the file ``app/Model/Language.php``
ru: Внесите изменения в файл ``app/Model/Language.php``

source: Check with your local installation of Kanboard if everything is OK
ru: Проверьте добавленный язык на локальной версии Канборда

source: Send a `pull-request with Github <https://help.github.com/articles/using-pull-requests/>`__
ru: Пошлите `pull-request на Github <https://help.github.com/articles/using-pull-requests/>`__

source: How to update an existing translation?
ru: Как обновить имеющийся перевод?

source: Open the translation file ``app/Locale/xx_XX/translations.php``
ru: Откройте файл перевода ``app/Locale/xx_XX/translations.php``

source: Missing translations are commented with ``//`` and the values are empty, just fill blank and remove the comment
ru: Отсутсвующие переводы закоментированы - ``//`` и значения пустые, нужно заполнить значения и удалить коментарий

source: Check with your local installation of Kanboard and send a `pull-request <https://help.github.com/articles/using-pull-requests/>`__
ru: Проверьте внесенные изменения на локальной версии Канборда и пошлите `pull-request <https://help.github.com/articles/using-pull-requests/>`__

source: How to add new translated text in the application?
ru: Как добавить новый текст перевода в приложение?

source: Translations are displayed with the following functions in the source code:
ru: Переводы отображаются с помощью функций в исходном коде:

source: ``t()``: display text with HTML escaping
ru: ``t()``: показывает текст с HTML escaping

source: ``e()``: display text without HTML escaping
ru: ``e()``: показывает текст без HTML escaping

source: Always use the english version in the source code.
ru: Всегда используйте английскую версию исходного кода.

source: Text strings use the function ``sprintf()`` to replace elements:
ru: Текстовые строки используют функцию ``sprintf()`` для замены элементов:

source: ``%s`` is used to replace a string
ru: ``%s`` используется для замены строки

source: ``%d`` is used to replace an integer
ru: ``%d`` используется для замены цифры

source: All formats are available in the `PHP documentation <http://php.net/sprintf>`__.
ru: Ознакомится с доступными форматами вы можете в `документации PHP <http://php.net/sprintf>`__.

source: How to find missing translations in the applications?
ru: Как найти отсутствующие переводы в приложении?

source: From a terminal, run the following command:
ru: Из терминала запустите следующую команду:

source: All missing and unused translations are displayed on the screen. Put that in the French locale and sync other locales (see below).
ru: Все отсутствующие и неиспользуемые переводы будут показаны на экране. Добавьте их во французскую локализацию и синхронизируйте с другими локализациями (смотрите ниже)

source: How to synchronize translation files?
ru: Как синхронизировать файлы переводов?

source: From a Unix shell run this command:
ru: В оболочке Unix запустите следующую команду:

source: The French translation is used a reference to other locales.
ru: Французский перевод используется для ссылки на другие локализации.
