Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/update.po
Languages: ru

source: Upgrade Kanboard to a new version
ru: Обновление Канборд до новой версии

source: Upgrading Kanboard to a newer version is seamless. The process can be summarized to simply copy your data folder to the new Kanboard folder. Kanboard will run database migrations automatically for you.
ru: Обновление Канборда до новой версии бесшовное. Процесс сводится к тому, что надо просто скопировать каталог с данными из старой версии в новый Канборд. Канборд запустит миграцию баз данных автоматически.

source: Important things to do before updating
ru: Важные замечания перед обновлением

source: Always make a backup of your data before upgrading
ru: Перед обновлением, обязательно сделайте копию ваших данных со старой версии Канборда

source: Always read the `change log <https://github.com/fguillot/kanboard/blob/master/ChangeLog>`__ to check for breaking changes
ru: Всегда следите за `историей изменений <https://github.com/fguillot/kanboard/blob/master/ChangeLog>`__ для отслеживания критических изменений

source: Always close all user sessions (flush all sessions on the server)
ru: Всегда закрывайте все пользовательские сессии (очищайте все сессии на сервере)

source: From the archive (stable version)
ru: Обновление из архива (стабильная версия)

source: Decompress the new archive
ru: Скачайте и распакуйте архив с новой версией

source: Copy the content of your data folder into the newly uncompressed directory
ru: Скопируйте содержимое каталога с данными старой версии во вновь распакованный каталог

source: Copy your custom ``config.php`` if you have one
ru: Скопируйте из старой версии Канборда ``config.php``, если вы его создавали

source: Copy your plugins if necessary
ru: Скопируйте плагины, если есть

source: Make sure the directory ``data`` is writeable by your web server user
ru: Убедитесь, что директория ``data`` имеет права на запись от пользователя веб сервера

source: Test
ru: Проверьте работу новой версии

source: Remove your old Kanboard directory
ru: Удалите старую версию Канборда

source: From the repository (development version)
ru: Обновление из репозитория (разрабатываемая версия)

source: Login and check if everything is ok
ru: Выполните вход и проверьте, что все работает корректно

source: Note: This method will install the **current development version**, use at your own risk.
ru: **Внимание**: Выполняя обновление из разрабатываемой версии, вы должны понимать, что это нестабильная версия и берете все риски по работе Канборд на себя.
