Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/usage-examples.po
Languages: ru

source: Usage Examples
ru: Примеры использования

source: You can customize your boards according to your business activities:
ru: Вы можете настроить вашу доску в соответсвии с вашими бизнес-процессами

source: Software development
ru: Разработка программного обеспечения

source: Backlog
ru: Заказ

source: Ready
ru: Готов

source: Work in progress
ru: В работе

source: To be validated
ru: Требуется утверждение

source: Validated
ru: Утверждено

source: Deployed in production
ru: Развернуто в продакшн

source: Bug tracking
ru: Отслеживание ошибок

source: Reported
ru: Сообщение

source: Confirmed
ru: Подтверждено

source: Tested
ru: Проверено

source: Fixed
ru: Исправлено

source: Sales
ru: Продажи

source: Leads
ru: Клиенты

source: Meeting
ru: Встречи

source: Proposal
ru: Предложения

source: Purchase
ru: Приобретение

source: Lean business management
ru: Эффективное управление бизнесом

source: Ideas
ru: Идеи

source: Development
ru: События

source: Measure
ru: Мероприятия

source: Analysis
ru: Анализы

source: Done
ru: Исполненно

source: Recruiting process
ru: Подбор персонала

source: Job offers
ru: Предложения о работе

source: Candidates
ru: Кандидаты

source: Phone screens
ru: Телефонный отбор

source: Interviews
ru: Собеседование

source: Hires
ru: Наем

source: Online shops
ru: Онлайн магазин

source: Orders
ru: Заказы

source: Packaging
ru: Упаковка

source: Ready to send
ru: Готов к отправке

source: Shipped
ru: Отправлен

source: Manufactory
ru: Производство

source: Customer Orders
ru: Заказы покупателей

source: Assembly
ru: Сборка

source: Tests
ru: Проверка

source: Ready to ship
ru: Готово к отгрузке
