Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/user-management.po
Languages: ru

source: User Management
ru: Управление пользователями

source: Add a new user
ru: Создание нового пользователя

source: To add a new user, you must be an administrator.
ru: Только администратор может создавать нового пользователя.

source: From the dropdown menu in the top right corner, go to the menu **Users Management**
ru: В выпадающем меню, в правом верхнем углу, выберите **Управление пользователями**

source: On the top, you have a link **New local user** or **New remote user**
ru: Вверху имеются ссылки - **Новый локальный пользователь** и **Новый удаленный пользователь**

source: Fill the form and save
ru: При создании пользователя нужно заполнить форму и сохранить

source: New user
ru: Рисунок. Форма создания нового пользователя.

source: When you create a **local user**, you have to specify at least those values:
ru: При создании **Локального пользователя** вы должны, как минимум, заполнить следующие поля:

source: **username**: This is the unique identifier of your user (login)
ru: **Имя пользователя**: это поле является уникальным идентификатором вашего пользователя (логин)

source: **password**: The password of your user must have at least 6 characters
ru: **Пароль**: Пароль пользователя должен иметь минимум 6 символов

source: For **remote users**, only the username is mandatory.
ru: Для **удаленных пользователей** обязательно только **Имя пользователя**.

source: Edit users
ru: Редактирование пользователей

source: When you go to the **users** menu, you have the list of users, to modify a user click on the **edit link**.
ru: После перехода в **Управление пользователями**, вам будет доступен список пользователей. Кликните на пользователя в столбце **Имя пользователя**. Далее, вам будет доступно редактирование настроек и профиля пользователя.

source: If you are a regular user, you can change only your own profile
ru: Если вы имеете права пользователя, то вы сможете только изменить ваш профиль

source: You have to be an administrator to be able to edit any users
ru: Для редактирования любого пользователя вам должны быть назначены права администратора

source: Remove users
ru: Удаеление пользователей

source: From the **users** menu, click on the link **remove**. This link is visible only if you are administrators.
ru: В списке пользователей выберите в колонке **Действия** в выпадающем меню **Удалить**. Эта ссылка доступна только для администраторов.

source: If you remove a specific user, **tasks assigned to this person will be unassigned** after the operation.
ru: Если вы удалите пользователя, то все задачи назначенные пользователю перестанут быть назначенными.
