Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/user-mentions.po
Languages: ru

source: User Mentions
ru: Ссылка на пользователя

source: Kanboard offers the possibility to send notifications when someone is mentioned.
ru: В Канборде есть возможность посылать уведомления пользователю, если кто-то ссылается на него в тексте.

source: If you need to get the attention of someone in a comment or in a task, use the @ symbol followed by their username. Kanboard will automatically suggest a list of users:
ru: Если вы хотите заострить внимание о ком-либо в комментарии или в задаче, то вы можете использовать символ @ и следом указать имя пользователя. Канборд автоматически предлагает список пользователей:

source: User Mention
ru: Рисунок. Ссылка на пользователя.

source: At the moment, only the task description and the comment text area have this feature enabled.
ru: В данный момент, добавлять ссылку на пользователя можно только в описании задачи и тексте комментария.

source: The user mentions works only during tasks and comments creation.
ru: Ссылка на пользователя работает только в задачах и при создании комментария.

source: To be notified, mentioned users need to be a member of the project.
ru: Для получения уведомления, пользователь, на которого ссылаются, должен быть участником проекта, в котором создается ссылка.

source: When someone is mentioned, this user will receive a notification.
ru: Если была создана ссылка на пользователя, то этот пользователь получит уведомление.

source: The @username mention is linked to the public user profile.
ru: @username - выглядит как ссылка на публичный профиль пользователя.

source: The notification is sent according to the user settings, it can be an email, a web notification or even a message on Slack/Hipchat/Jabber if you have installed the right plugins.
ru: Уведомление посылаются пользователю в соответсвии с пользовательскими настройками: это может быть email, уведомление на веб странице или даже сообщение в Slack/Hipchat/Jabber, если вы установили соответсвующие плагины.
