Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/webhooks.po
Languages: ru

source: Webhooks are useful to perform actions with external applications.
ru: Webhooks служат для взаимодействия с внешними приложениями. Webhook посылает уведомление стороннему приложению о событиях, которые произошли в Канборд.

source: Webhooks can be used to create a task by calling a simple URL (You can also do that with the API)
ru: Webhooks могут быть использованы для создания задач вызовом простого URL (Вы можете сделать это и при помощи API)

source: An external URL can be called automatically when an event occurs in Kanboard (task creation, comment updated, etc)
ru: Обращение к внешнему приложению может происходить автоматически, когда наступает какое-либо событие в Канборд (создана задача, обновлен комментарий и т.д.)

source: How to write a web hook receiver?
ru: Как написать webhook приемник во внешнем приложении?

source: All internal events of Kanboard can be sent to an external URL.
ru: Все внутренние события в Канборде могут быть посланы во внешний URL.

source: The web hook URL has to be defined in **Settings > Webhooks > Webhook URL**.
ru: Webhook URL (url приемник внешнего приложения) может быть задан в **Настройки** -> **Webhooks** -> **Webhook URL**

source: When an event is triggered Kanboard calls the pre-defined URL automatically
ru: Когда в Канборде происходит событие, Канборд обращается к указанному URL автоматически

source: The data are encoded in JSON format and sent with a POST HTTP request
ru: Данные конвертируются в формат JSON и передаются с помощью POST HTTP запроса

source: The web hook token is also sent as a query string parameter, so you can check if the request really comes from Kanboard.
ru: Webhook ключ передается в составе запроса в виде строкового параметра. Таким образом, вы можете проверить, что запрос на самом деле пришел из Канборда.

source: **Your custom URL must answer in less than 1 second**, those requests are synchronous (PHP limitation) and that can slow down the user interface if your script is too slow!
ru: **Созданный вами URL должен среагировать в течении 1 секунды**. Это желательно сделать потому, что запросы являются синхронными (ограничения языка PHP) и возможны тормоза в пользовательском интерфейсе, если скрипт будет слишком медленный!

source: List of supported events
ru: Список поддерживаемых событий

source: comment.create
ru: comment.create (комментарий.создать)

source: comment.update
ru: comment.update (комментарий.обновить)

source: file.create
ru: file.create (файл.создать)

source: task.move.project
ru: task.move.project (задача.переместить.проект)

source: task.move.column
ru: task.move.column (задача.переместить.колонка)

source: task.move.position
ru: task.move.position (задача.переместить.место)

source: task.move.swimlane
ru: task.move.swimlane (задача.переместить.дорожка)

source: task.update
ru: task.update (задача.обновить)

source: task.create
ru: task.create (задача.создать)

source: task.close
ru: task.close (задача.закрыть)

source: task.open
ru: task.open (задача.открыть)

source: task.assignee\_change
ru: task.assignee\_change (задача.назначить\_изменить)

source: subtask.update
ru: subtask.update (подзадача.обновить)

source: subtask.create
ru: subtask.create (подзадача.создать)

source: Example of HTTP request
ru: Пример HTTP запроса

source: All event payloads are in the following format:
ru: Функциональная часть всех событий имеет следующий формат:

source: The ``event_data`` values are not necessary normalized across events.
ru: Значения ``event_data`` могут быть неупорядочены в событиях.

source: Examples of event payloads
ru: Пример функциональной части события

source: Task creation:
ru: Создание задачи:

source: Task modification:
ru: Изменение задачи:

source: Task update events have a field called ``changes`` that contains updated values.
ru: События изменеия задачи имеют поле ``changes``, которое содержит обновленные значения.

source: Move a task to another column:
ru: Перемещение задачи в другую колонку:

source: Move a task to another position:
ru: Перемещение задачи в другое место:

source: Comment creation:
ru: Создание комментария:

source: Comment modification:
ru: Изменение комментария:

source: Subtask creation:
ru: Создание подзадачи:

source: Subtask modification:
ru: Изменение подзадачи:

source: File upload:
ru: Загрузка файла:

source: Screenshot created:
ru: Создан снимок экрана:
