Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/what-*-kanban.po
Languages: ru

source: What is Kanban?
ru: Что такое Kanban?

source: Kanban is a methodology originally developed by Toyota to be more efficient.
ru: Kanban - методология, которая первоначально применила компания Toyota для увеличения производительности.

source: There are only two constraints imposed by Kanban:
ru: Смысл Kanban заключается в следующем:

source: Visualize your workflow
ru: Визуализация рабочих процессов

source: Limit your work in progress
ru: Уменьшение времени для достижения цели

source: Your work is displayed on a board, you have a clear overview of your project
ru: Ваш рабочий процесс отображается на доске и вы ясно видете картину вашего проекта

source: Each column represents a step in your workflow
ru: Каждая колонка представляет шаг вашего рабочего процесса

source: Bring focus and avoid multitasking
ru: Сосредоточте внимание и избегайте многозадачности

source: Each phase can have a work in progress limits
ru: Каждая фаза может иметь работу ограниченную временем

source: Limits are great to identify bottlenecks
ru: Уменьшайте объем для определения узких мест

source: Limits avoid working on too many tasks at the same time
ru: Ограничте количество одновременно выполняемых задач

source: Measure performance and improvement
ru: Подсчет производительности и улучшений

source: Kanban uses lead and cycle times to measure performance:
ru: Kanban использует время выполнения (lead time) и время цикла (cycle time) для подсчета производительности:

source: **Lead time**: Time between the task is created and completed
ru: **Время выполнения**: Время между созданием задачи и ее завершением

source: **Cycle time**: Time between the task is started and completed
ru: **Время цикла**: Время между началом выполнения задачи и ее завершением

source: For example, you may have a lead time of 100 days and only have to work 1 hour to complete the task.
ru: Например, вам заложено время выполнения - 100 дней, а затратили на выполнение задачи (время цикла) всего 1 час.
