Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/windows-apache-installation.po
Languages: ru

source: Installation on Windows Server and Apache
ru: Установка Канборд на Windows Server и Apache

source: This guide will help you to setup step by step Kanboard on a Windows Server with Apache and PHP.
ru: Это руководство поможет вам шаг за шагом установить Канборд на Windows Server с Apache и PHP

source: Note: If you have a 64 bits platform choose "x64" otherwise choose "x86" for 32-bit systems.
ru: **Внимание**: Если у вас 64 разрядная платформа, то вам нужно выбрать "x64", и выберите "x86" для 32 разрядной операционной системы.

source: Visual C++ Redistributable Installation
ru: Установка распространяемого пакета Visual C++

source: PHP and Apache are compiled with Visual Studio so you need to install this library if it's not already done.
ru: PHP и Apache скомпилированы с Visual Studio, поэтому вам нужно установить эту библиотеку, если вы не сделали это ранее.

source: Download the library from the `official Microsoft website <http://www.microsoft.com/en-us/download/details.aspx?id=30679>`__
ru: Скачайте библиотеку с `официального вебсайта Microsoft <http://www.microsoft.com/en-us/download/details.aspx?id=30679>`__

source: Run the installer ``vcredist_x64.exe`` or ``vcredist_x86.exe`` according to your platform
ru: Запустите установку ``vcredist_x64.exe`` или ``vcredist_x86.exe``, в соответствии с вашей платформой

source: Apache installation
ru: Установка Apache

source: Download Apache binary from `Apache Lounge <http://www.apachelounge.com/download/>`__
ru: Скачайте исходники Apache с `Apache Lounge <http://www.apachelounge.com/download/>`__

source: Unzip the Apache24 folder to ``C:\Apache24``
ru: Разархивируйте Apache24 в каталог ``C:\Apache24``

source: Define the server name
ru: Назначение имени сервера

source: Open the file ``C:\Apache24\conf\httpd.conf`` and add the directive:
ru: Откройте файл ``C:\Apache24\conf\httpd.conf`` и добавьте директиву:

source: Install the Apache service
ru: Установка сервиса Apache

source: Open a command prompt (``cmd.exe``) and go to the directory ``C:\Apache24\bin``:
ru: Откройте консоль (``cmd.exe``), перейдите в каталог ``C:\Apache24\bin`` и установите сервис Apache:

source: Install ApacheMonitor
ru: Установка ApacheMonitor

source: Double click on ``C:\Apache24\bin\ApacheMonitor.exe``, or put it in your startup folder.
ru: Выполните ``C:\Apache24\bin\ApacheMonitor.exe`` и добавьте его в автозагрузку.

source: Right click on the icon and start Apache
ru: Теперь во всплывающем меню, при нажатии правой кнопки мыши на иконке, нажмите запустить Apache

source: Check the Apache installation
ru: Проверка работы Apache

source: Go to http://localhost/ you should see a blank page with the text "It works!".
ru: В браузере откройте http://localhost/. Вы должны увидеть пустую страницу и текст "It works!".

source: PHP installation
ru: Установка PHP

source: Download the last stable version of PHP from the `official PHP website <http://windows.php.net/download/>`__, choose the **Thread Safe** version and use the exact same build type as Apache: x86 or x64
ru: Скачайте последнюю стабильную версию PHP с `официального сайта PHP <http://windows.php.net/download/>`__, выберите версию **Thread Safe** и используйте соответствующую разрядность: x86 or x64.

source: Unzip the files to ``C:\php``
ru: Разархивируйте файлы в ``C:\php``

source: Navigate to the PHP folder and rename the file ``php.ini-production`` to ``php.ini``
ru: Перейдите в каталог PHP (``C:\php``) и переименуйе файл ``php.ini-production`` в ``php.ini``

source: Edit the ``php.ini``:
ru: Отредактируйте ``php.ini``:

source: Uncomment extension directory:
ru: Раскоментируйте директорию расширений:

source: Uncomment these PHP modules:
ru: Раскоментируйте следующие модули PHP:

source: Set the time zone:
ru: Установите часовой пояс:

source: The list of supported time zones can be found in the `PHP documentation <http://php.net/manual/en/timezones.america.php>`__.
ru: Список всех поддерживаемых часовых поясов можно посмотреть в `документации PHP <http://php.net/manual/en/timezones.america.php>`__.

source: Load the PHP module for Apache:
ru: Загрузка модулей PHP для Apache:

source: Add this configuration in the file ``C:\Apache24\conf\httpd.conf``:
ru: Добавьте следующие строки конфигурации в файл ``C:\Apache24\conf\httpd.conf``:

source: Restart Apache.
ru: Перезапустите Apache.

source: Test your PHP installation:
ru: Проверка работы PHP:

source: Create a file named ``phpinfo.php`` in the folder ``C:\Apache24\htdocs``:
ru: Создайте файл ``phpinfo.php`` в каталоге ``C:\Apache24\htdocs``:

source: Go to http://localhost/phpinfo.php and should see all information about your PHP installation.
ru: Откройте в браузере http://localhost/phpinfo.php и вы должны увидеть информацию о PHP.

source: Kanboard installation
ru: Устновка Канборд

source: Download the zip file
ru: `Скачайте zip файл <https://kanboard.net/downloads>`__

source: Decompress the archive in ``C:\Apache24\htdocs\kanboard`` by example
ru: Разархивируйте архив в ``C:\Apache24\htdocs\kanboard``

source: Open your web browser to use Kanboard http://localhost/kanboard/
ru: Откройте в браузере http://localhost/kanboard/. Ура. Теперь вы можете работать в Канборд. Все легко и просто.

source: The default credentials are **admin/admin**
ru: Учетная запись и пароль по умолчанию - **admin/admin**

source: Tested configuration
ru: Протестировано на

source: Notes
ru: Примечание

source: Some features of Kanboard require that you run `a daily background job <cronjob.markdown>`__.
ru: Некоторые функции Канборда требуют выполнять `запуск ежедневных фоновых задач <cronjob.html>`__.
