Repository: hairetdin/kanboard-doc-ru
Catalog: source/locale/*/LC_MESSAGES/windows-iis-installation.po
Languages: ru

source: Installation on Windows 2008/2012 with IIS
ru: Инсталяция Kanboard на Windows 2008/2012 с IIS

source: This guide will help you to setup step by step Kanboard on a Windows Server with IIS and PHP.
ru: Это пошаговое руководство поможет вам установить Канборд на Windows Server с IIS и PHP.

source: PHP installation
ru: Установка PHP

source: Install IIS on your server (Add a new role and don't forget to enable CGI/FastCGI)
ru: Установите IIS на ваш Windows сервер (Добавьте новую роль и не забудьте включить CGI/FastCGI)

source: Install PHP by following the official documentation:
ru: При инсталяции PHP можете использовать следующую официальную документацию:

source: Edit the ``php.ini``, uncomment these PHP modules:
ru: Отредактируйте ``php.ini``, раскоментируйте эти PHP модули:

source: Set the time zone:
ru: Установите часовой пояс

source: The list of supported time zones can be found in the `PHP documentation <http://php.net/manual/en/timezones.america.php>`__.
ru: Список поддерживаемых часовых поясов можно посмотреть в `документации PHP <http://php.net/manual/en/timezones.america.php>`__.

source: Check if PHP runs correctly:
ru: Проверьте, что PHP работает корректно:

source: Go the IIS document root ``C:\inetpub\wwwroot`` and create a file ``phpinfo.php``:
ru: Перейдите в корневой каталог IIS ``C:\inetpub\wwwroot`` и создайте файл ``phpinfo.php``, со следующим содержимым:

source: Open a browser at ``http://localhost/phpinfo.php`` and you should see the current PHP settings. If you got an error 500, something is not correctly done in your installation.
ru: В браузере откройте страницу ``http://localhost/phpinfo.php`` и вы должны увидеть текущие настройки PHP. Если вы видите ошибку 500, значит что-то сделано неправильно при установке.

source: Notes:
ru: Примечание:

source: If you use PHP < 5.4, you have to enable the short tags in your php.ini
ru: Если вы используете PHP < 5.4, то необходимо включить короткие теги (short tags) в php.ini

source: Don't forget to enable the required php extensions mentioned above
ru: Не забудьте включить необходимые php расширения, упомянутые выше

source: If you got an error about "the library MSVCP110.dll is missing", you probably need to download the Visual C++ Redistributable for Visual Studio from the Microsoft website.
ru: Если вы наблюдаете ошибку "the library MSVCP110.dll is missing", то возможно вам нужно скачать распространяемый пакет Visual C++ для Visual Studio с сайта Microsoft.

source: Kanboard installation
ru: Установка Канборд

source: Download the zip file
ru: Скачайте zip файл

source: Decompress the archive in ``C:\inetpub\wwwroot\kanboard`` by example
ru: Распакуйте архив в ``C:\inetpub\wwwroot\kanboard`` (например)

source: Make sure the directory ``data`` is writable by the IIS user
ru: Убедитесь, что у пользователя вебсервера IIS имеется доступ на запись на директорию ``data``

source: Open your web browser to use Kanboard http://localhost/kanboard/
ru: Откройте веб браузер и используйте Kanboard http://localhost/kanboard/

source: The default credentials are **admin/admin**
ru: Пользователь и пароль по умолчанию - **admin/admin**

source: Tested configurations
ru: Работа Канборд тестировалось на

source: Notes
ru: Примечание

source: Some features of Kanboard require that you run `a daily background job <cronjob.markdown>`__.
ru: Некоторые возможности Канборда требуют `запуск выполнения ежедневных фоновых задач <cronjob.html>`__.
